import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

import {Learning_Draw} from '../../../constants/constants';

const BACK_LINK = Learning_Draw;

class BenefitOfDrawing extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Польза рисования для детей
        <br/>{'     '}О том, для чего необходимо поддерживать в  ребенке желание рисовать, можно говорить бесконечно. Однозначно и неоспоримо то, что рисование приносит только пользу, причем не только детям, но и их родителям. Недаром, чтобы понять и проанализировать внутренний мир малыша, найти его уязвимые стороны, чтобы в дальнейшем помочь ему, психологи проводят тестирование посредством рисунка. Выражая в рисунках свои чувства и эмоции, дети подсознательно дают понять свое мировосприятие, что для них главное, а что второстепенное.
        <br/>{'     '}Благодаря умению рисовать у детей формируется их собственное «Я». Малыш уже понимает, что не только мама и папа могут что-то сделать, но и он сам, выражая при этом реальность, основанную на личном восприятии – «у меня есть свое мнение», «я вижу это так». Когда ребенок учится рисовать, у него активно развиваются и левое, и правое полушарие мозга. Он одновременно и экспериментирует, и играет. Это способствует развитию речи, внимания, памяти, мышления, зрительных и осязательных навыков, мелкой моторики, совершенствует воображение, вырабатывает в детях самоорганизацию, дисциплину и усидчивость, что очень важно для подготовки к школьному учебному процессу. Замечательным фактором в процессе рисования является ориентация ребенка на результат, его желание доводить дело до конца, что во взрослой жизни станет неоценимым качеством для достижения успехов в любом начинании. И еще важно отметить то, что для деток рисование по вечерам является альтернативой активным играм, помогая тем самым привести в спокойствие нервную систему, что благоприятствует здоровому сну.
        <br/>{'     '}<b>Что купить для рисования ребенку</b>
        <br/>{'     '}Приблизительно к пяти годам, когда ребенок может различать фигуры и сравнительно правильно рисовать их на бумаге, когда уверенно держит в руках карандаш, стоит уделить более тщательное внимание выбору принадлежностей для рисования.
        <br/>{'     '}Первое, это естественно бумага. Она должна быть плотной, чтобы при ерзании по ней ручонками и локтями, шедевр, а соответственно и настроение, не были испорчены. Так как фантазии деток нет предела, и в любой момент возникнет желание прибавить что-то к основной картинке, то формат бумаги необходимо выбирать побольше, например, А3.
        <br/>{'     '}Это необходимо еще и из тех соображений, что ребенок только учиться фокусировать зрение и развивать глазомер. Увлекшись рисованием головы животного, маленький художник может совсем не оставить места для туловища.
        <br/>{'     '}Немаловажны для рисования качественные карандаши. Чем больше будет их палитра, тем веселее и интереснее малышу будет рисовать. Познавая новые цвета, он пополняет свой словарный запас, тем самым развивая речь.
        <br/>{'     '}Карандаши не должны ломаться, но при этом быть мягкими и жирными. Замечательно, если у каждого цвета будет один карандаш посветлее и один потемнее. Простой карандаш на данном этапе не важен, ведь ребенку хочется сразу все и сейчас.
        <br/>{'     '}Понятие «предварительный набросок» в этом возрасте отягощает процесс рисования и совсем не нужен малышу. Не стоит забывать и про точилку для карандашей – она должна быть очень качественной.
        <br/>{'     '}Из красок стоит остановить свой выбор на гуашевых, так как их плотность позволяет накладывать цветные слои друг на друга. Это важно, например, тогда, когда нужно наложить один слой на другой, закрасить испорченные детали.
        <br/>{'     '}Количество цветов в красках для художников этого возраста не должно превышать десяти, но и шесть баночек с краской ребенку будет маловато. Ведь малышу обязательно захочется смешать их все и получить новые оттенки.
        <br/>{'     '}Кисточке же следует уделить особое внимание. Желательно, чтобы ее ручка была пластиковой – такую будет трудно поломать. Капсюль должна быть неподвижной и не должна царапать кожу пальцев. Ее диаметр нужно выбрать таким, чтобы соответствовал диаметру обыкновенной шариковой ручки, что впоследствии поможет ребенку при письме в школе.
        <br/>{'     '}Что касается волосяного пучка, то тут следует остановить свой выбор на щетине – она не так сильно поглощает краску, как ворс пони или белки, и легче наносится мазками. Длина кисточки должна быть такой, чтобы не задевала лицо.
        <br/>{'     '}Фломастеры выигрывают своей яркостью, по сравнению с карандашами. А в сравнении с красками плюс оттого, что нет нужды в воде, не нужно ждать, пока рисунок высохнет, и фломастеры можно брать на улицу. Чем больше их оттенков, тем лучше.
        <br/>{'     '}Ну и, конечно же, для улицы необходимо иметь цветные мелки, ведь неизвестно, когда малыша посетит вдохновение. Лучше, чтобы размеры мелков были покрупнее, тогда они не будут ломаться, а ребенок не травмирует себе пальцы при рисовании.
        <br/>{'     '}И важно помнить, что рисование – это творчество, плохих рисунков не бывает, бывает разное мировоззрение и мировосприятие, и за любой шедевр нужно похвалить, ведь ребенок старался изо всех сил.
        <br/>{'     '}Источник: http://childage.ru/dosug/chem-zanyat-rebenka/tvorchestvo/kak-nauchit-rebenka-risovat-v-5-let-poetapno-prostyie-risunki.html


      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Польза рисования для детей'} backLink={BACK_LINK}/>
    );
  }
}

export default BenefitOfDrawing;
