import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class BreathingExercises extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}<b>Цель</b> проведения дыхательной гимнастики с дошкольниками — это, прежде всего, укрепление их здоровья. Значение такой гимнастики для общего физического развития дошколят велико, ведь:
        <br/>{'     '}•	упражнения для органов дыхания помогают насытиться кислородом каждой клеточке организма ребёнка;
        <br/>{'     '}•	упражнения учат ребятишек управлять своим дыханием, что, в свою очередь, формирует умение управлять собой;
        <br/>{'     '}•	правильное дыхание улучшает работу головного мозга, сердца и нервной системы ребёнка, дыхательной и пищеварительной системы организма, укрепляет общее состояние здоровья;
        <br/>{'     '}•	дыхательная гимнастика — отличная профилактика болезней органов дыхания.
        <br/>{'     '}Медленный выдох поможет ребёнку успокоиться, расслабиться, справиться с волнением и раздражительностью, тем самым, поможет избежать стресса.
        <br/>{'     '}<b>Дыхательную гимнастику полезно будет выполнять</b>, прежде всего, дошкольникам, которые часто болеют простудными заболеваниями, бронхитами и бронхиальной астмой. У детей, страдающими заболеваниями органов дыхания, выполнение дыхательных упражнений значительно облегчает болезнь, сокращает её длительность и уменьшает возможность развития осложнений. В этом случае дыхательная гимнастика играет роль дополнения к традиционному лечению (медикаментозному и физиотерапевтическому).
        <br/>{'     '}Правильно подобранный комплекс упражнений дыхательной гимнастики поможет развитию ещё несовершенной дыхательной системы ребёнка и укрепит защитные силы его организма.
        <br/>{'     '}<b>Основа гимнастики</b> — носовое дыхание, ведь оно стимулирует нервные окончания всех органов, которые находятся в носоглотке.
        <br/>{'     '}Дыхательные упражнения подходят для всех возрастных групп дошкольников. Они могут проводиться  дома.
        <br/>{'     '}Вначале дыхательные упражнения покажутся детям непростыми, поэтому взрослым необходимо помочь ребятишкам их освоить, обратив скучные движения в весёлую игру.
        <br/>{'     '}<b>Основная задача</b> — научить малыша правильно, достаточно глубоко дышать, при этом максимально наполняя лёгкие, вдыхая, и расширяя грудную клетку, а выдыхая — освобождать лёгкие от воздуха, который там остался, выталкивая его с помощью сжатия лёгких. Ребёнок, который не до конца выдыхает, оставляет в лёгких «отработанный» воздух, мешающий поступлению свежего воздуха в нужном объёме.
        <br/>{'     '}Немаловажно использовать и упражнения, направленные, наоборот, на быстрое поверхностное дыхание.
        <br/>{'     '}
        <p style={{textAlign: 'center', margin: '0px'}}><b>Как проводить дыхательную гимнастику с дошкольником</b></p>
        <br/>{'     '}1.	Дыхательную гимнастику с детьми дошкольного возраста можно проводить дважды в течение 10-30 минут, и делать это лучше не ранее, чем через час после приёма пищи.
        <br/>{'     '}2.	Важно, чтобы занятия были проведены в интересной детям игровой форме.
        <br/>{'     '}3.	Чтобы детям было интересно, упражнения можно называть по-детски, забавно (ниже вы увидите примеры).
        <br/>{'     '}4.	Можно выдумывать свои упражнения, модифицировав стандартные.
        <br/>{'     '}5.	Интересной будет дыхательная гимнастика с применением игрушек.
        <br/>{'     '}6.	Полезно выполнять упражнения на улице в тёплое время года, на свежем воздухе.
        <br/>{'     '}7.	Если занятия проводятся в помещении, то нужно предварительно проветривать его.
        <br/>{'     '}8.	Заниматься нужно в лёгкой одежде и при температуре воздуха не выше 17-20 Сº.
        <br/>{'     '}9.	Важно постоянно заниматься дыхательной гимнастикой с ребёнком, так как результаты занятий будут видны только после продолжительного курса.
        <br/>{'     '}10.	Нагрузку можно увеличивать постепенно, увеличивая число повторений и усложняя упражнения.
        <br/>{'     '}Если родителям важно приучить ребёнка делать дыхательные упражнения, то неплохо делать их вместе с ним
        <br/>{'     '}
        <p style={{textAlign: 'center', margin: '0px'}}><b>Техника проведения дыхательной гимнастики</b></p>
        <br/>{'     '}Дыхательную гимнастику кроме  педагогов, инструкторов,  медицинских работников  могут проводить и родители.
        <br/>{'     '}В основе методики проведения занятий дыхательной гимнастики для дошкольников — специальные статические и динамические дыхательные упражнения. А в основе самих дыхательных упражнений лежит упражнение с удлинённым и усиленным выдохом, сочетаемое с физическими упражнениями, которые направлены на общее укрепление организма и физическое развитие ребёнка. Этого можно достичь, произнося в момент отрабатывания упражнений гласные звуки (а-а-а, о-о-о, у-у-у), шипящие согласные (ж, ш) и сочетания звуков (ах, ха, фу, ух,). Всё это лучше делать именно в игровой форме, например: жужжит пчёлка, гудит самолёт, едет поезд и т. д.).
        <br/>{'     '}
        <p style={{textAlign: 'center', margin: '0px'}}><b>Комплекс дыхательных упражнений игрового характера</b></p>
        <br/>{'     '}<b>1. Ходьба.</b> Встать прямо, голову не опускать, ноги вместе, плечи опущены и отведены назад, грудная клетка развёрнута. Проверить осанку. Обычная ходьба; ходьба на носках; ходьба на пятках; ходьба на наружном своде стопы. Повторить все виды ходьбы, меняя направление движения по залу. Следить за осанкой. Продолжительность ходьбы 40-60 с. Педагог говорит стихи, направляя ими детей на нужные движения:
        <br/>{'     '}Мы проверили осанку
        <br/>{'     '}И свели лопатки.
        <br/>{'     '}Мы походим на носках,
        <br/>{'     '}Мы идём на пятках,
        <br/>{'     '}Мы идём, как все ребята,
        <br/>{'     '}И как мишка косолапый
        <br/>{'     '}(<i>стихи Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b>2. «Куры».</b> Дети стоят, наклонившись пониже, свободно свесив руки - «крылья» и опустив голову. Произносят «тах-тах-тах», одновременно похлопывая себя по коленям – выдох, выпрямляясь, поднимают руки к плечам – вдох.
        <br/>{'     '}Повторить 3-5 раз:
        <br/>{'     '}Бормочут куры оп ночам,
        <br/>{'     '}Бьют крыльями тах-тах (<i>выдох</i>),
        <br/>{'     '}Поднимем руки мы к плечам (<i>вдох</i>),
        <br/>{'     '}Потом опустим – так
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b>3. «Самолёт».</b> Дети стоят. Развести руки в стороны ладонями кверху. Поднять голову вверх – вдох. Сделать поворот в сторону, произнося «жжж...» - выдох; стать прямо, опустить руки – пауза.
        <br/>{'     '}Повторить 2-4 раза в каждую сторону:
        <br/>{'     '}Расправил крылья самолёт,
        <br/>{'     '}Приготовились в полёт.
        <br/>{'     '}Я направо погляжу:
        <br/>{'     '}Жу-жу-жу.
        <br/>{'     '}Я налево погляжу:
        <br/>{'     '}Жу-жу-жу
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b></b>4. «Насос». Дети стоят. Скользя руками вдоль туловища, наклоняться поочерёдно вправо и влево. Наклоняясь, выдох с произнесением звука «ссс...», выпрямляясь – вдох.
        <br/>{'     '}Повторять 4-6 раз:
        <br/>{'     '}Это очень просто –
        <br/>{'     '}Покачай насос ты.
        <br/>{'     '}Направо, налёг...
        <br/>{'     '}Руками скользя,
        <br/>{'     '}Назад и вперёд
        <br/>{'     '}Наклоняться нельзя.
        <br/>{'     '}Это очень просто –
        <br/>{'     '}Покачай насос ты
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b>5. «Дом маленький, дом большой».</b> Дети стоят. Присесть, обхватив руками колени, опустить голову – выдох с произнесением звука «ш-ш-ш» («у зайки дом маленький»). Выпрямиться, встать на носки, поднять руки вверх, потянуться, посмотреть на руки – вдох («у медведя дом большой»). Ходьба по залу: «Мишка наш пошёл домой, да и крошка заинька».
        <br/>{'     '}Повторить 4-6 раз:
        <br/>{'     '}У медведя дом большой,
        <br/>{'     '}А у зайки – маленький.
        <br/>{'     '}Мишка наш пошёл домой
        <br/>{'     '}Да и крошка заинька
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b>6. «Подуем на плечо».</b> Дети стоят, руки опущены, ноги слегка расставлены. Повернуть голову налево, сделать губы трубочкой – подуть на плечо. Голова прямо – вдох. Голову вправо – выдох (губы трубочкой). Голова прямо – вдох носом. Опустить голову, подбородком касаясь груди, - вновь сделать спокойный, слегка углублённый выдох. Голова прямо – вдох носом. Поднять лицо кверху и снова подуть через губы, сложенные трубочкой.
        <br/>{'     '}Повторить 2-3 раза:
        <br/>{'     '}Подуем на плечо,
        <br/>{'     '}Подуем на другое.
        <br/>{'     '}Нас солнце горячо
        <br/>{'     '}Пекло дневной порой.
        <br/>{'     '}Подуем на живот,
        <br/>{'     '}Как трубка станет рот.
        <br/>{'     '}Ну а теперь на облака
        <br/>{'     '}И остановимся пока.
        <br/>{'     '}Потом повторим всё опять:
        <br/>{'     '}Раз, два и три, четыре, пять
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b>7. «Косарь».</b> Дети стоят, ноги на ширине плеч, руки опущены. Махом перевести руки в сторону влево, назад, вправо. Вернуться в исходное положение. Слегка отклониться назад – вдох. Махом снова перевести руки через перёд влево со звуком «зз-уу». Педагог читает стихи, а дети повторяют вместе с ним слоги «зу-зу», делая упражнение. Стихотворение, сопровождаемое упражнениями, прочитывается 3-4 раза:
        <br/>{'     '}Косарь идёт косить жнивьё:
        <br/>{'     '}Зу-зу, зу-зу, зу-зу.
        <br/>{'     '}Идём со мной косить вдвоём:
        <br/>{'     '}Замах направо, а потом
        <br/>{'     '}Налево мы махнём.
        <br/>{'     '}И так мы справимся с жнивьём.
        <br/>{'     '}Зу-зу, зу-зу вдвоём
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}<b>8. «Цветы».</b> Дети стоят по кругу. Педагог читает им стихи:
        <br/>{'     '}Каждый бутончик склониться бы рад
        <br/>{'     '}Направо, налево, вперёд и назад.
        <br/>{'     '}От ветра и зноя бутончики эти
        <br/>{'     '}Спрятались живо в цветочном букете
        <br/>{'     '}(<i>Е. Антоновой-Чалой</i>).
        <br/>{'     '}По команде педагога дети ритмично под чтение стиха поворачивают голову («бутончики») направо, налево, наклоняют её вперёд, отводят назад, чередуя вдох и выдох. При чтении последней строки стиха дети поднимают руки вверх, склоняя кисти над головой: «бутончики» (головы) спрятались.
        <br/>{'     '}Упражнение повторить 6-8 раз.
        <br/>{'     '}<b>9. «Ёж».</b> Дети ложатся на спину (на ковёр), руки прямые, вытянуты за голову. В этом положении по команде педагога дети делают глубокий вдох через нос при чтении двустишия:
        <br/>{'     '}Вот свернулся ёж в клубок,
        <br/>{'     '}Потому что он продрог.
        <br/>{'     '}Дети руками обхватывают колени и прижимают согнутые ноги к груди, делая полный, глубокий выдох при чтении стиха:
        <br/>{'     '}Лучик ёжика коснулся,
        <br/>{'     '}Ёжик сладко потянулся.
        <br/>{'     '}Дети принимают исходное положение и потягиваются, как ёжик, становятся «большими, вырастают», а затем, расслабляясь, делают спокойный вдох и выдох через нос. Всё упражнение повторить 4-6 раз.
        <br/>{'     '}<b>10. «Трубач».</b> Дети стоят или сидят. Кисти сжаты и как бы удерживают трубу; поднося «трубу» ко рту, дети произносят:
        <br/>{'     '}Тру-ру-ру, бу-бу-бу!
        <br/>{'     '}Подудим в свою трубу.
        <br/>{'     '}<b>11. «Жук».</b> Дети сидят, скрестив руки на груди. Опустить голову. Ритмично сжимать обеими руками грудную клетку, произнося «жжж...» - выдох.
        <br/>{'     '}Развести руки в стороны, расправив плечи, голову держать прямо – вдох.
        <br/>{'     '}Повторить упражнение 4-5 раз:
        <br/>{'     '}Жж-у, - сказал крылатый жук,
        <br/>{'     '}Посижу и пожужжу.
        <br/>{'     '}
        <br/>{'     '}<b>Дыхательная гимнастика для старшей и подготовительной группы</b>
        <br/>{'     '}<b>ДЫХАНИЕ ПО МЕТОДИКЕ А. Н. СТРЕЛЬНИКОВОЙ</b>
        <br/>{'     '}<b>КОМПЛЕКСЫ УПРАЖНЕНИЙ</b>
        <br/>{'     '}<b>«Разминка».</b> И. п. - стоя, ноги на ширине плеч, туловище прямое руки полусогнуты в. локтях, пальцы слегка сжаты в кулаки, повернутые друг к другу. Присесть, скрестив руки навстречу друг другу, вдох носом - активный, быстрый, ясно слышимый. Вернуться в и. п. Отдохнуть. О выдохе не думать, не контролировать его сознанием. Повторить упражнение подряд 8 раз без пауз. Темп 1-2 вдоха в секунду, двигаться строго ритмично. Повторить 10-20 раз.
        <br/>{'     '}<b>«Наклоны».</b> <u>Частъ первая</u>. И. п. - стоя, нога на ширине плеч, туловище прямое, руки опущены (<i>«по швам»</i>). Наклониться вперед, руки произвольно опустить, слегка скрестив, вдох носом - быстрый, ясно слышимый. Вернуться в исходное положение не полностью - и снова вдох во время наклона вперед. О выдохе не думать, не мешать, но и не помогать ему. Повторить 8 раз, темп – 1 – 2 вдоха в секунду, наклоняться строго ритмично. Повторить 10-20 раз.
        <br/>{'     '}<u>Часть вторая</u>. И. п. - стоя, ноги на ширине плеч, туловище прямое, руки на уровне плеч, согнуты в локтях, пальцы слегка сжаты в кулаки, повернуты друг к другу. Отклониться назад, руки резко скрестить перед грудью; вдох носом - быстрый, активный, ясно слышимый (<i>но не шумный</i>). Вернуться в и. п. не полностью - и снова вдох при наклоне назад. Повторить 8 раз, темп – 1 – 2 вдоха в секунду, движения ритмичные, о выдохе не думать (<i>не мешать и не помогать выдоху</i>). Повторить 10-20 раз.
        <br/>{'     '}<b>«Маятник».</b> И. п. - стоя, наклоняясь вперед, руки опущены вниз, Покачиваться вперед-назад. При наклоне вперед и вдохе руки скрещиваются. Вдох через нос, быстрый, активный, хорошо слышный (<i>но он не должен быть нарочито шумным</i>). Темп 1-2 вдоха в секунду. Повторить 10-20 раз.
        <br/>{'     '}При выполнении указанных упражнений не надо стараться вдохнуть как можно больше воздуха - наоборот, вдох должен быть по объему меньше, чем возможно. Во время движений следует стараться освободиться от напряжения, установить индивидуальный естественный, но энергичный темп. Руки далеко от тела не уводить! Не помогать выдоху! Надо стараться сделать его незаметным, бесшумным. Следует помнить, что цель организация дыхания, а движение - лишь средство для этого. Каждое упражнение повторять с паузами в 1, 2, 3 секунды - так, чтобы получилось не менее 128-160 дыханий, а всего 600-640 дыхательных движений на четыре упражнения. Освоенные движения в последующем рекомендуется сочетать со звуковыми упражнениями.
        <br/>{'     '}В старшем дошкольном возрасте постепенно возрастает нагрузка на опорно-двигательный аппарат и другие системы организма за счет большей интенсивности и повышения дозировки упражнений. Вводятся круговые движения рук (<i>вперед и назад</i>), рывковые движения прямых и согнутых рук. В упражнениях для туловища делаются повороты и наклоны в стороны, повороты вокруг себя стоя и лежа. Больше внимания уделяется специальным дыхательным упражнениям. Широко используются различные индивидуальные пособия, кроме того, даются имитационные упражнения. Дыхательные упражнения выполняются в среднем темпе. Количество повторений увеличивается до 6-8 раз.
        <br/>{'     '}<b>Упражнения на удлинение выдоха</b>
        <br/>{'     '}<b>«Наклоны вперед».</b> И. п. - ноги на ширине плеч, руки вдоль туловища.
        <br/>{'     '}Спокойный вдох в и. п. 1-2-3 - пружинистые наклоны вперед с тройным выдохом. Руки за спину, смотреть вперед. 4 - вернуться в и. п.
        <br/>{'     '}<b>«Наклоны в сторону»</b>(<i>«Наклоны с зонтиком»</i>). И. п. - ноги на ширине плеч, руки на поясе. Спокойный вдох в и. п. 1-2-3 - тройной наклон в сторону, поднять разноименную руку над головой - «накрылись зонтиком» - выдох. 4 - вернуться в и. п.
        <br/>{'     '}<b>«У кого дольше колышется ленточка».</b> Каждый ребенок берет в руку узкую ленточку из тонкой цветной бумаги. Ноги на ширине плеч, руки внизу, слегка отведены назад. Спокойный вдох. На выдохе поднести ленточку ко рту, сделать небольшой наклон.
        <br/>{'     '}<b>Специальные дыхательные упражнения</b>
        <br/>{'     '}<b>«Задуй свечку».</b> Встать прямо, ноги на ширине плеч. Сделать свободный вдох и слегка задержать дыхание. Сложить губы трубочкой. Выполнить три коротких редких выдоха, словно задувая горящую свечу: «Фу! Фу! Фу!». Во время упражнения туловище держать прямо.
        <br/>{'     '}<b>«Полное дыхание».</b> Встать прямо, ноги на ширине плеч. Сделать свободный глубокий вдох, одновременно поднимая руки перед собой вверх. Задержать дыхание (<i>пока приятно</i>). Выполнить энергичный выдох открытым ртом, одновременно опуская руки и наклоняясь вперед («Ха!»). Выдыхать с облегчением, как будто освобождаясь от забот. Медленно выпрямиться.
        <br/>{'     '}<b>Упражнения на укрепление мышцы носоглотки и верхних дыхательных путей.</b>
        <br/>{'     '}Упражнения можно выполнять стоя или в движении.
        <br/>{'     '}<b>«Ёжик».</b> Поворот головы вправо-влево в темпе движения. Одновременно с каждым носоглотки (<i>ноздри двигаются и как бы соединяются, шея напряжена</i>); выдох мягкий, произвольный, через полуоткрытые губы.
        <br/>{'     '}<b>«Ушки».</b> Покачивая головой вправо-влево, выполнять сильные вдохи. Плечи остаются неподвижными, а уши тянутся к плечам. Следить, чтобы при наклоне головы туловище не поворачивалось.
        <br/>{'     '}Вдохи выполняются с напряжением мышц носоглотки. Выдох произвольный.
        <br/>{'     '}
        <br/>{'     '}<b>Дыхательная гимнастика по методу Б. С. Толкачёва.</b>
        <br/>{'     '}<b>Комплекс 1.</b>
        <br/>{'     '}<b>1. «Качалка».</b> И. п. – сидя на стуле, руки на коленях. Раскачивать туловище вперёд-назад, произнося на выдохе «Ф-р-оо-хх!». Повторить 6-8 раз.
        <br/>{'     '}<b>2. «Ёлочка растёт».</b> И. п. – встать прямо, слегка расставив ноги, руки опустить. Присесть и выпрямиться, поднимая руки вверх шире плеч. Приседая, произносить: «Страх-х!». Повторить 2-3 раза.
        <br/>{'     '}<b>3. «Зайчик».</b> И. п. – встать прямо, слегка расставив ноги, руки опустить. Приседая, сгибать руки к плечам ладонями вперёд, как зайчик, становящийся на задние лапки. Произносить на выдохе: «Фр!». Повторить медленно 5-7 раз.
        <br/>{'     '}<b>4. «Как гуси шипят».</b> И. п. – встать, ноги врозь, ступни параллельно, держа палку на сгибе рук. Наклониться вперёд, смотря перед собой и вытягивая шею, произнести: «Ш-ш-ш...». Повторить в среднем темпе 3-4 раза.
        <br/>{'     '}<b>5. «Прижми колени».</b> И. п. – сесть, ноги вытянуть, палку опустить. Притянуть ноги к себе, прижать колени палкой к груди, произнося: «Уф-ф!». Выпрямить ноги, руки опустить. Повторить медленно 5-7 раз.
        <br/>{'     '}<b>6. «Гребцы».</b> И. п. – сесть, ноги врозь, палку держать у груди. Наклониться вперёд, коснуться палкой носков ног, произнести: «Гу!». Выпрямиться, палку притянуть к груди. Повторить медленно 3-5 раз.
        <br/>{'     '}<b>7. «Скрещивание рук внизу».</b> И. п. – встать прямо, ноги врозь, руки в стороны. Опуская прямые руки вниз и скрещивая их перед собой, произносить: «Та-ак!» - и поднимать их в стороны. Повторить в среднем темпе 4-6 раз.
        <br/>{'     '}<b>8. «Достань пол».</b> И. п. – встать прямо, ноги врозь, руки вперёд. Наклониться вперёд и достать ладонями пол со словами: «Бак». Повторить медленно 2-4-раза.
        <br/>{'     '}<b>9. «Постучи кулачками».</b> И. п. – встать прямо, ноги врозь, руки опустить. Присесть и 3 раза постучать кулачками о пол, приговаривая: «Тук-тук-тук». Повторить в среднем темпе 2-3 раза.
        <br/>{'     '}<b>10. «Прыжки».</b> Прыгать на обеих ногах, произнося на каждый прыжок: «Ха». Каждые 12-16 прыжков чередовать с ходьбой.
        <br/>{'     '}<b>Комплекс 2 «На улице».</b>
        <br/>{'     '}<b>1. «Погрейся».</b> И. п. – встать прямо, ноги врозь, руки поднять в стороны. Быстро скрещивать руки перед грудью, хлопать ладонями по плечам, произнося: «Ух-х-х!». Разводить руки в стороны – назад. Повторить 8-10 раз.
        <br/>{'     '}<b>2. «Конькобежец».</b> И. п. – встать прямо, ноги врозь, руки заложить за спину. Сгибать то правую, то левую ногу, наклоняя туловище с полуоборотом в стороны (подражая движениям конькобежца) и произнося: «Кр-р-р!». Повторить в среднем темпе 5-8 раз.
        <br/>{'     '}<b>3. «Заблудился».</b> И. п. – поставить ноги вместе, руки сложить рупором. Вдохнуть и на выдохе громко произнести: «А-у-у-у!». Повторить 8-10 раз.
        <br/>{'     '}<b>4. «Снежный ком».</b> И. п. – встать прямо, слегка расставив ноги, руки опустить. Присесть пониже на всей ступне и, сильно наклоняясь вперёд, обхватить руками голени, голову опустить. При этом произносить: «Хр-р-р!». Повторить медленно 3-5 раз.
        <br/>{'     '}<b>5. «Снеговик веселится».</b> И. п. – поставить ноги вместе, руки на поясе. Вдохнуть, после чего сделать прыжок двумя ногами с одновременным выдохом, произнося: «Ха!». Повторить 6-8 раз.
        <br/>{'     '}<b>6. «Вырасти большим».</b> И. п. – встать прямо, ноги вместе. Поднять руки вверх, потянуться, подняться на носки – вдох; опустить руки вниз, опуститься на всю ступню – выдох, произнося: «У-х-х-х!». Повторить 4-5 раз.
        <br/>{'     '}
        <br/>{'     '}<a href="http://doshvozrast.ru/ozdorov/gimnastika10-1.htm"><b>Источник</b></a>
      </p>
    );
  }

  getLinks(){
    return [
      {
        id: '1',
        url: 'https://www.youtube.com/watch?v=5ubBHtd0s98',
        label: 'Дыхательная гимнастика  для детей'
      },
      {
        id: '2',
        url: 'https://www.youtube.com/watch?v=xCRTfnE14KM',
        label: 'Дыхательная гимнастика '
      },
      {
        id: '3',
        url: 'https://www.youtube.com/watch?v=rgyNQSOL-7s',
        label: 'Дыхательная гимнастика Стрельниковой в детском саду'
      },
      {
        id: '4',
        url: 'https://www.youtube.com/watch?v=6CmpGCy6C2k',
        label: 'Программа "ОБУЧЕНИЕ ЧТЕНИЮ". Речевое дыхание. Часть 1'
      },
      {
        id: '5',
        url: 'https://www.youtube.com/watch?v=aivy-bMHUOs',
        label: 'Программа "ОБУЧЕНИЕ ЧТЕНИЮ". Речевое дыхание. Часть 2'
      },
    ];
  }

  render() {
    const data = this.getData();
    const links = this.getLinks();
    return (
      <BaseTextComponent title={'Дыхательная гимнастика'} data={data} links={links} video={['vJXbjhcNSe4', '9lihy1csNvU']}/>
    );
  }
}

export default BreathingExercises;
