import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class AggressiveChild extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Ваши дети растут, у них формируются свои привычки и характер. Возможно, характер не из лёгких, к ребёнку трудно подступиться, но это не значит, что вы никогда не найдёте с ним общий язык.
        <br/>{'     '}Когда речь идёт о воспитании детей, нет магической формулы, которая гарантировала бы успех. Однако есть стратегии, которые уже не раз доказали свою состоятельность. <b>Эти стратегии просты и даже банальны</b>, но стоит вам пренебречь ими, как вы обнаружите, что ребёнок больше не хочет иметь с вами ничего общего.
        <br/>{'     '}
        <br/>{'     '}<b>Умение слушать</b>
        <br/>{'     '}Если вы хотите, чтобы ребёнок к вам прислушивался, научитесь слушать его сами. Ничего нового? Вы уже об этом знаете? Но делаете ли вы это?
        <br/>{'     '}Если вы заинтересованы в том, чтобы ребёнок слушал вас, тренируйте своё внимание к нему. Начните подсчитывать время, в течение которого вы “намеренно” или “интенсивно” его слушаете. Вас не должны отвлекать никакие газеты или разговоры по телефону. Вы должны смотреть ребёнку прямо в глаза, уточнять его слова, чтобы он чувствовал, что вы понимаете, о чём он говорит.
        <br/>{'     '}И не ограничивайте себя всего десятью минутами вдень. Постарайтесь делать это как можно чаще.
        <br/>{'     '}А если вы не слушаете соответствующим образом своего ребёнка, то по какой причине он станет прислушиваться к вам?
        <br/>{'     '}
        <br/>{'     '}<b>Уважение</b>
        <br/>{'     '}Если вы хотите, чтобы ребёнок уважал ваше время, вам необходимо уважать его время. Если вы хотите, чтобы ребёнок уважал ваши разговоры, необходимо уважать его разговоры.
        <br/>{'     '}Внимательно слушая ребёнка, проявляя к нему искреннее внимание изо дня в день, вы будете подниматься вверх по шкале уважения ребёнка.
        <br/>{'     '}
        <br/>{'     '}<b>Авторитет</b>
        <br/>{'     '}Естественно, вы хотите стать для своего ребёнка тем человеком, к которому он прислушивается. И это справедливо. Однако не делайте ошибки, стараясь стать для ребёнка лучшим другом. Эта роль принадлежит не вам.
        <br/>{'     '}Ребёнку необходимо, чтобы вы были для него больше чем другом. Вы должны быть его родителями, и никто другой не сможет перенять эту роль!
        <br/>{'     '}Воспитывая подростка, вам необходимо быть лидером в семье. Не знаете, как это сделать? Оглянитесь на свою жизнь и спросите себя, можете ли вы последовать за самим собой. Ответ даст вам представление о том, каким видит вас ребёнок и что необходимо сделать, чтобы стать тем, с кем он сможет поделиться своими заботами и опасениями.
        <br/>{'     '}
        <br/>{'     '}<b>Агрессивность-это проблема?</b>
        <br/>{'     '}Понятия агрессия, агрессивность носят негативный отпечаток, что не совсем справедливо. Агрессивность необходима для самосохранения, овладения знаниями, познания мира. Если агрессивные влечения излишне подавляются, то активность человека в какой-то степени начинает блокироваться.
        <br/>{'     '}Агрессия является реакцией на фрустрации (негативное психическое состояние, обусловленное невозможностью удовлетворения тех или иных потребностей), обиду, боль. В этом случае агрессия переплетается со злостью, обидой, её можно понять, хотя не всегда сила фрустрации соразмерна ответной реакции.
        <br/>{'     '}Развитию агрессивности как возможной защитной реакции на конфликты с окружением способствуют неудовлетворённость подростков своим положением, трудности в учёбе и общении.
        <br/>{'     '}Основы поведения детей, в том числе агрессивного, закладываются в семье. Агрессивность подростков находится в прямой зависимости от характера семейных отношений и педагогической позиции родителей. Педагогические позиции родителей могут быть четырёх типов: диктат, попустительская, гиперопека, демократическая. Каждая характеризуется определённым уровнем протекции (количество сил, внимания и времени, которое родители уделяют воспитанию ребёнка), степенью удовлетворения потребностей ребёнка; количеством и качеством требований, предъявляемых к ребёнку.
        <br/>{'     '}Среди родителей часто наблюдается стремление устраниться от процесса воспитания детей (попустительская позиция). Такой подход имеет место в неблагополучных семьях и может быть следствием социальной неустроенности, материальных трудностей неполных или многодетных семей. Такой же стиль воспитания можно наблюдать и в социально благополучных семьях, где родители ориентированы на собственные интересы. Такие родители объясняют проблемы в воспитании детей рядом причин: непрофессионализмом учителей, отсутствием требовательности и дисциплины в школе, дурным влиянием сверстников, низким уровнем культуры общества, чрезмерной занятостью на работе и пр.
        <br/>{'     '}Вседозволенность, бесконтрольность, слабая воспитательная позиция родителей способствуют формированию эгоистичности и агрессивности подростков. Родители предоставляют детям свободу, которой те не умеют пользоваться. Совершенно ненормально, когда 15-летние подростки допоздна гуляют с друзьями, а то и вовсе не приходят домой ночевать. Кого, как не родителей должно волновать, чем занимаются их дети в это время? Однако родители не пытаются усилить своё влияние на детей, ссылаясь на занятость. Согласитесь, странная отговорка: не хватает времени на собственных детей.
        <br/>{'     '}В некоторых случаях агрессивное поведение становится доминирующим, проявляется в различных формах нарушения поведения.
        <br/>{'     '}Агрессия может быть направлена на других или на себя, может быть открытой или скрытой, пассивной, когда она выражается в отказах, пассивном сопротивлении действительности.
        <br/>{'     '}Агрессивные и самоагрессивные действия могут происходить по типу “короткого замыкания”, без осмысления, как непосредственная разрядка напряжения. Они не сопровождаются чувством вины или раскаянием. Причём такое поведение может возникать у детей, внешне хорошо адаптированных, любимых.
        <br/>{'     '}Отдельного внимания заслуживает провокационное поведение детей, подталкивающих взрослых к тому, чтобы их наказывали и даже мучили. Это особенно часто наблюдается среди усыновлённых детей, когда после непродолжительного периода прекрасного поведения начинается настоящий кошмар. Многим взрослым с трудом удаётся сдерживать вызываемые в них поведением ребёнка агрессивные импульсы. Такие дети как будто испытывают взрослых на прочность, пытаются проверить, как далеко можно зайти, как много им могут простить, а значит, насколько сильно их любят. Тогда плохое поведение является упрёком, местью и одновременно призывом о помощи. Некоторые дети имеют внутреннюю убеждённость в том, что они плохие, не достойны любви, и любой ценой пытаются это подтвердить, провоцируя наказания и отвержения, как бы ища доказательства своим мыслям: “Ну вот, я так и знал, что меня никто не любит”. Или: “Я же знал, что все люди плохие, никому нельзя доверять”. Агрессивно атакуя других, они борются со своим стремлением к зависимости, потребности в любви.
        <br/>{'     '}Чтобы найти общий язык со своим ребёнком и быть услышанным и понятым, родители должны научиться принимать своих детей такими, какие они есть, и любить их за то, что они есть.
        <br/>{'     '}
        <br/>{'     '}<b>Что  делать с агрессивным ребёнком?</b>
        <br/>{'     '}Нельзя считать, что у вашего ребёнка нет агрессии, и закрывать на неё глаза. Если внутри вашей крохи завёлся “динозаврик”, попытайтесь его усмирить.
        <br/>{'     '}<b>Факторы, влияющие на появление у детей агрессии</b>
        <br/>{'     '}Будь то физическая агрессия или крики, вспыльчивость или грубость, топанье или ругань — все эти виды агрессии можно наблюдать у людей любого возраста, а проявляются они с самого раннего детства.
        <br/>{'     '}На становление агрессивного поведения ребёнка оказывают влияние факторы внутренние (особенности нервной системы и темперамента, личностные черты и т. п.) и внешние (социальное воздействие, влияние окружающей среды и конкретной ситуации).
        <br/>{'     '}Существует непосредственная связь между проявлением детской агрессии и стилем воспитания в семье. Если родители строго наказывают ребёнка за любое проявление агрессивности, то он учится скрывать свои эмоции в их присутствии, а это не гарантирует отсутствия агрессии в любой другой ситуации. Малыши, родители которых отличаются чрезмерной уступчивостью, неуверенностью, а иногда и беспомощностью во взаимоотношениях, не чувствуют себя в полной безопасности и тоже становятся агрессивными. Попустительское отношение взрослых к агрессивным вспышкам ребёнка также приводит к формированию у него агрессивных черт. Дети часто используют агрессию и непослушание, чтобы привлечь к себе внимание. Неуверенность и колебания родителей при принятии каких-либо решений провоцируют ребёнка на капризы и вспышки гнева, с помощью которых он может влиять на дальнейший ход событий и при этом добиваться своего.
        <br/>{'     '}
        <br/>{'     '}<b>Научите ребенка освобождаться от агрессии</b>
        <br/>{'     '}Чтобы помочь ребёнку избавиться от агрессивных форм поведения, нужно научить его выражать или выплёскивать свои  эмоции. Сдерживая агрессию, малыш загоняет её внутрь и постепенно накапливает отрицательные чувства, которые со временем будут способствовать возникновению стресса. Не отреагировав сразу, ребёнок рано или поздно почувствует необходимость выплеснуть всё “накопившееся” из себя. Но не на того, кто вызвал это чувство, а на того, кто “подвернётся” под руку, кто слабее и не сможет дать отпор.
        <br/>{'     '}Внешне спокойный ребёнок не станет открыто выражать своё неудовольствие после неприятного разговора с мамой, он может просто промолчать, а гораздо позже вдруг начнёт капризничать в самом неподходящем месте (в очереди, в гостях). Такой ребёнок может исподтишка специально ломать игрушки, вызывающе одеваться, чтобы шокировать учительницу, изо дня вдень “забывать” записывать домашнее задание в дневник и т. п.
        <br/>{'     '}Пассивно-агрессивного ребёнка нужно учить прямо заявлять о своих чувствах, давая при этом выход отрицательным эмоциям. Если малыш, который делал всё втихомолку, вдруг открыто заявляет о своих чувствах, для родителей это сигнал — работа идёт в правильном направлении.
        <br/>{'     '}Ребёнок, который изъясняется в грубой форме, используя ругательства, всё-таки шагнул на ступеньку выше в борьбе с агрессией. В такие минуты следует установить с ним зрительный контакт, спокойно посмотрев на ребёнка, и дать ему возможность выговориться. Затем попытаться выяснить причину агрессии и устранить её в кратчайший срок. После этого надо рассказать малышу, как можно выразить подобные эмоции по-другому — в позитивной форме.
        <br/>{'     '}Чтобы добиться положительных результатов, взрослый должен служить для ребёнка примером, демонстрируя образцы зрелого поведения.
        <br/>{'     '}Такие способы выражения агрессии, как перенос чувств на неопасные объекты, в основном подходят для маленьких детей, которые не всегда могут описать словами свои мысли и, тем более, чувства. Для таких детей в арсенале взрослого должны иметься резиновые игрушки, подушки, поролоновые мячи, мишень с дротиком, стаканчик “для : крика”, спортивный инвентарь и т. п. Все эти  предметы нужны для того, чтобы ребёнок не направлял гнев на людей, а переносил его на неодушевлённые предметы, выплёскивал его в игровой форме. Правда, такой способ полезен для робких, неуверенных в себе детей, но недопустим для чрезмерно открытого ребёнка.
        <br/>{'     '}Учите детей прямо заявлять о своих чувствах, а отрицательные эмоции выражать с помощью игровых приёмов.
        <br/>
        <br/>{'     '}<b>Агрессия у ребенка – выражение чувств</b>
        <br/>{'     '}Дети иногда проявляют агрессию лишь потому, что не знают других способов выражения своих чувств. Они могут поступать так или иначе не потому, что им это нравится, а потому что не знают, как сделать по-другому. Задача родителей — научить их выходить из конфликтных ситуаций приемлемыми способами. Обсудите с малышом наиболее частые конфликтные ситуации. Например, как поступить, если ему нужна игрушка, с которой кто-то уже играет. Рассмотрите с ним ситуацию из любой знакомой сказки, к примеру, про двух упрямых медвежат, пусть он выскажет свой вариант разрешения конфликта. Довольно часто дети предлагают агрессивные способы выхода из создавшейся ситуации: закричать, ударить, отобрать, припугнуть. В этом случае не надо критиковать его предложение и давать ему оценку. В процессе обсуждения ребёнок, как правило, сам убеждается в неэффективности такого подхода к проблеме.
        <br/>
        <br/>{'     '}<b>Научите ребенка в момент агрессии расслабляться и улыбаться</b>
        <br/>{'     '}С ребёнком можно и нужно говорить о том, что такое агрессия и каковы её разрушительные действия, объяснять, каким злым и некрасивым становится человек в порыве гнева. Поэтому важно работать над собой, управлять своими эмоциями.
        <br/>{'     '}Положите ребёнку в карман нарисованный от руки дорожный знак “Стоп”. Как только ребёнка начнут одолевать агрессивные мысли и желания, он сможет достать из кармана картинку и мысленно или шёпотом произнести: “Стоп”.
        <br/>{'     '}Но чтобы данный приём начал работать, необходимы многодневные тренировки.
        <br/>{'     '}Агрессивным детям зачастую свойственны мышечные зажимы, особенно в области лица и кистей рук. Чтобы научить ребёнка в момент неприятной ситуации не сжимать челюсти, а расслаблять мышцы лица, можно использовать релаксационные упражнения. Например, в игре “Тёплый, как солнце, лёгкий, как дуновение ветра” дети с закрытыми глазами представляют себе тёплый чудесный день. Над их головами проплывает серое облачко, на которое они поместили все свои горести и заботы. Ярко-голубое небо, лёгкий ветерок, ласковые лучи солнца помогают расслабить мышцы не только лица, но и всего тела.
        <br/>{'     '}Игра “Улыбка” также способствует расслаблению мышц. Выдыхая воздух и улыбаясь лучу солнца, дети становятся чуть-чуть добрее. В неприятных жизненных ситуациях они могут вспомнить свои ощущения, отработанные в этих и других подобных играх, и вернуться к ним, заменяя негативные эмоции на нейтральные или положительные.
        <br/>
        <br/>{'     '}<b>Устраните вспышки агрессии у ребенка</b>
        <br/>{'     '}Лучшим гарантом хорошего самообладания и адекватного поведения детей является умение родителей владеть собой. К сожалению, многие родители и сами не умеют управлять собственными эмоциями. Как следствие, их дети вряд ли усвоят навык адекватного выражения агрессии.
        <br/>{'     '}Наладьте взаимоотношения со своим ребёнком, чтобы он чувствовал себя с вами спокойно и уверенно. Слушайте своего ребёнка. Проводите вместе с ним как можно больше времени. Делитесь с ним собственным опытом. Рассказывайте ему о своём детстве, ваших поступках, победах и неудачах. Если в семье несколько детей, постарайтесь общаться не только со всеми вместе, но и с каждым по отдельности.
        <br/>{'     '}Следите за собой, особенно в стрессовом состоянии, когда вас легко вывести из равновесия. Отложите или отмените совместные дела с ребёнком (если это, конечно, возможно), когда чувствуете в себе агрессию. Старайтесь не прикасаться к ребёнку в минуты раздражения.
        <br/>{'     '}Если вы расстроены, то дети должны знать о вашем состоянии. Говорите детям прямо о своих чувствах, желаниях и потребностях: “Я очень расстроена, хочу побыть одна. Поиграй, пожалуйста, в соседней комнате”. Или: “Дела на работе вывели меня из себя. Через несколько минут я успокоюсь, а сейчас, пожалуйста, не трогай меня”.
        <br/>{'     '}Старайтесь предвидеть и предотвратить возможные неприятности, которые могут вызвать ваш гнев. Не давайте ребёнку играть с теми вещами и предметами, которыми вы очень дорожите.
        <br/>{'     '}Не позволяйте выводить себя из равновесия. Умейте предчувствовать поступление собственного эмоционального срыва и не допускайте этого, управляя собой (подумайте о чём-то приятном) и ситуацией.
        <br/>{'     '}К некоторым особо важным событиям ребёнка следует готовиться заранее. Постарайтесь предусмотреть все возможные нюансы. Если вам предстоит первый визит к врачу или в детский сад, “проиграйте” ситуацию заранее или обговорите её. Если ребёнок капризничает, когда он голоден, продумайте, как накормить его во время длительной поездки,и т. п.
        <br/>{'     '}Чтобы устранить нежелательные вспышки агрессии у ребёнка, уделяйте ему больше внимания, стремитесь к установлению тёплых отношений с ним, а на определённых этапах и развития ребёнка проявляйте твёрдость и решительность.
        <br/>
        <br/>{'     '}И. Н. НАСЕВИЧ, психолог// Рюкзачок для пап и мам. – 2009. - №1. – с.1-5.
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    return (
      <BaseTextComponent title={'Секреты воспитания'} data={data} epigraph={epigraph}/>
    );
  }
}

export default AggressiveChild;
