import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class BirthPupil extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Чтобы лучше понять ребёнка, вспомните себя в возрасте 6 — 8 лет и попробуйте ответить на следующие вопросы:
        <br/>{'     '}♦	Всегда ли вам было понятно, чего хочет взрослый?
        <br/>{'     '}♦	Всегда ли вы сначала думали, а потом делали?
        <br/>{'     '}♦	Бывало ли вам обидно из-за несправедливости со стороны взрослого?
        <br/>{'     '}♦	Могли ли вы заметить все свои ошибки и ошибки взрослых?
        <br/>{'     '}♦	Всегда ли вам хотелось ходить в школу или нет и почему?
        <br/>{'     '}♦	Была ли у вас уверенность в своих силах?
        <br/>{'     '}♦	Всегда ли вы задавали вопросы учителю и родителям, если в их объяснении вам было что-то непонятно?
        <br/>{'     '}Если вы ответите на эти и подобные вопросы, вам станет  более понятен внутренний мир ребёнка.
        <br/>{'     '}Переступая порог школы, первоклассники очень волнуются. Что там — за этой незнакомой дверью? Какая она, учительница? А если у меня что-то не получится? Подобные вопросы возникают в детских головах накануне первого в жизни учебного года. И каждый новорождённый ученик со всей открытостью детской души надеется, что его примут, будут любить, уважать, ценить.
        <br/>{'     '}Помните тот удивительный момент, когда накануне 1 сентября вы впервые взяли крохотную, дрожащую от волнения ручку вашего ребёнка? Вам передалось настроение малыша, так захотелось подарить ему самое лучшее, оградить его от бед и тревог! “Крепче держись за руку, мы вместе пойдём по непростой дороге жизни и постараемся, чтобы ты рос здоровым, умным и счастливым”, — мысленно произнесли в этот момент, наверное, все родители, а малыш, словно уловив едва заметный импульс сердца, доверчиво спрятал в вашей свою маленькую ладошку.
        <br/>{'     '}Незаметно бежит время... Но родителям, которые волнуются ничуть не меньше своего юного школьника, по-прежнему хочется оградить малыша от возможных трудностей и препятствий, хочется вести его только по верному пути. Но все мы понимаем: у каждого человека свой путь, и преодолевать трудности ребёнок должен научиться сам. Как же сделать так, чтобы адаптация к школьной жизни прошла мягко, спокойно и безболезненно? Ведь чем комфортнее ребёнок будет чувствовать себя в классе, тем быстрее он раскроется и ярче проявит себя.
        <br/>{'     '}Мальчики и девочки, которые впервые приходят в школу, очень разные. Глядя на мир широко открытыми глазами, первоклассник всем интересуется и в то же время тревожится. Каждый по-своему воспринимает информацию, по-своему её анализирует, у всех разная работоспособность, внимание, память. Одному легче даётся математика, другой быстро и легко учится читать, а третий замечательно проявляет свою фантазию в рисунках и поделках. К чему же должен приспособиться, адаптироваться малыш?
        <br/>{'     '}Адаптация ребёнка к школе включает два компонента:
        <br/>{'     '}♦	физиологическую адаптацию: готов ли организм малыша к обучению в школе, как скоро он привыкнет к новому режиму;
        <br/>{'     '}♦	социально-психологическую адаптацию: как малыш проявляет свою личность в учёбе и общении с учителем и одноклассниками.
        <br/>{'     '}Физиологическая адаптация напрямую связана с состоянием здоровья ребёнка. Прогулки на свежем воздухе, соблюдение режима дня, укрепление иммунитета — всё это играет положительную роль при адаптации малыша к школьной жизни. В первые дни и даже недели учёбы у ребят очень много новых впечатлений: знакомство с учителем и одноклассниками, новые учебники и тетради, уроки и переменки. Чтобы малыш (особенно эмоциональный и легко возбудимый) не переутомился, можно в первое время забирать его домой сразу по окончании уроков. По пути домой спокойно обсудите с ним события дня, прогуляйтесь, дома послушайте спокойную музыку. Но в то же время именно в начале учебного года ребятишки, познакомившись, начинают вместе играть, среди них формируются группы по интересам. И если ежедневно после уроков забирать ребёнка раньше всех, ему в будущем может быть сложно найти друзей.
        <br/>{'     '}Социально-психологическая адаптация оценивается по тому, как ребёнок ощущает себя в коллективе ровесников, какое место начинает занимать в классе, как относится к школе, одноклассникам, учителям, к самому себе в роли ученика.
        <br/>{'     '}Известный психолог С. Соловейчик в своей книге “Педагогика для всех” предлагает родителям наряду с формированием познавательной сферы малыша (мышление, внимание, воображение, память) побольше внимания уделять умению малыша общаться.
        <br/>{'     '}Ведь в школе не только уроки, учение, учитель, там есть ещё и класс, другие дети, товарищи! Адаптироваться к самостоятельной жизни ребёнку помогут следующие советы:
        <br/>{'     '}✓	Не отнимай чужого, но и не всё своё отдавай.
        <br/>{'     '}✓	Попросили—дай, пытаются отнять — старайся защититься.
        <br/>{'     '}✓	Не дерись.
        <br/>{'     '}✓	Не обижайся по пустякам.
        <br/>{'     '}✓	Сам ни к кому не приставай.
        <br/>{'     '}✓	Не дразни, не канючь, не выпрашивай ничего. Никого два раза ни о чём не проси.
        <br/>{'     '}✓	Из-за отметок не плачь, будь гордым. С учителем из-за отметок не спорь и на учителя за отметки не обижайся.
        <br/>{'     '}✓	Не ябедничай.
        <br/>{'     '}✓	Не будь грязнулей.
        <br/>{'     '}✓	Почаще говори: давай дружить, давай играть, давай водиться, давай вместе домой пойдём.
        <br/>{'     '}✓	Не задавайся, окружающие этого не любят.
        <br/>{'     '}Большинство ребят адаптируется к школьной жизни в течение первого полугодия. У некоторых первоклассников этот процесс занимает весь учебный год. Очень велика в успешной адаптации роль учителя и родителей. С первых дней постарайтесь установить с учителем уважительные отношения. Не стесняйтесь обратить его внимание на те стороны характера, нюансы состояния здоровья ребёнка, которые вас волнуют.
        <br/>{'     '}Как вести себя с ребёнком- школьником:
        <br/>{'     '}✓	По утрам будите малыша спокойно. Проснувшись, он должен видеть   улыбку и слышать ласковый голос. Не дёргайте его по пустякам. Тем более не стоит вспоминать утром вчерашние оплошности. “Новый день—новые песни”, — учит народная мудрость.
        <br/>{'     '}✓	Не торопите ребёнка. Правильно рассчитайте время, которое нужно ему на сборы в школу. Это пока ваша, а не его задача. Если он не успевает собраться, подумайте почему, а завтра разбудите его раньше на столько, на сколько он задержался сегодня.
        <br/>{'     '}✓	Не отправляйте ребёнка в школу голодным. Даже если малыш ест в школе, до школьного завтрака пройдёт как минимум один урок, и плохо, если ребёнок будет думать о бутерброде с маслом, а не о буквах.
        <br/>{'     '}✓	Постарайтесь проводить малыша в класс без наставлений типа: “Смотри, сегодня веди себя хорошо!”, “Чтобы сегодня у тебя не было замечаний!” Гораздо полезнее на прощание пожелать малышу удачи, подбодрить, найти для него пару ласковых слов шепнуть на ушко, как вы его любите и верите в него, ведь впереди у него непростой школьный день.
        <br/>{'     '}✓	Встречайте ребёнка из школы приветливо и ласково (обращая при этом внимание на его психологическое состояние). Очень травмируют малыша вопросы типа: “Ну как — сегодня без замечаний?”, “Эй, двоечник, как успехи?” Не обрушивайте на него сразу тысячу вопросов, дайте ему расслабиться (вспомните, как вы сами себя чувствуете после тяжёлого рабочего дня и многочасового общения с людьми). Если ребёнок чересчур возбуждён и жаждет поделиться чем-то, едва вернувшись из школы, не откладывайте разговор на потом и внимательно выслушайте его.
        <br/>{'     '}✓ Если ребёнок огорчённо молчит, постарайтесь не расспрашивать его о причине. Когда малыш успокоится, он сам всё расскажет. А если нет, осторожно поинтересуйтесь этим позже.
        <br/>{'     '}✓ Не требуйте, чтобы ребёнок сразу после школы садился за уроки. Перерыв в 2 — 3 часа ему про сто необходим. А ещё лучше, если первоклашка поспит часа полтора — это лучший способ восстановить силы.
        <br/>{'     '}✓	Не заставляйте ребёнка делать уроки за один присест. После 15—20 минут занятий делайте 10—15-минутные “переменки”, хорошо, если они будут подвижными (например, потанцевать под любимые мелодии).
        <br/>{'     '}✓	Не торгуйтесь с ребёнком. Это нехорошая практика: у ребёнка может выработаться неверное представление о цели его учёбы, и он начнёт думать, что, учась, делает вам одолжение, за которое вы платите игрушками, сладостями или возможностью делать то, что ему хочется. Кроме того, условие, которое вы ставите, может оказаться невыполнимым для ребёнка, и вы окажетесь в сложной ситуации: либо быть до конца последовательными и несправедливыми по отношению к ребёнку, либо нарушить своё родительское слово.
        <br/>{'     '}✓ В семье придерживайтесь единой тактики общения всех взрослых с ребёнком, а свои разногласия по поводу того, что педагогично, а что нет, улаживайте без него.
        <br/>{'     '}Если что-то не получается, посоветуйтесь с учителем, школьным психологом, почитайте соответствующую литературу.
        <br/>{'     '}✓ Не упускайте из виду, что в течение учебного года бывают  “критические” периоды, когда учиться становится сложнее, ребёнок быстрее утомляется, у него снижается работоспособность. Психологи считают, что для первоклашки это первые 4—6 недель (и 3—4 недели для других младших школьников), затем — конец второй четверти, первая неделя после зимних каникул и середина третьей четверти. В эти периоды нужно быть особенно внимательным к ребёнку.
        <br/>{'     '}✓	Старайтесь не напоминать малышу
        <br/>{'     '}отношений, не обсуждать завтрашнюю контрольную, чтобы успокоить, помочь снять накопившееся за день напряжение и спокойно уснуть.
        <br/>{'     '}✓	Будьте ближе к ребёнку, интересуйтесь его новой школьной жизнью. Не выдавайте вашего волнения, ведь ребёнок интуитивно это почувствует. Наоборот, почаще говорите малышу: «У тебя всё получится»
        <br/>{'     '}✓	Интересуйтесь успехами ребёнка у учителя не в присутствии малыша! А выслушав замечания, не торопитесь устраивать ребёнку взбучку. Чтобы сделать какие-либо выводы, нужно выслушать обе стороны. Спокойно обсудите с ребёнком, как нужно было поступить в этой ситуации. Часто в незнакомой обстановке малыши просто не знают, что и как нужно сделать.
        <br/>{'     '}✓	Не сравнивайте ребёнка с другими. Особенно болезненно для малыша, если его обсуждают в присутствии одноклассников.
        <br/>{'     '} Сравнивайте успехи ребёнка с его же успехами, достигнутыми ранее.
        <br/>{'     '}Ненавязчиво напоминайте сыну или дочери о новом статусе ученика, новых правах и обязанностях школьника. И, конечно, старайтесь выполнять все рекомендации учителя.
        <br/>{'     '}МАЛЕНЬКИЕ    РОДИТЕЛЬСКИЕ ХИТРОСТИ
        <br/>{'     '} Помните, у первоклассника ещё недостаточно развиты внимание, память, сила воли. Помогайте ему преодолевать трудности. Вспомните, как вам не нравились нравоучительные беседы, когда вы сами были детьми! Поэтому находите более весёлые пути взаимодействия с ребёнком. Это будет гораздо эффективнее скучных нотаций. Если малыш очень торопится при выполнении заданий в тетради, предложите ему перед работой надеть воображаемые “сапоги-тихоходы”, если он, наоборот, медлителен — сказочные “сапоги-скороходы”. Заодно вспомните сказки, в которых герою помогали волшебные предметы. И между прочим подведите малыша к мысли, что ещё более волшебными их сделают его старание и удовольствие от выполняемой работы.
        <br/>{'     '} •	Ученик не успевает за темпом работы в классе? Новая “ручка -всёуспевайка”, полученная в подарок от вас, психологически поможет ему в этом. А дома при выполнении заданий можно использовать песочные часы (на 1 или 5 минут). Они наглядно покажут ребёнку, как бежит время. И, чтобы всё успеть, не нужно терять драгоценных минут.
        <br/>{'     '}•	Школьнику, который часто теряет свои письменные принадлежности (карандаши, ручки, фломастеры и т. д.), подарите “карандаш-непотеряш” — красивый большой карандаш, можно на верёвочке. Его малыш оставит в своём учебном уголке дома. А вечером этот самый главный карандаш “проверит”, всё ли его войско вернулось домой. Ребёнок постепенно приучится следить за своими вещами.
        <br/>{'     '}•	Отправляя маленького озорника в школу, “насыпьте” ему в карман несколько горстей послушания, попросите мыс правах и обязанностях школьника. И, конечно, старайтесь выполнять все рекомендации учителя.
        <br/>{'     '}•	Отправляя маленького озорника в школу, “насыпьте” ему в карман несколько горстей послушания, попросите мысленно надеть “шапку-всёуслышку и всёвидимку”.
        <br/>{'     '}А вечером, “снимая” волшебную шапку, спросите, что нового она увидела и услышала. Расскажет за неё, конечно, ваш малыш. Возможно, не все дети сразу научатся обращаться с такими волшебными предметами. Тут нужен пример родителей. Сами как-нибудь утром, уходя на работу, перед ребёнком “наденьте” эту необыкновенную шапку. Вечером, “снимая” её, расскажите по порядку о событиях прошедшего дня. Малыш с восторгом будет слушать вас. А завтра и сам попробует быть более внимательным в школе. Подобные игры учат ребёнка контролировать цепь событий, тренируют память, связную речь и умение составить план высказывания. Каждая семья сама решит, как часто нужно играть в эту игру, чтобы ребёнок не утратил к ней интереса.
        <br/>{'     '}•	Многим педагогам, наверное, знаком “пакет-кричалка”. Когда очень хочется выплеснуть энергию, малыш может взять пакет, который всегда висит в одном и том же месте, и немного покричать в него (крик можно заменить громкой скороговоркой или песней). Однако стоит объяснить малышу, что это не простое баловство, а средство тренировки его силы воли: выплеснув лишний крик, он будет разговаривать спокойным, уравновешенным тоном.
        <br/>{'     '}•	Из бумаги можно смастерить так называемые Кулёчки Знаний (склеить конус, нарисовать глазки, рот и нос, причёску, украсить игрушку на своё усмотрение). “Если ты внимателен, ты многое услышишь и запомнишь, — говорите вы. — А чтобы тебе было легче и интереснее, рядом будет этот симпатичный Кулёчек Знаний.  “Малыш, который ещё живёт в мире сюжетно-ролевой игры, обычно с удовольствием принимает и эту игру. Когда он особенно постарается, на его столе может появиться даже не один, а несколько Кулёчков Знаний.
        <br/>{'     '} • Если ребёнку трудно запомнить правила этикета, без которых никак не обойтись в общественных местах, выделите ему дома Кресло Вежливости. Сидя в нём, малыш будет слушать ваши объяснения и как бы впитывать в себя правила поведения.
        <br/>{'     '} •	Маленькому хвастунишке о скромности напомнят Бусы Скромности, которые можно смастерить вместе с ребёнком из рябины, желудей или любых других природных материалов. Нанизывая бусинки, побеседуйте о красоте природы, к которой нужно бережно относиться.
        <br/>{'     '}•	Если у ребёнка неаккуратные тетради, подберите момент и вложите в неё просьбу тетради — красочно оформленное письмо, в котором тетрадь от своего имени просит малыша быть более аккуратным и старательным.
        <br/>{'     '}Универсального рецепта общения родителей с ребёнком-школьником нет. Оптимальную систему воспитания и развития малыша семья вырабатывает сама. Только обязательно помните, что вещи, кажущиеся нам очевидными, для ребёнка — нелёгкий труд.
        <br/>{'     '}Выполняя конкретное задание по математике или языкам, ребёнок вынужден учитывать одновременно ещё множество попутных действий:
        <br/>{'     '}✓	соблюдать осанку:
        <br/>{'     '}✓	правильно держать тетрадь, стараясь не помять её во время письма;
        <br/>{'     '}✓	не залезать за поля:
        <br/>{'     '}✓	правильно списывать из учебника;
        <br/>{'     '}✓	между заданиями пропускать определённое количество клеток по математике и строк по языку;
        <br/>{'     '}✓ грамотно переносить слова;
        <br/>{'     '}✓	писать каллиграфическим почерком.
        <br/>{'     '}Автоматизма в действиях ребёнка ещё нет. А родители порой подгоняют, грозят переписыванием. Это снижает положительный эмоциональный фон работы и может обернуться внезапным срывом — слезами, дерзостью. Внимательные папа и мама всегда отметят даже самую незначительную удачу ребёнка, помогут справиться с трудностями. Разумная строгость, конечно, необходима, но с учётом возраста ребёнка и ситуации.
        <br/>{'     '}Учите ребёнка не пугаться заданий. “Я не смогу решить. Я не умею. Я не знаю”, — порой тихо говорят дети, иногда даже не дочитав до конца задание. Оторвитесь от дел, обнимите вашего малыша и подбодрите его: “Tы  обязательно справишься! Я уверена!” А потом предложите ему ещё раз вместе с вами прочесть задание. Не оставляйте ребёнка наедине со своей неуверенностью и постарайтесь сдержать раздражение.
        <br/>{'     '}Иногда страх перед заданием связан с непрочными и недостаточными знаниями. Не пожалейте времени на повторение или закрепление тех знаний, которых не хватило ученику на выполнение задания. Когда с задачей он успешно справится, решите ещё несколько подобных задач. Уверенность маленького человека в своих силах будет восстановлена.
        <br/>{'     '}И напоследок расскажу вам одну чудесную сказку, которая известна многим педагогам и уже стала почти народной. Прочтите её малышу. Уверена: она подарит вам несколько удивительно прекрасных минут.
        <br/>{'     '}ЛАПКА С ПОЦЕЛУЕМ
        <br/>{'     '}Маленький енот Яшка стоял на опушке леса и плакал.
        <br/>{'     '}— Не хочу идти в школу, — сказал он маме. — Я хочу остаться с тобой дома, бегать со своими друзьями, играть с игрушками. Хочу читать свои книжки и качаться на своих качелях. Разреши мне остаться дома, ну, пожалуйста!
        <br/>{'     '}Мама взяла Яшу за лапку, почесала за ушком и сказала ласково:
        <br/>{'     '}—	Иногда нам всем приходится делать не то, что хочется.
        <br/>{'     '}Многое поначалу кажется нам странным и страшным, но тебе понравится в школе. У тебя появятся новые друзья, ты будешь читать новые книжки и качаться на новых качелях. И потом, — добавила она, — я знаю один замечательный секрет, который поможет тебе чувствовать себя в школе так же хорошо и уютно, как дома.
        <br/>{'     '}Яшка вытер глаза и с интересом спросил:
        <br/>{'     '}—	Секрет? Что за секрет?
        <br/>{'     '}—	Это старинный секрет, — ответила енотиха. — Я узнала его от своей мамы, а она от своей. Называется секрет “Лапка с поцелуем”.
        <br/>{'     '}—	Лапка с поцелуем? А что это такое?
        <br/>{'     '}—	Сейчас покажу.
        <br/>{'     '}Мама взяла левую лапку Яшки и раскрыла его маленькие пальчики, как веер. Потом наклонилась и поцеловала Яшку прямо в середину ладошки.
        <br/>{'     '}Яшка почувствовал, как мамин поцелуй побежал вверх по его лапке и добрался до самого сердца. От этого поцелуя стало горячо даже мордочке Яшки, покрытой чёрной шелковистой шерстью.
        <br/>{'     '}— Теперь, — улыбнулась мама, — если ты почувствуешь себя одиноко и заскучаешь по дому, просто прижми лапку к щеке и скажи про себя: “Мама меня любит, мама меня любит”. И тогда поцелуй перепрыгнет тебе на щёчку и наполнит тебя приятными мыслями.
        <br/>{'     '}Она взяла лапку Яшки в свою и осторожно сжала его пальцы в кулачок.
        <br/>{'     '}— Смотри, не потеряй мой поцелуй и не волнуйся, когда ты будешь мыть лапки, — поцелуй не смоется.
        <br/>{'     '}Яшке очень понравилась его лапка с поцелуем. Теперь он знал, что мамина любовь навсегда останется с ним, куда бы он ни пошёл. Даже в школу. Через некоторое время малыш и его мама стояли напротив школы. Яшка задумался. Внезапно он повернулся к маме и улыбнулся.
        <br/>{'     '}— Дай мне твою лапу, — попросил он. Яшка взял мамину лапу своими лапками и раскрыл веером её большие, хорошо знакомые пальцы. Потом он тихонько поцеловал маму в середину ладони.
        <br/>{'     '}—Теперь у тебя тоже есть лапка с поцелуем. Я люблю тебя, мамочка! —произнёс он и вприпрыжку побежал к школе.
        <br/>{'     '}Мама смотрела, как Яшка перепрыгнул через ветку дерева и вошёл в школу. А когда старая мудрая сова позвонила в колокольчик, объявляя о начале урока, мама прижала лапу к щеке и улыбнулась. Тепло поцелуя Яшки наполнило её сердце, которое повторяло: “Яшка тебя любит! Твой сын тебя любит!”
        <br/>{'     '}Не правда ли, замечательная сказка! Пусть такую ладошку с поцелуем возьмёт с собой в школу каждый ученик. И тепло родительской заботы всегда будет рядом с ним.
        <br/>{'     '}Ирина БУТОРИНА,
        <br/>{'     '}учитель начальных классов СШ № 189 г. Минска // Рюкзачок  для пап и мам. – 2008. - №9. – с.1-8.
      </p>
    );
  }

  getEpigraph(){
    return (
      <p>
        Дети учатся не на ошибках, а на своих успехах и достижениях.
        <br/>Дети развиваются “прибавлением” положительного,
        <br/>а не “вычитанием” отрицательного.
        <br/>Знака “минус” в педагогической арифметике нет,
        <br/>в ней только “плюс”, “умножить” да ещё “разделить” — разделить с детьми тревоги и трудности.
        <br/>С. Л. Соловейчик
      </p>
    );
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    return (
      <BaseTextComponent title={'Чудо рождения ученика'} data={data} epigraph={epigraph}/>
    );
  }
}

export default BirthPupil;
