import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class FingerGymnastics extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Пальчиковые игры не только влияют на развитие речи и способствуют развитию мелкой мускулатуры, которая является залогом успешного овладения письмом в первом классе. От моторики зависит и почерк учащихся, степень утомляемости при письме. Пальчиковые игры позволяют переключать внимание детей, способствуют снижению нервного напряжения. Это прекрасное занятие в свободное время.
        <br/>{'     '}Влияние мануальных (ручных) действий на развитие мозга человека было известно еще во II веке до нашей эры в Китае.
        <br/>{'     '}Специалисты утверждают, что игры с участием рук и пальцев типа нашей «Сороки-белобоки» помогают найти гармонию в тандеме тело - разум, поддерживают мозговые системы в превосходном состоянии.
        <br/>{'     '}<b>Простые правила игры</b>
        <br/>{'     '}1.	Старайтесь, чтобы в игры вовлекались все пальчики (особенно безымянный и мизинчик – они самые ленивые).
        <br/>{'     '}2.	 Обязательно чередуйте три типа движений:
        <br/>{'     '}сжатие;
        <br/>{'     '}растяжение;
        <br/>{'     '}расслабление.
        <br/>{'     '}<b>Как еще активизировать пальчики</b>
        <br/>{'     '}1. Дайте газету, листы бумаги – пусть рвет (только следите, чтоб в рот не отправлял эти «откуски»).
        <br/>{'     '}2. Нанижите на крепкую нитку крупные пуговицы – пусть перебирает.
        <br/>{'     '}3.Дайте деревянные бусы, счеты, пирамидки.
        <br/>{'     '}4. Нарисуйте на пластмассовых пробках мордочки, наденьте на пальцы. У вас получится пальчиковый театр.
        <br/>{'     '}<b>Пальчиковая гимнастики в стихах</b>
        <br/>{'     '}<b>Дом</b>
        <br/>{'     '}Я хочу построить дом,
        <br/>{'     '}(<i>Руки сложить домиком, и поднять над головой</i>)
        <br/>{'     '}Чтоб окошко было в нём,
        <br/>{'     '}(Пальчики обеих рук соединить в кружочек)
        <br/>{'     '}Чтоб у дома дверь была,
        <br/>{'     '}(Ладошки рук соединяем вместе вертикально)
        <br/>{'     '}Рядом чтоб сосна росла.
        <br/>{'     '}(Одну руку поднимаем вверх и "растопыриваем" пальчики)
        <br/>{'     '}Чтоб вокруг забор стоял,
        <br/>{'     '}Пёс ворота охранял,
        <br/>{'     '}(Соединяем руки в замочек и делаем круг перед собой)
        <br/>{'     '}Солнце было, дождик шёл,
        <br/>{'     '}(Сначала поднимаем руки вверх, пальцы "растопырены". Затем пальцы опускаем вниз, делаем "стряхивающие" движения)
        <br/>{'     '}И тюльпан в саду расцвёл!
        <br/>{'     '}(Соединяем вместе ладошки и медленно раскрываем пальчики -   "бутончик тюльпана")
        <br/>{'     '}<b>Друзья - садоводы</b>
        <br/>{'     '}Палец толстый и большой
        <br/>{'     '}В сад за сливами пошёл.
        <br/>{'     '}(Ладошка собрана в "кулачок". Отгибаем большой пальчик, выпрямляем его, затем сгибаем наполовину. Снова сгибаем и так несколько раз)
        <br/>{'     '}Указательный с порога
        <br/>{'     '}Указал ему дорогу.
        <br/>{'     '}(Отгибаем указательный пальчик, далее "сгибаем-разгибаем")
        <br/>{'     '}Средний палец самый меткий,
        <br/>{'     '}Он сбивает сливы с ветки.
        <br/>{'     '}(Отгибаем средний пальчик, "сгибаем-разгибаем" его. При этом нужно стараться не сгибать указательный и большой пальцы)
        <br/>{'     '}Безымянный подбирает,
        <br/>{'     '}(Отгибаем также безымянный, постараться не шевелить предыдущими пальчиками)
        <br/>{'     '}А мизинчик-господинчик
        <br/>{'     '}В землю косточки бросает!
        <br/>{'     '}(Отгибаем мизинчик)
        <br/>{'     '}<b>Кораблик</b>
        <br/>{'     '}По реке плывёт кораблик,
        <br/>{'     '}(Прижимаем нижние части ладошек друг к другу, верхние открыты - показываем "кораблик")
        <br/>{'     '}Он плывёт издалека,
        <br/>{'     '}(Приставляем горизонтально левую руку к глазам - "смотрим вдаль")
        <br/>{'     '}На кораблике четыре очень храбрых моряка.
        <br/>{'     '}(Показать 4 пальца)
        <br/>{'     '}У них ушки на макушке,
        <br/>{'     '}(Приставляем обе ладошки к своим ушам)
        <br/>{'     '}У них длинные хвосты,
        <br/>{'     '}(Кончики пальцев обеих рук соединяем вместе и далее медленно разводим руки в стороны)
        <br/>{'     '}И страшны им только кошки, только кошки да коты!
        <br/>{'     '}(Показываем две открытые от себя ладошки, затем пальчики слегка сгибаем - получаются "коготки")
        <br/>{'     '}В конце этой игры можно спросить у ребёнка:
        <br/>{'     '}-Что за моряки были на кораблике?
        <br/>{'     '}Ответ: мышки.
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  getLinks(){
    return [
      {
        id: '1',
        url: 'http://dadandmom.ru/razvitie/palchikovaya-gimnastika-dlya-detej-v-stixax.html',
        label: 'Пальчиковая гимнастика для детей в стихах'
      },
      {
        id: '2',
        url: 'http://rodnaya-tropinka.ru/palchikovaya-gimnastika',
        label: 'Пальчиковая гимнастика'
      },
      {
        id: '3',
        url: 'http://erudit02.ru/palchikovaya-gimnastika-dlya-detej-5-6-let',
        label: 'Пальчиковая гимнастика для детей 5-6 лет'
      },
      {
        id: '4',
        url: 'https://sibmama.ru/palchiki.htm',
        label: 'Стихи для пальчиковой гимнастики'
      },
      {
        id: '5',
        url: 'https://nsportal.ru/detskiy-sad/raznoe/2015/10/06/palchikovaya-gimnastika-dlya-detey-5-7-let',
        label: 'Пальчиковая гимнастика для детей 5-7 лет'
      },
    ];
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    const links = this.getLinks();
    return (
      <BaseTextComponent title={'Пальчиковая гимнастика'} data={data} epigraph={epigraph} links={links}/>
    );
  }
}

export default FingerGymnastics;
