import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class LeadingHand extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        <p style={{textAlign: 'center'}}>
          <b>Как  определить ведущую руку</b><br/>
        </p>
        {'     '}Существует несколько способов определения ведущий руки: один из них – опросник, второй  - экспериментальное тестирование в деятельности при выполнении детьми бытовых и графических действий. Не останавливаясь подробно на методике и технике подобных исследований, мы хотим привести упрощенный вариант тестирования, предложенный сотрудниками НИИ физиологии АПН СССР М.Г. Князевой и В.Ю. Вильдавским. Эти тесты содержат игровые задания, подобранные с учетом способов манипулирования, свойственных детям дошкольного и  младшего школьного возраста.  При выполнении тестирования учитель должен сесть напротив ребенка (лучше за столом), но не сбоку. Обстановка должна быть спокойной, благожелательной, не следует фиксировать внимание ребенка на том, что вы определяете «рукость». Можно начать тестирование следующими словами: «Сейчас мы с тобой поиграем» или «Давай-ка мы поработаем вместе: я буду давать тебе задания, а ты постарайся их хорошо выполнить». Все приспособления, пособия, предметы надо положить перед ребенком строго на середину стола на равном расстоянии от правой и левой руки.
        <br/>{'     '}<i>Первое задание</i> – рисование. Положите перед ребенком лист бумаги и карандаш (фломастер), предложите ему нарисовать то, что он хочет (или может). Не торопите ребенка. После того как он закончит, попросите его нарисовать то же самое другой рукой. Часто дети отказываются: «Я не умею», «У меня не получится». Можете успокоить его: «Я знаю, что это трудно нарисовать такой же рисунок правой (левой) рукой, но ты постарайся», подбодрить, что он делает все верно. В этом задании учитывается не только  к а к о й  рукой ребенок работает, но при работе какой рукой лучше качество  выполнения рисунка.
        <br/>{'     '}<i>Второе задание</i> – открывание небольшой коробочки, например спичечного коробка. Ребенку предлагается несколько коробочек (можно покрасить их в разные цвета или оклеить цветной бумагой). З а д а н и е  :»Найди спичку в одной из коробочек». Ведущей будет считаться та рука, которая совершает активные движения: закрывает, открывает, вынимает спичку.
        <br/>{'     '}<i>Третье задание</i> -  построение колодца из спичек.  Ведущая -  та рука, которой более активно выполняются все действия.
        <br/>{'     '}<i>Четвертое задание</i> – игра в мяч. Нужен небольшой (можно теннисный) мяч, который можно бросать и ловить одной рукой. Мяч кладется на стол прямо перед ребенком, и вы просите ребенка как  можно точнее бросить его в какую-то заранее намеченную цель несколько раз. Ведущая -  та рука, которой ребенок бросает мяч.
        <br/>{'     '}<i>Пятое задание</i> – вырезание ножницами по контуру рисунка на любой открытке (вырезать цветок, машинку, Чебурашку и т.п.). Ведущая --  та рука, которой ребенок держит ножницы. Но бывает и так, что ребенок плохо владеет ножницами: он просто держит их и более активно работает (поворачивает открытку) другой рукой. В этом случае попробуйте попросить его взять ножницы в другую руку и оцените, какой рукой задание выполняется лучше.
        <br/>{'     '}<i>Шестое задание</i> -   нанизывание бисера, бусинок или пуговиц на иголку с ниткой. Ведущей считается та рука, которая выполняет активное движение вне зависимости от того, в какой руке иголка. Активное движение может осуществляться как рука с иголкой, так и рука, держащая и насаживающая бусинку или пуговицу на иголку.
        <br/>{'     '}<i>Седьмое задание</i>  -  выполнение вращательных движений при открывании и закрывании крышек на пузырьках. Предлагают 2-3 пузырька с завинчивающимися крышками (лучше от мазей, лекарств с широкой крышкой). Ведущая  -  та рука, которая совершает активные движения (крутит крышку или пузырек).
        <br/>{'     '}<i>Восьмое задание</i> – развязывание узелков. Предварительно нужно неплотно завязать несколько узелков (на небольшом расстоянии) из шнура средней толщины. Ведущая  -  та рука, которая развязывает узелок.
        <br/>{'     '}<i>Девятое задание</i> – «Построй из кубиков дом, машину, крепость и т.п.» в этом задании оценить ведущую руку труднее, чем в предыдущих, так как этот вид работы дети выполняют обычно двумя руками. Поэтому не торопите ребенка, а понаблюдайте, какой рукой чаще он берет, укладывает, поправляет кубики.
        <br/>{'     '}После выполнения каждого задания (1,2,3 и т.д.) нужно поставить знак плюс (+) в графу «Левая рука», если ведущей  была левая рука, или в графу «Правая рука»,  если ведущей  была правая. В этом случае, когда ребенок одинаково ловко действовали правой и левой рукой, нужно поставить плюс в графу «Обе руки».
        <br/>{'     '}Еще один очень важный вопрос необходимо выяснить и занести в протокол: имеются ли у ребенка родственники-левши (братья, сестры, родители, бабушки, дедушки).  Можно сделать это в процессе бесед с родителями, можно (и даже нужно) поставить этот вопрос в анкету знакомства с мальчиком или девочкой при  записи в школу или в первые дни обучения. При наличии семейной леворукости знак плюс заносится в графу «Левая рука», при отсутствии --  в графу «Правая рука».
        <br/>{'     '}Леворуким будет считаться тот ребенок, у которого в графе «Левая рука» больше плюсов. Если ребенок одинаково хорошо владеет и правой и левой рукой, то выбор руки для письма будет определяться не только тем, какой рукой он рисует и пишет, но и тем, каково качество рисунка и левой и правой рукой.
        <br/>{'     '}М.М.Безрукова, С.П.Ефимова. Знаете ли вы своего ученика? .Просвещение, 1991.-176 с.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data}/>
    );
  }
}

export default LeadingHand;
