import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class LeftHand extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        <p style={{textAlign: 'center'}}>
          Оксана Макерова<br/>
          <b>Школьные трудности леворуких</b><br/>
          (трудности при овладении навыком письма и чтения)<br/>
          https://solnet.ee/parents/log_59
        </p>
        {'     '}Наибольшие трудности при овладении программой по русскому языку испытывают леворукие дети. И отказ от переучивания леворукого ребенка не снимает большого комплекса проблем, возникающих в процессе его обучения в школе, скорее, ставит целый ряд других, не менее важных. Практически леворукого ребенка у нас учат так же, как праворукого, и именно поэтому в школе нередко настаивают на переучивании. Леворуких обучают по тем же методикам, что и праворуких. Между тем, функциональные особенности леворуких детей (такие, как трудности осуществления зрительно-моторных координаций, нарушения пространственного восприятия, повышенная утомляемость и сниженная работоспособность, тревожность и возбудимость) не могут не вызывать целый ряд школьных трудностей. Но какими бы ни были трудности, чаще всего это - трудности обучения письму (реже - письму и чтению вместе).
        <br/>{'     '}Работая в начале века с детьми, имеющими трудности обучения, врач Сэмюел Ортон обратил внимание на то, что среди них часто встречаются левши и дети с нестабильным предпочтением руки. Ортон заметил также, что у многих леворуких детей доминирует правый глаз (они смотрят правым глазом в микроскоп, в дырочку в карточке и т.д.). На основании этих наблюдений Ортон предположил, что причиной трудностей в обучении чтению является неполная доминантность левого полушария. Работы С. Ортона вызвали большой интерес в научной и медицинской среде к изучению дислексии как проявлению специфических трудностей обучения, не связанных с задержками развития или эмоционально мотивированной сферой.
        <br/>{'     '}Русское письмо основано на звукобуквенном анализе, и комплекс трудностей, связанный со звукобуквенным анализом, очень характерен для леворуких детей. В своих статьях о леворуких детях (см. "<a href="https://solnet.ee/parents/log_05" target="_blank">Ребенок из Зазеркалья</a>") я упоминала о том, что леворукие дети - не однородная группа, а значит, у разных левшей могут быть разными и проявления трудностей, и те меры коррекции, которые им необходимы.
        <p style={{textAlign: 'center'}}>
          <b>Общие положения условий письма</b><br/>
          (посадка, положение тетради, способ держания ручки).
        </p>
        {'     '}1. Прежде всего, нужно учесть, что и правонаклонное, и левонаклонное письмо практически невозможно для леворукого ребенка, так как при письме он будет рабочей рукой загораживать себе линию письма. Более целесообразно, если при правостороннем наклоне тетради леворукий ребенок будет писать прямо, не загораживая себе линию строки и соблюдая правильную посадку при письме. Посадка при письме леворукого ребенка стандартная, но немного вперед выдвинуто не правое, а левое плечо. Положение тетради при этом может быть различным. Я рекомендую повернуть тетрадь или лист бумаги так, чтобы верхний правый угол лежал с наклоном вправо, а верхний левый угол располагался напротив груди.
        <br/>{'     '}2. Категорически противопоказано требовать от леворукого ребенка безотрывного письма! (Безотрывное письмо нецелесообразно и для праворуких детей.) Нужно с самого начала создать условия, чтобы ребенок не чувствовал неловкости, неуверенности, выбрал для себя тот вариант письма, связанного или несвязанного, который в большей мере соответствует его способностям и возможностям. Траектория движения руки при написании букв, как показывает опыт, может быть самой разной и не соответствовать той, которой учат. При письме леворукие дети чаще выполняют овалы слева направо и сверху вниз. У них больше обрывов, меньше связность. Соединяются буквы, как правило, короткими прямыми линиями.
        <br/>{'     '}3. Неправильный способ держания ручки часто создает много дополнительных трудностей при обучении письму. Особого внимания требуют леворукие дети, которые держат при письме ручку или карандаш над строчкой, при этом рука находится в так называемом инвертированном положении и согнута в виде крючка По мнению некоторых ученых, подобное положение ручки при письме дает информацию о том, какое полушарие контролирует речевые и языковые функции у ребенка. Считается, что инвертированное положение ручки свидетельствует о том, что речевые функции ребенка контролируются левым полушарием (так же, как и у праворуких детей).
        <br/>{'     '}Но существует и еще одно мнение, прямо противоположное: инвертированное положение ручки не отражает особенности деятельности полушарий коры головного мозга, а показывает несоответствие методики возможностям ребенка. В последние годы, особенно в тех случаях, когда требование безотрывности при письме соблюдается неукоснительно, очень часто и леворукие, и праворукие ученики держат ручку инвертированно. Это естественная реакция детей, которым трудно координировать одновременное передвижение руки вдоль строки и сложную траекторию движений при выполнении каждой буквы при безотрывном письме.
        <br/>{'     '}Ребенок вынужден либо сильно изменить позу при письме (буквально лечь, выдвинув сильно вперед плечо), либо держать ручку почти перпендикулярно строке, что возможно только при инвертированном ее положении. Такое положение ручки необходимо исправлять, так как оно вызывает очень сильное мышечное напряжение у праворукого ребенка, но не следует настаивать на исправлении положения ручки у леворукого.
        <br/>{'     '}<b>Дисграфические ошибки на письме леворуких детей:</b>
        <br/>{'     '}- выраженные нарушения почерка, тремор,
        <br/>{'     '}- неправильное начертание букв (оптические ошибки: п-т, л-м, н-к, х-ж и др.), искажение их конфигурации,
        <br/>{'     '}- искажение соотношения частей, зеркальное письмо.
        <br/>{'     '}У леворуких детей гораздо чаще, чем у праворуких, отмечается весь комплекс трудностей. Леворуких детей отличает более медленный темп письма. Вообще, обучение письму - процесс не только длительный (навык письма формируется лишь к 9-10 годам), но и чрезвычайно многокомпонентный. На начальном этапе (букварный период) почти все внимание ребенка сосредоточено на том, как писать тот или иной элемент, букву. При обучении письму, особенно в букварный период, необходимо учитывать и трудности зрительно-пространственной ориентировки, недостаточной дифференциации отдельных пространственных признаков контура букв. Специальные исследования показывают, что значительная часть леворуких детей имеет недостаточное развитие моторных функций и зрительно-моторных координации, а также недостатки пространственного восприятия и зрительной памяти.
        <br/>{'     '}<i>Как эти трудности сказываются при изучении букв?</i>
        <br/>{'     '}Леворукий ребенок с трудом и только после многих попыток понимает, что он должен написать и как он должен это сделать, он словно не видит строк, уводя букву за верхнюю и нижнюю строку. Он может путать не только правую и левую стороны буквы, но даже верх и низ. Особенно трудно детям выделить точку начала движения и выбрать правильную траекторию. Для того чтобы снять эти трудности, необходима специальная тренировка пространственно-зрительного восприятия, зрительной памяти. Для этого можно использовать <b>упражнения, которые помогут устранить трудности в изучении букв</b>:
        <br/>{'     '}1. Копирование различных фигур и их сочетаний.
        <br/>{'     '}2. Воспроизведение их по памяти, различение фигур среди других.
        <br/>{'     '}<i>Для развития зрительного восприятия могут быть использованы и различные модификации заданий, разработанных польской исследовательницей Барбарой Закревской, например, такие:</i>
        <br/>{'     '}3. Сравни фигуры с моделью; зачеркни фломастерами разного цвета указанные стороны фигур.
        <br/>{'     '}4. Нарисуй квадрат.
        <br/>{'     '}- поставь точку посередине сверху над квадратом;
        <br/>{'     '}- поставь точку посередине снизу под квадратом;
        <br/>{'     '}- поставь точку справа посередине;
        <br/>{'     '} - поставь точку слева посередине.
        <br/>{'     '}<i>Если все выполнено правильно, усложняем задание:</i>
        <br/>{'     '}- соедини точки над квадратом и под квадратом прямой линией;
        <br/>{'     '}- соедини точки справа и слева прямой линией.
        <br/>{'     '}<i>Если задание выполнено без ошибок, то просим ребенка соединить точки так, чтобы получились треугольники. Затем предлагаем их посчитать:</i>
        <br/>{'     '}- Сколько всего треугольников получилось? (можно закрасить их разным цветом, можно обозначить цифрами)
        <br/>{'     '}- Сколько получилось квадратов?
        <br/>{'     '}<i>Для начала можно взять лист бумаги в клетку, а потом использовать нелинованную бумагу.</i>
        <br/>{'     '}<i>Вот еще аналогичное задание:</i>
        <br/>{'     '}5. Нарисуй прямоугольник и поставь точки:
        <br/>{'     '}- в правом верхнем углу,
        <br/>{'     '}- в левом верхнем углу,
        <br/>{'     '}- в середине верхней стороны,
        <br/>{'     '}- в середине нижней стороны,
        <br/>{'     '}- соедини эти точки прямыми линиями.
        <br/>{'     '}Посчитай, сколько получилось треугольников, прямоугольников; заштрихуй их разным цветом.
        <br/>{'     '}<i>При условии правильного выполнения упражнения продолжаем задания:</i>
        <br/>{'     '}- обозначь крестиком нижний правый угол и нижний левый угол;
        <br/>{'     '}- соедини крестики с точкой на середине верхней стороны прямоугольника.
        <br/>{'     '}Посчитай, сколько теперь прямоугольников и треугольников. Заштрихуй их разным цветом.
        <br/>{'     '}Выполняя эти задания, решается сразу нескольких коррекционных задач:
        <br/>{'     '}а) ребенок учится целенаправленно работать,
        <br/>{'     '}б) тренирует зрительное восприятие,
        <br/>{'     '}в) тренирует руку (штриховка),
        <br/>{'     '}г) считает,
        <br/>{'     '}д) вспоминает геометрические фигуры,
        <br/>{'     '}е) закрепляет понятия "верх", "низ", "справа", "слева и т. д.
        <br/>{'     '}Хочу еще раз обратить Ваше внимание, что при обучении письму леворукого ребенка, тем более имеющего отклонения в развитии моторики и зрительно-пространственного восприятия, особое внимание следует уделить вербальному (словесному) описанию движения, а также уточнению действий, по ходу их - выделению основных элементов, точки начала движения и направления движения.
        <br/>{'     '}Для того чтобы такое объяснение было эффективным, следует вести его, повторяя несколько раз с одновременным показом или выполнением действия самим учеником. Это позволит избежать ошибок в выполнении движений, которые легко закрепляются в процессе формирования навыка, но практически не поддаются переучиванию.
        <br/>{'     '}<b>Нужно обратить внимание на последовательность обучения.</b>
        <br/>{'     '}Сначала Вы объясняете, как выполняются действия (написание буквы), из каких элементов буква складывается, как элементы связаны между собой, где начинается движение, где заканчивается, какова его траектория. Объяснение должно подкрепляться показом картинок, карточек, выполнением элементов на бумаге.
        <br/>{'     '}На следующем этапе не следует еще давать ребенку самостоятельно выполнять действие, сначала попросите его "поруководить" вашими движениями: "Начинай здесь, веди сюда, поворачивай... заканчивай...". По данным психологов, ребенок, не отягощенный собственными действиями, неумением, неловкостью, лучше фиксирует свое внимание на составляющих движения (здесь важно все: как держится ручка, как лежит рука, как она передвигается по строке, удерживается ли правильная поза и только потом - как выполняется буква).
        <br/>{'     '}Самостоятельное выполнение действия должно идти под Вашим контролем и при подсказке, но эта подсказка должна бить минимальной, лучше, если ребенок будет руководить своими действиями так, как он руководил чужими. Сначала он будет делать это вслух, но по мере формирования навыка это словесное руководство будет выполняться мысленно.
        <br/>{'     '}На выполнении действия не заканчиваются этапы обучения. Еще один важный элемент - анализ выполненного. Конечно, необходим и анализ того, как выполнялось действие (это достаточно просто осуществить, если есть видеомагнитофон). Если ребенок может объективно оценить, что и где не так, значит, предыдущие этапы проведены правильно, если нет, все следует начать сначала.
        <br/>{'     '}Важным элементом анализа буквы должно быть определение траектории движения, точки начала движения. При изучении каждого элемента, каждой буквы нельзя заставлять ребенка искать траекторию движения, нельзя действовать по инструкции "делай, как я", по принципу механического копирования. Следует не только объяснить, "где начинать, куда вести, где закончить", но и повторить эту инструкцию (возможно, и не раз) так, чтобы ребенок смог сам себе продиктовать, что делать: обозначить точки начала движения (опорные точки), разобрать, из каких частей (элементов) состоит буква, выделить каждый элемент, определить точку начала движения и траекторию движения.
        <br/>{'     '}По мере изучения букв можно сделать карточки для каждой буквы, заглавной и строчной, и положить их под стекло на письменном столе либо наклеить на лист ватмана и сделать своего рода таблицу "Как писать буквы". Во всяком случае, такая таблица должна быть все время перед глазами.
        <br/>{'     '}<b>Несколько слов о зеркальном письме</b>
        <br/>{'     '}Нередко зеркальное письмо считается индикатором леворукости, по-видимому, потому, что у леворуких оно действительно часто встречается. Однако не всегда зеркальное письмо - признак леворукости. Некоторые исследователи даже считают, что в возрасте 3-7 лет зеркальное письмо у детей со слабостью зрительно-пространственной ориентации является закономерным этапом овладения навыком.
        <br/>{'     '}<i>Что же такое зеркальное письмо?</i> Фактически это зеркальное отражение движений правой руки. При этом зеркальность не только не осознается в ходе движения, но зеркально написанный текст читается без особого труда, словно он написан правильно. Иногда зеркально пишутся только некоторые буквы, иногда слова и фразы.
        <br/>{'     '}У леворуких детей отмечается и зеркальное рисование. Особенно четко это проявляется при копировании одной или нескольких фигур. Части фигуры или сами фигуры меняются местами: правые - налево, левые - направо. А ребенок при этом может не осознавать, что он неправильно рисует.
        <br/>{'     '}Важно постоянно помнить о том, что письмо, почерк являются своеобразным индикатором состояния нервной системы ребенка. Интересно, что при ухудшении функционального состояния, при утомлении у неустойчивых правшей, как и у леворуких, "вдруг" может вновь появиться зеркальное письмо. Зеркальное письмо наиболее часто появляется у переученных левшей, причем способность писать зеркально может сохраняться на всю жизнь.
        <br/>{'     '}<b>Трудности при обучении чтению</b>
        <br/>{'     '}Трудности левшей при обучении чтению также могут быть связаны с нарушениями пространственного восприятия или зеркальным восприятием. Это могут быть:
        <br/>{'     '}- перестановки букв местами и даже чтение текста зеркально,
        <br/>{'     '}- могут быть замены букв близкими по конфигурации,
        <br/>{'     '}- "перескок" через строку и тому подобные нарушения.
        <br/>{'     '}Проявления ошибок или нарушений пространственного различия могут быть разными, например, дети часто путают расположение предметов на парте, и просьбы положить тетрадь слева или книгу правее выполняют наоборот.
        <br/>{'     '}Особый комплекс трудностей при обучении письму и чтению отмечается у тех леворуких детей, у которых имеется то или иное нарушение в деятельности левого (речевого) полушария. Дело в том, что современная методика обучения письму в начальной школе опирается на всю систему языкового развития ребенка, а не только на определенные правила и орфографические умения. При этом навыки письма рассматриваются как составная часть речевых умений и языкового развития в целом. Процесс овладения навыком письма имеет сложнейшую психофизиологическую структуру и включает слуховой анализ, артикуляцию, формирование и сохранение зрительно-двигательного образа каждого графического элемента (буквы), а также сложные механизмы координации и регуляции движений. При этом в процессе овладения навыком дети должны уметь усвоить понятие о буквах - графических знаках, с помощью которых звучащая речь фиксируется на бумаге, усвоить разное начертание одной и той же буквы в различных вариантах (печатных, письменных, больших, маленьких), должны научиться правильно дифференцировать звуки речи, безошибочно узнавать и правильно записывать, соотносить их со звуками.
        <br/>{'     '}Параллельно идет формирование и орфографического навыка. К сожалению, пока ни психология, ни физиология, ни педагогика не располагают данными о том, какое из звеньев этой сложной структуры имеет решающее значение при обучении, но, тем не менее, ясно, что "выпадение" любого из них затрудняет формирование навыка. Вот почему любая дисфункция любой зоны коры головного мозга, и особенно левого речевого полушария, может стать причиной комплексных трудностей, когда наряду с чисто техническими (моторными) трудностями будет затруднен и звукобуквенный анализ. На начальном этапе обучения эти затруднения еще невелики, но уже к концу первого полугодия у детей с подобными затруднениями отмечаются пропуски и замены букв, перестановки, недописывания и другие нарушения письма.
        <br/>{'     '}<span style={{color: 'red'}}><b>Родители, обратите особое внимание!</b></span>
        <br/>{'     '}Если ваш леворукий ребенок поздно начал говорить, если плохо произносил или дифференцировал звуки, если его речь бедна и невыразительна - все это факторы риска, а значит, с первых дней обучения нужно начать целенаправленную и систематическую работу по звукобуквенному анализу.
        <br/>{'     '}<span style={{color: 'red'}}>Не будет лишней в этих случаях консультация логопеда, рекомендации которого для вас обязательны.</span>
        <br/>{'     '}Разумеется, у леворукого ребенка (как и любого праворукого) могут быть свои, сугубо индивидуальные трудности, свои осложнения в процессе учебы. Не всегда он сможет справиться с ними сам, чаще всего ему нужны будут ваша поддержка и помощь.
        <br/>{'     '}<b>Литература</b>
        <br/>{'     '}Хочу порекомендовать литературу, которая поможет Вам в самостоятельных занятиях с ребенком.
        <br/>{'     '}1. Безруких М. М. Леворукий ребенок: Тетрадь для занятий с детьми. Методические рекомендации. - М.: Вентана-Граф, 2001 (Готовимся к школе).
        <br/>{'     '}2. Леворукий ребенок в школе и дома// Приложение: 128 карточек для развития логики и речи. Изд. 2-е, перераб. Издательство: Екатеринбург: У -Фактория
        <br/>{'     '}3. Гаврина С. Прописи для леворуких детей. Издательство РОСМЭН, 2006
        <br/>{'     '}4. Дубова С. Ф., Паншина И. А. "Прописи для левшей", издательство ГУП "Печатный двор".
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data}/>
    );
  }
}

export default LeftHand;
