import React from 'react';

import BaseTextComponent from '../shared/BaseTextComponent';

class FirstGrader2016 extends React.Component {

  getData(){
    const width = '50%';
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Как узнать своих будущих учеников? Этим вопросом задаются все учителя первых классов накануне учебного года. Можно встретиться за круглым столом с педагогами ближайших к школе учреждений дошкольного образования, выпускники   которых чаще всего поступают в учреждение общего среднего. А если ребята приходят из разных, в том числе и далеко расположенных дошкольных учреждений? В своей книге «Здравствуйте, дети!» Ш.А.Амонашвили  рекомендует учителям первых классов  знакомиться со своим учениками (а их он называет своим маленькими учителями)  заранее, пусть даже заочно, изучая, например, их фотографии.  А еще можно провести анкетирование родителей на первом собрании в августе, накануне учебного года. С целью  создания портрета первоклассника и учета  индивидуальных особенностей учащихся при организации образовательного процесса учителя первых классов ГУО «Средняя школа №23 г.Гродно» в августе  2016 года провели анкетирование (Приложение 1) родителей (83 человека). В результате была получена следующая информация о первоклассниках:
        <br/>{'     '}На вопрос «Проходил ли ребенок подготовку к школе (респондентам можно выбрать несколько вариантов ответов)»  родителями были даны такие ответы:
        <br/><img src={'f_g_2016_1.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_2.png'} style={{width: width}}/>
        <br/>{'     '}Данные, представленные в таблице1 и диаграмме1, свидетельствуют о различиях  родительских взглядов на необходимость подготовки детей к школе. Так, количество первоклассников (в процентах), не проходивших подготовку к школе (по мнению родителей) варьируется от 0 (1Б и 1Г классы) до 25 (1В класс), хотя детей, не посещавших дошкольные учреждения только 2 человека, что составляет 3% от количества первоклассников. Это означает, что родители не в полной мере осведомлены о системе дошкольного образования.  Подготовку к школе  в старшей группе детского сада проходили (по мнению родителей) от 50% до 96% первоклассников, что подтверждает ранее сделанный вывод о неполной осведомленности родителей в вопросе организации занятий в детских садах.  От 5% до 60% первоклассников проходили дополнительную подготовку в школах города, что позволяет данной категории учащихся легче и быстрее адаптироваться в школе, у этих детей быстрее формируется позиция школьника. До 24% учащихся (1Г класс) занимались с учителем-дефектологом, что свидетельствует о наличии речевых затруднений, в связи  чем,  этим детям необходим индивидуальный подход при организации образовательного процесса и работа по профилактике дисграфии. 11% учащихся 1А класса дополнительно занимались с репетитором, таким образом, выявляется заинтересованность родителей в обучении своих детей. От 15% (1Б, 1В, 1Г классы) до 28% первоклассников (1А  класс) занимались дома с родителями, что говорит об участии родителей в жизни детей.
        <br/>{'     '}Обобщая полученные ответы на первый вопрос, можно констатировать следующее:
        <br/>{'     '}1.	Совершенно не готовились к школе (по мнению родителей!) 19% первоклассников, т.е. каждый пятый, при этом только 3% из числа первоклассников не посещали дошкольные учреждения, а, значит, были включены  в занятия, проводимые в  детском саду, следовательно, родители недостаточно активно участвуют в жизни детей, недостаточно сотрудничают с педагогами ДУ и  ведут себя  отстраненно.
        <br/>{'     '}2.	По информации родителей, 69% детей  занимались в ДУ, 19% - посещали подготовительные занятия в нашей школе, 7% - в других школах города, 15% - занимались с учителем-дефектологом, 2% - с репетитором, 18% - готовились к школе под руководством родителей.
        <br/>{'     '}3.	Часть первоклассников  посещала несколько видов подготовительных занятий (в данном вопросе можно было указать несколько вариантов ответа), например: в детском саду, в школе и занятия с родителями; в детском саду, занятия с учителем-дефектологом и с родителями и т.д.
        <br/>{'     '}На вопрос  «Насколько часто до поступления ребенка в школу Вы или другие члены семьи занимались с ним»  родители ответили так:
        <br/><img src={'f_g_2016_3.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_4.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_5.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_6.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_7.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_8.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_9.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_10.png'} style={{width: width}}/>
        <br/>{'     '}Проанализировав  данные таблиц 2-4 и диаграмм  2-5, мы выяснили:
        <br/>{'     '}- книги читали детям практически все родители, из них 35% это делали  иногда, а 64% - часто, причем,  сведения варьируются от 25% (1В класс) до 72% (1А класс);
        <br/>{'     '}- иногда рассказывали истории детям 42% взрослых, часто – 58%;
        <br/>{'     '}- иногда пели песни детям  47% респондентов, 39%  -  это делали  часто;
        <br/>{'     '}- иногда играли в игры с алфавитом, т.е. обучали детей азам чтения в игровой форме,  49 % взрослых, часто – 44%;
        <br/>{'     '}- иногда играли в игрушки со счетом, значит, формировали арифметические навыки в игре,   47% опрошенных, часто – 45%;
        <br/>{'     '}- иногда учили детей с использованием компьютера  47% родителей, часто – 26%;
        <br/>{'     '}- иногда  смотрели совместно с детьми учебные телепередачи, фильмы  54%  взрослых, 42% - часто;
        <br/>{'     '}- иногда  играли с детьми в слова  37% респондентов, часто – 53%;
        <br/>{'     '}- иногда читали  с детьми надписи на этикетках и вывесках  37% опрошенных, часто – 50%;
        <br/>{'     '}- иногда считали сдачу с детьми в магазине  37% родителей, часто- 29%;
        <br/>{'     '}- иногда рисовали  совместно с детьми   37% взрослых, часто – 59%;
        <br/>{'     '}- иногда  лепили совместно с детьми  47% респондентов, часто – 43%;
        <br/>{'     '}- иногда  играли в развивающие игры с детьми  40% родителей, часто – 59%;
        <br/>{'     '}- иногда занимались с детьми физической подготовкой  43% опрошенных, часто – 45%;
        <br/>{'     '}-  иногда разговаривали с детьми о школе 27% взрослых, часто – 72%.
        <br/>{'     '}Вызывает  обеспокоенность у педагогов первых классов нашего учреждения образования следующая информация:
        <br/>{'     '}- никогда пели песни детям 14%  взрослых (из них 35% - учащиеся 1А класса), т.е. эмоциональный контакт с ребенком налажен не у всех родителей;
        <br/>{'     '}- никогда не занимались развитием речи и формированием предпосылок чтения: 1% родителей никогда не читали книги детям (это 5% учащихся 1Б класса); 7% не играли в игрушки с алфавитом (это 24% учащихся 1Г класса); 10 % не играли в слова (из них 25% учащихся 1Б класса); 13% не читали надписи на этикетках и вывесках (из них 28% учащихся 1Г класса),  а это  тормозит овладение соответствующими умениями и навыками в первом классе;
        <br/>{'     '}- никогда не занимались формированием элементарных математических представлений: 8%  родителей не играли с детьми в игрушки со счетом (из них 20% учащихся 1Г класса); 34% не считали сдачу в магазине, что затрудняет усвоение учебного материала математического содержания;
        <br/>{'     '}- не занимались художественным творчеством, способствующим развитию мелкой моторики и служащей основой овладения письмом: 4 % родителей не рисовали с детьми (это15% учащихся 1Б класса);  10% не занимались лепкой;
        <br/>{'     '}- не занимались физическим развитием детей 12% родителей, из них 20% учащихся 1Б класса, что является одной из причин недостаточного уровня физической подготовленности детей и высокой заболеваемости.
        <br/>{'     '}На вопрос «Насколько хорошо Ваш ребенок умел делать следующее, когда шел в школу» родители ответили следующее:
        <br/><img src={'f_g_2016_11.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_12.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_13.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_14.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_15.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_16.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_17.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_18.png'} style={{width: width}}/>
        <br/><img src={'f_g_2016_19.png'} style={{width: width}}/>
        <br/>{'     '}Обобщив полученные данные из таблиц  5-8 и диаграмм 6-10, получилась такая картина:
        <br/>{'     '}- узнавать большинство букв алфавита к моменту поступления в школу очень хорошо умели 51% детей, из них 78% обучается в 1А классе и только 25% - в 1В классе;  совсем не умели – 4%, причем в 1А и 1Б классах таких детей нет;
        <br/>{'     '}- читать слова очень  хорошо умели 35% первоклассников, совершенно  не умели – 12%, из них 20% учатся в 1В классе;
        <br/>{'     '}- читать предложения очень хорошо умели 17% учащихся, вообще не умели – 16%;
        <br/>{'     '}- писать буквы алфавита очень  хорошо умели 19% детей, причем по ответам родителей таких учащихся 32% в 1Г классе, совсем не умели писать  - 6%;
        <br/>{'     '}- писать слова очень хорошо умели 12% первоклассников, совершенно не умели – 14%;
        <br/>{'     '}- узнавать большинство цифр очень  хорошо умели 48% учащихся, причем в 1А классе таких детей 88%, в 1В – только 15%; вообще не умели узнавать цифры 7%  детей из 1В  (15%) и 1Г (12%) классов;
        <br/>{'     '}- считать от 1 до 10 и обратно очень  хорошо умели 43% первоклассников,  совсем не умели – 10% (20% в 1В и 16% в 1Г классах);
        <br/>{'     '}- складывать и вычитать числа до 10 очень хорошо умели 18% учащихся, вообще не умели – 28%, из них 64% - учащиеся  1Г класса.
        <br/>{'     '}Полученная информация позволяет говорить о том, что большинство учащихся имеют  первичные умения в чтении, письме и математике. Вместе с тем,  4% первоклассников не знают буквы, 12% - не умеют читать слова, 7% - не знают цифры, 10% - не умеют считать в пределах 10 и 28% - не умеют выполнять арифметические действия в пределах 10. Учащиеся, освоившие не в полном объеме учебную программу дошкольного образования, нуждаются в индивидуальном подходе при организации образовательного процесса в школе. Этим ребятам потребуется больше времени на усвоение программного материала, полезными будут поддерживающие  занятия, сотрудничество педагогов с семьей и контроль результатов учебной деятельности со стороны  родителей.
        <br/>{'     '}На вопрос «Хотел ли ребенок учиться, когда шел в школу» получены такие ответы:
        <br/><img src={'f_g_2016_20.png'} style={{width: width}}/>
        <br/>{'     '}Из таблицы 9 и диаграммы 11 видно, что 66% первоклассников (из 88% - учащиеся 1Г класса) очень хотели учиться, 31% - хотели учиться. Таким образом, 97% детей имели позитивный настрой на обучение в школе, что служит прекрасным фундаментом  для формирования позиции школьника и успешного обучения. Вместе с тем, 3% детей  к школе были настроены негативно. По этой причине у этих детей будет более длительный процесс адаптации к школьной жизни, будет затруднено формирование учебной мотивации и достижение высоких учебных результатов.
        <br/>{'     '}На вопрос «Сколько приблизительно детских  книг у Вас дома» родители ответили следующее:
        <br/><img src={'f_g_2016_20.png'} style={{width: width}}/>
        <br/>{'     '}Данные, представленные в таблице 10 и диаграмме 12, позволяют сделать вывод о наличии  у большинства первоклассников   (92%)  книг в достаточном количестве, однако 8% учащихся (из них 15% - учащиеся 1В класса) имеют дома менее 10 книг, что явно недостаточно для формирования познавательного интереса и читательских умений. Данная информация может стать основой  индивидуальной работы с родителями.
        <br/>{'     '}Обобщив всю информацию, мы получили портрет первоклассника -2016 ГУО «Средняя школа №23 г.Гродно». Это ребенок, который:
        <br/>{'     '}- посещал детский сад;
        <br/>{'     '}- проходил подготовку к школе в учреждениях дошкольного и общего среднего образования;
        <br/>{'     '}- занимался дома с родителями: слушал чтение книг и различные истории, играли в слова, читали надписи на этикетках и вывесках, рисовали, играли в развивающие игры и разговаривали о школе;
        <br/>{'     '}- знает буквы, немного читает и пишет, знает цифры и считает до 10;
        <br/>{'     '}- хочет учиться.
        <br/>{'     '}Вместе с тем, обнаружены следующие проблемы:
        <br/>{'     '}- недостаточная информированность родителей о системе дошкольного образования;
        <br/>{'     '}- не все родители читают детям книги и имеют дома достаточное количество детских книг;
        <br/>{'     '}- игры в слова, игрушки с алфавитом и счетом знакомы не всем детям- детям чаще предлагается специально организованная деятельность, а не учеба в игровой и доступной форме;
        <br/>{'     '}- средства окружающего мира (вывески, надписи и т.д.) далеко не всегда выступают в дидактической роли для дошкольников;
        <br/>{'     '}- недостаточное внимание уделяется родителями физическому развитию детей;
        <br/>{'     '}- программным материалом дошкольного образования владеют далеко не все первоклассники;
        <br/>{'     '}- родители проявляют заинтересованность интеллектуальным развитием детей, при этом зачастую остаются в стороне от деятельности ребенка, не могут наладить эмоциональный контакт с маленькими детьми.
        <br/>{'     '}Полученные результаты можно использовать для проведения педагогических советов, психолого-педагогических консилиумов, круглых столов по вопросу преемственности в работе дошкольного и  I ступени общего среднего образования, родительских собраний, индивидуальных консультаций педагогов и родителей.
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent title={'Первоклассник – 2016  ГУО «Средняя школа №23 г.Гродно»'} data={data}/>
    );
  }
}

export default FirstGrader2016;
