import React from 'react';

import BaseTextComponent from '../shared/BaseTextComponent';

class FirstGraderParents extends React.Component {

  getData(){
    const width = '50%';
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Знакомясь с учащимися первых классов ГУО «Средняя школа №23 г.Гродно» в процессе учебной деятельности, анализируя данные, полученные в ходе анкетирования родителей (Приложение 1) в августе 2016 года (накануне учебного года), педагоги обратили внимание, что  не всегда результаты анкетирования  соответствуют педагогическим наблюдениям. Так возникла идея  сравнить   представления родителей о знаниях, умениях и навыках детей с  актуальным уровнем, выявленным посредством педагогической  диагностики с использованием методик «Буквы и картинки» «Слова и картинки», «Предложения и картинки», «Текст и картинки».
        <br/>{'     '}На вопрос анкеты  «Насколько хорошо Ваш ребенок умел делать следующее, когда шел в школу» количество совпадающих ответов родителей с диагностическими данными следующее:
        <br/><img src={'f_g_p_1.png'} style={{width: width}}/>
        <br/><img src={'f_g_p_2.png'} style={{width: width}}/>
        <br/><img src={'f_g_p_3.png'} style={{width: width}}/>
        <br/>{'     '}Приведенные в таблице1 и диаграмме1 данные говорят о том, что количество совпадений мнения родителей и результатов педагогического исследования по вопросам знания учащимися букв и умения читать слова достаточно высоко: 85% в 1Б классе и 70% в 1В классе; 80% в 1Б классе и 75% в 1В классе соответственно. Что же касается представлений о чтении предложений, текстов и понимания прочитанного, то в этих вопросах  наблюдаются существенные различия. Совпадения взглядов законных представителей несовершеннолетних и актуальных знаний находятся в пределах 50-55%% в 1Б классе и 70-60%% в 1В классе (таблица1, диаграмма1). Соответственно процент несовпадения подходов в оценке данных умений родителями и педагогами достигает 45-50%% в 1Б классе и 30-40%% в 1В классе (таблица2, диаграмма2). Полученные результаты вызывают тревогу, поскольку подобные разногласия являются основой непонимания в сфере взаимодействия «родитель-педагог» и служат фундаментом формирования конфликтных ситуаций.
        <br/>{'     '}Более детальный анализ полученных результатов обозначил и другую проблему. Выяснилось, что среди родителей-респондентов встречается немалое количество тех, кто преуменьшает знания своих детей. Если в 1В классе нами  выявлено от 13% до 50% родителей, недооценивающих своих детей, то в 1Б классе таких  родителей наблюдается от 50% до 67% (таблица 2, диаграмма2), что свидетельствует о завышенных ожиданиях родителей и неадекватной оценке детей. Такое ошибочное мнение родителей может трансформироваться в сознании детей и проявиться у них в виде заниженной самооценки, неуверенности   и повышенной тревожности. Наряду  с этим, нами отмечено и  немалое количество тех родителей, кто преувеличивает имеющиеся к началу школьного обучения знания своих детей. Если в 1Б классе нами  выявлено от 33% до 50%  таких родителей,  то в 1В классе количество таких  родителей  достигает  по различным вопросам 87% (таблица 2, диаграмма 2), что свидетельствует о завышенных представлениях родителей о знаниях своих детей. Подобные разногласия лежат в основе конфликтов между родителями и «необъективными» учителями.
        <br/>{'     '}Следовательно, полученная информация - основа индивидуальной работы педагогов и психологов с родителями и учащимися, групповых и индивидуальных занятий и тренингов, родительских собраний. Таким образом, в настоящий момент  весьма актуальным является вопрос педагогического просвещения родителей. При всем многообразии и разнообразии СМИ и других источников информации, уровень педагогических знаний у родителей остается недостаточным. В погоне за интеллектуальным развитием дошкольников, родители не уделяют должного внимания эмоционально-волевому развитию, забывают о необходимости тесного контакта и  доверительного общения со своими детьми, что служит источником психологических проблем у детей, а со временем – и учебных неудач.
        <br/>{'     '}Для легкой адаптации к школьной жизни и успешного овладения учебным материалом большое значение имеет и  сформированная учебная  мотивация. С целью исследования мотивации учения первоклассников педагогом-психологом школы использовалась соответствующая методика (Приложение 2). В результате диагностики были полученные следующие результаты:
        <br/><img src={'f_g_p_4.png'} style={{width: width}}/>
        <br/>{'     '}Полученные данные (таблица3, диаграмма3) свидетельствуют о том, что учебная мотивация сформирована только у 7,5% первоклассников, остальные дети пришли в школу с преобладающим игровым мотивом. Эту  информацию мы сравнили   с результатами опроса родителей. На вопрос «Хотел ли ребенок учиться, когда шел в школу» от родителей получены такие ответы:
        <br/><img src={'f_g_p_5.png'} style={{width: width}}/>
        <br/>{'     '}Из таблицы4 и диаграммы4 следует, что родители 55% первоклассников  считают, что их дети очень хотели учиться, 37,5% - хотели учиться. Таким образом,  по мнению родителей 92,5% детей эмоционально готовы к школьному  обучению и имеют  благоприятную основу для  успешной деятельности. Вместе с тем,  по утверждениям родителей 7,5% детей  к школе эмоционально не готовы, что затрудняет процесс адаптации к школьной жизни,  формирование учебной мотивации и достижение высоких учебных результатов. Очевидны несоответствия родительских представлений о желании детей идти в школу с определенными нами в ходе диагностики мотивами учения. В таблице5 и диаграммах5-7  представлены результаты сравнительного анализа родительских убеждений и объективной реальности:
        <br/><img src={'f_g_p_6.png'} style={{width: width}}/>
        <br/><img src={'f_g_p_7.png'} style={{width: width}}/>
        <br/><img src={'f_g_p_8.png'} style={{width: width}}/>
        <br/>{'     '}Так, из 92,5% детей, которые, по мнению  родителей, хотели идти в школу  истинно учебный мотив имеют только 7,5%. Большинство же первоклассников,  а именно 75%, к началу обучения в школе имеют учебно-игровой мотив.  Родители учащихся, имеющих  учебно-игровой мотив (диаграмма5),  в 86-93%% случаев отмечали, что дети хотели идти  в школу, при этом причину такого желания не уточняли. Зачастую, причины  желания стать школьником бывают внешние: взросление, новый статус, приобретение школьных принадлежностей и т.д. Одновременно с этим,  следует все-таки обратить внимание на наличие у  подавляющего числа детей желания идти в школу, т.е. будущие школьники на учебу настроены позитивно и школу не отвергают. Это является психологической основой для формирования позиции школьника с ее многоуровннвой структурой и разнообразными социальными связями. От 7% до 14% родителей учащихся из этой группы (диаграмма5) указали на определенное нежелание  детей идти в школу, что свидетельствует о некоторой неготовности этих ребят к школе. Таких первоклассников необходимо держать на особом контроле как педагогам, так и родителям; необходимо выработать единую тактику всем участникам образовательного процесса во взаимодействии с этими учащимися.
        <br/>{'     '}Родители первоклассников со сформированным учебным мотивом (диаграмма6) единогласно отмечают наличие  у детей желания к обучению  в школе.
        <br/>{'     '}Родители всех первоклассников с преобладающим игровым мотивом (диаграмма7) отмечают у своих детей  наличие желания посещать школу, что при правильно организованной работе позволит ребятам легко адаптироваться в новой среде и быть успешными в учебе.
        <br/>{'     '}Полученная нами  информация может быть  использована педагогами при  планировании работы  с учащимися и родителями:
        <br/>{'     '}-	в работе с первоклассниками приорететными должны стать игровые методы и приемы;
        <br/>{'     '}-	 в работе с родителями больше внимания уделять ознакомлению с возрастными  особенностями первоклассников, с условиями формирования у детей познавательной активности и учебной мотивации, являющейся залогом успешности в школе;
        <br/>{'     '}-	 в процессе коллективной работы с родителями (собрания, заседания клуба «Семья», лектории, конференции) актуализировать значимость и ценность позитивных и доверительных родительско-детских отношений как важнейшего условия становления личности ребенка;
        <br/>{'     '}-	 активно привлекать психологов дошкольных учреждений и школы к индивидуальной и групповой работе с родителями с целью формирования у них представления об этапах развития детей и роли родителей в этом процессе, для формирования объективных представлений о собственных детях.
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent title={'Первоклассник: взгляд родителей и педагогов'} data={data}/>
    );
  }
}

export default FirstGraderParents;
