import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

import {LEANING_TO_SCULPT} from '../../../constants/constants';

const BACK_LINK = LEANING_TO_SCULPT;

class Smeshariki extends React.Component {

  getData(){
    const width = '50%';
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Совунья из пластилина
        <br/>{'     '}1.	Возьмите фиолетовый пластилин, сделайте из него шарик — это будет основа нашей фигурки
        <br/>{'     '}2.	Слепите треугольные ушки и прилепите их к шарику
        <br/>{'     '}3.	Сплюсните два маленьких белых шарика для глаз, сделайте над ними веки «козырьком». Зрачки можно сделать из маленьких кусочков черного пластилина, из черного бисера или перца горошком
        <br/>{'     '}4.	Теперь возьмите оранжевый или красный кусочек пластилина и слепите из него конус — это будет клюв. Придавите его как показано на картинке, чтобы клювик был приоткрытый и закрепите его под глазками
        <br/>{'     '}5.	Из колбасок черного цвета сделайте лапки и прилепите их к фигурке
        <br/>{'     '}6.	Слепите крылышки для Совуньи, продавите на них полосочки, имитируя оперение
        <br/>{'     '}7.	Закончите образ, сделав шапочку с бубоном из раздавленных лепешек красного и оранжевого цвета
        <br/><img src={'mold_smeshariki_1.png'} style={{width: width}}/>
        <br/>{'     '}Бараш из пластилина
        <br/>{'     '}1.	Возьмите пластилин розового цвета и скатайте из него шарик-основу нашей фигурки
        <br/>{'     '}2.	Для имитации шерсти сделайте несколько розовых маленьких шариков и прилепите в телу
        <br/>{'     '}3.	Сделайте ушки, ножки и ручки для Бараша из колбасок розового цвета
        <br/>{'     '}4.	Глаза слепите также как и для Совуньи
        <br/>{'     '}5.	Используйте коричневый пластилин, чтобы слепить рожки, добавьте его также на лапки нашей фигурки и не забудьте про бровки
        <br/>{'     '}6.	Ротик сделайте из тоненьких полосочек красного цвета
        <br/><img src={'mold_smeshariki_2.png'} style={{width: width}}/>
        <br/>{'     '}Ежик из пластилина
        <br/>{'     '}1.	Из красного пластилина скатайте основу для фигурки
        <br/>{'     '}2.	Половину шарика залепите черными, немного сплюснутыми, конусами из пластилина, которые будут иголочками
        <br/>{'     '}3.	Слепите глаза и добавьте к ним черные очки, присоедините их к основе
        <br/>{'     '}4.	Добавьте лапки и ушки из красных колбасок разного размера
        <br/>{'     '}5.	Не забудьте про носик и ротик
        <br/><img src={'mold_smeshariki_3.png'} style={{width: width}}/>
        <br/>{'     '}Лосяш из пластилина
        <br/>{'     '}1.	Скатайте шарик-основу желтого цвета
        <br/>{'     '}2.	Добавьте ему глазки и веки как у Совуньи
        <br/>{'     '}3.	Слепите большой нос из сплюснутого конуса и бровки из тоненьких колбасок коричневого цвета
        <br/>{'     '}4.	Сделайте лапки, как показано на картинке
        <br/>{'     '}5.	Осталось добавить ему рожки, которые легко сделать из коричневых пластилиновых колбасок
        <br/><img src={'mold_smeshariki_4.png'} style={{width: width}}/>
        <br/>{'     '}Кроша из пластилина
        <br/>{'     '}1.	Основой будет пластилиновый шарик голубого цвета, если вы найдете или смешаете самостоятельно пластилин бирюзового цвета, будет просто замечательно
        <br/>{'     '}2.	Слепите ему глазки как и у других персонажей, и добавьте носик из красного шарика прямо под ними
        <br/>{'     '}3.	Из пластилина основного цвета сделайте большие ушки и лапки для Кроши
        <br/>{'     '}4.	Теперь делаем улыбку: стекой или ножом для пластилина нужно сделать надрез в том месте, где у него будет ротик, и раздвинуть пластилин, вовнутрь добавить красную колбаску, а сверху нее налепить два белых зубика
        <br/><img src={'mold_smeshariki_5.png'} style={{width: width}}/>
        <br/>{'     '}Нюша из пластилина
        <br/>{'     '}1.	Нюша у нас будет розового цвета, слепите для нее розовый шарик.
        <br/>{'     '}2.	Сделайте ей глазки обычным способом
        <br/>{'     '}3.	Из красного сплюснутого шарика сделайте носик, продавите на нем две дырочки
        <br/><img src={'mold_smeshariki_6.png'} style={{width: width}}/>
        <br/>{'     '}4.	Слепите из тоненьких колбасок красного цвета бровки и реснички для Нюши как показано на рисунке
        <br/>{'     '}5.	Сзади к основе прилепите две красные лепешки, на них посредине четыре немного сплюснутых шарика, это будет косичка. Сделайте к ней хвостик как показано на рисунке и присоедините его к косичке
        <br/>{'     '}6.	Украсьте хвостик цветочком из белого пластилина
        <br/>{'     '}7.	Лапки сделайте из колбасок розового цвета и добавьте на их
        <br/><img src={'mold_smeshariki_7.png'} style={{width: width}}/>
        <br/>{'     '}Пин из пластилина
        <br/>{'     '}1.	Основа этой фигурки будет из черного пластилина. Слепите шарик
        <br/>{'     '}2.	Сделайте животик из лепешки белого пластилина
        <br/>{'     '}3.	Добавьте глаза из белого и черного пластилина
        <br/>{'     '}4.	Сразу под глазами прилепите клюв, сделайте его из конуса красного цвета, нужно приплюснуть его слегка и продавить ножом, раскрывая клювик
        <br/>{'     '}5.	Из кусочка коричневого пластилина слепите шляпу для Пина, добавьте на нее голубые шарики, имитируя стекла очков
        <br/>{'     '}6.	Слепите красные лапки и черные крылышки для нашей фигурки
        <br/><img src={'mold_smeshariki_8.png'} style={{width: width}}/>
        <br/>{'     '}Источник: http://heaclub.ru/poetapnaya-lepka-dlya-detej-podelki-iz-plastilina-lepim-edu-zhivotnyh-igrushki#i-13
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Как лепить из пластилина смешариков?'} backLink={BACK_LINK}/>
    );
  }
}

export default Smeshariki;
