import React from 'react';

import BaseTextComponent from '../shared/BaseTextComponent';

class Counters extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Раз, два, тры, чатыры,
        <br/>{'     '}Пяць, шэсць, сем, восем,
        <br/>{'     '}Выйшла баба з доўгім носам,
        <br/>{'     '}А за бабай сівы дзед,
        <br/>{'     '}Колькі дзеду таму лет?
        <br/>{'     '}***
        <br/>{'     '}Раз, два - рукава,
        <br/>{'     '}Тры, чатыры - нос ў чарніле,
        <br/>{'     '}Пяць, шэсць - кашу есць,
        <br/>{'     '}Сем, восем - сена косім,
        <br/>{'     '}Дзевяць, дзесяць - Мішу просім.
        <br/>{'     '}***
        <br/>{'     '}Раз, два – кружава,
        <br/>{'     '}Тры, чатыры – пачапiлi,
        <br/>{'     '}Пяць, шэсць – кашу есць,
        <br/>{'     '}Сем, восем – сена косім,
        <br/>{'     '}Дзевяць, дзесяць – грошы весiць.
        <br/>{'     '}Грош згубiлi, два знайшлi –
        <br/>{'     '}У карчму усе пайшлi:
        <br/>{'     '}Чай п'юць, кружкi б'юць,
        <br/>{'     '}На стол грошыкi кладуць.
        <br/>{'     '}***
        <br/>{'     '}Раз, два - булдава,
        <br/>{'     '}Тры, чатыры - пачапiлi,
        <br/>{'     '}Пяць, шэсць - недзе сесць,
        <br/>{'     '}Сем, восем - сена косім,
        <br/>{'     '}Дзевяць, дзесяць - сена весiць.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры,
        <br/>{'     '}Кошку грамаце вучылі:
        <br/>{'     '}Не чытаць, не пісаць,
        <br/>{'     '}А за мышкамі скакаць.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры,
        <br/>{'     '}Мяне грамаце вучылі:
        <br/>{'     '}Не чытаць, не пісаць,
        <br/>{'     '}Толькі ў поплясы скакаць.
        <br/>{'     '}Я скакала, я скакала,
        <br/>{'     '}Сабе ножку я зламала.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры,
        <br/>{'     '}Мы стаялі на кватэры,
        <br/>{'     '}Чай пілі, кружкі білі,
        <br/>{'     '}Па капейцы заплацілі.
        <br/>{'     '}Адам, Сцяпан, падай стакан!
        <br/>{'     '}Падай лімон - убірайся вон!
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Выйшау зайчык пагуляць,
        <br/>{'     '}А за зайцам – шэры воўк,
        <br/>{'     '}Воўк у зайцах знае толк.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Выйшау зайчык пагуляць,
        <br/>{'     '}А за зайчыкам луна,
        <br/>{'     '}Просіць выйсці калдуна.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Выйшау зайчык пагуляць,
        <br/>{'     '}Трох ахотнічкаў напала,
        <br/>{'     '}Майго зайчыка злапала.
        <br/>{'     '}Піф - паф, о - ё - ёй,
        <br/>{'     '}Памірае зайчык мой.
        <br/>{'     '}Прыняслі яго дамой,
        <br/>{'     '}Паглядзелі - ён жывой.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры,
        <br/>{'     '}Пяць, шэсць, сем, восем,
        <br/>{'     '}Мы цябе, стукач, папросім.
        <br/>{'     '}
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Выйшаў месяц пагуляць,
        <br/>{'     '}А за месяцам луна –
        <br/>{'     '}Аставайся ты адна.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Шэсць, сем, восем, дзевяць, дзесяць,
        <br/>{'     '}Выплыў белы месяц,
        <br/>{'     '}А за месяцам луна,
        <br/>{'     '}Хлопчык дзеўчыны слуга.
        <br/>{'     '}- Ты, слуга, падай карэту,
        <br/>{'     '}А я сяду і паеду.
        <br/>{'     '}Ты, слуга, падай лімон,
        <br/>{'     '}А я свсіну, а ты вон!
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Шэсць, сем, восем, дзевяць, дзесяць,
        <br/>{'     '}Выплывае белы месяц,
        <br/>{'     '}А за месяцам луна,
        <br/>{'     '}Выйшла дзевіца - слуга.
        <br/>{'     '}- Ты, слуга, падай карэту,
        <br/>{'     '}А я сяду і паеду,
        <br/>{'     '}Ты, слуга, падай мятлу,
        <br/>{'     '}А я хату падмяту.
        <br/>{'     '}***
        <br/>{'     '}Раз, два, тры, чатыры, пяць,
        <br/>{'     '}Шэсць, сем, восем, дзевяць, дзесяць,
        <br/>{'     '}Цар вялеў мяне павесіць.
        <br/>{'     '}А  нядоўга я вісеў:
        <br/>{'     '}Вецер дунуў - я зляцеў.
        <br/>{'     '}***
        <br/>{'     '}Сем семярэй
        <br/>{'     '}І сямёра свіней.
        <br/>{'     '}Свінка і свінчин брат
        <br/>{'     '}І сямёра парасят.
        <br/>{'     '}***
        <br/>{'     '}Бег сабачка цераз мост,
        <br/>{'     '}Чатыры лапы, пяты – хвост.
        <br/>{'     '}***
        <br/>{'     '}Я сядзеў, чытаў газету,
        <br/>{'     '}Нехта выпусціў ракету.
        <br/>{'     '}Раз, два, тры –
        <br/>{'     '}Гэта, верна, будзеш ты.
        <br/>{'     '}***
        <br/>{'     '}Чыкенчыкі, пікенчыкі,
        <br/>{'     '}Ляцелі галубенчыкі.
        <br/>{'     '}Чыкін, пікін,
        <br/>{'     '}Пальчык выкінь.
        <br/>{'     '}***
        <br/>{'     '}Кацілася яблычка па агароду
        <br/>{'     '}І упала прама ў воду.
        <br/>{'     '}Бульк!
        <br/>{'     '}***
        <br/>{'     '}Ішла кошка па раялі,
        <br/>{'     '}Наступіла на педалі
        <br/>{'     '}І запела: - До, рэ, мі,
        <br/>{'     '}Фа, соль, ля, сі,
        <br/>{'     '}Крыніца:  Ходзіць жораў па таку /  Склад. Г.А. Барташэвіч. – Мн.: Навука і тэхніка, 1993.-64с.

      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Лічылкі'}/>
    );
  }
}

export default Counters;
