import React from 'react';

import BaseTextComponent from '../shared/BaseTextComponent';

class TongueTwistersBel extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}1.	Белы бусел баіў байку беламу зайку.
        <br/>{'     '}2.	Боб ды боб — два бабы, а яшчэ боб — тры бабы.
        <br/>{'     '}3.	Вадавоз вёз ваду ад вадаправода.
        <br/>{'     '}4.	На двары стары баран грукаў зранку ў барабан.
        <br/>{'     '}5.	Добра ўсюды добраму. Добраму ўсюды добра.
        <br/>{'     '}6.	Дудар дудару дарма грае.
        <br/>{'     '}7.	Лаўрэн лавіў рыбу, Лара варыла рыбу з лаўровым лістом.
        <br/>{'     '}8.	I Піліп да ліпы прыліп. Да ліпы прыліп і Піліп.
        <br/>{'     '}9.	Твая маці і мая маці пяклі булкі ў адной хаце.
        <br/>{'     '}10.	Патап пакаваў пакупнікам пакупкі ў пакункі.
        <br/>{'     '}11.	Пракоп і Барыска елі барбарыскі.
        <br/>{'     '}12.	Пароль — «Арол».
        <br/>{'     '}13.	Рабая курка клюе крупкі.
        <br/>{'     '}14.	Рыбак Рыгор рыбачыў на рацэ.
        <br/>{'     '}15.	Ткач ткаў хустку на таху і хукаў на руку.
        <br/>{'     '}16.	Скача чапля па балоце, чачотачка ў чароце,
        <br/>{'     '}А чубаты чачот топча, топча агарод.
        <br/>{'     '}17.	Раз прывёз Рыгор Цімоху мех арэхаў, мех гароху.
        <br/>{'     '}18.	Маша шыла шапку Сашу. Шапку Сашу шыла Маша.
        <br/>{'     '}19.	Саша на шашы, смокчучы сушку, шагам шпарка шпарыла.
        <br/>{'     '}20.	Смешкі кошцы, слёзкі мышцы.
        <br/>{'     '}21.	Гаварыў, гаварыў, не дагаварыў,
        <br/>{'     '}дагаварыў, дагаворваў, ды загаварыўся.
        <br/>{'     '}22.	Каласы каласавалі, каласавалі, выкаласавалі.
        <br/>{'     '}23.	Калясо выкалесілася,
        <br/>{'     '}жалеза выжалезілася,
        <br/>{'     '}палукашак выпалукашыкаваўся,
        <br/>{'     '}агонь выагняваўся.
        <br/>{'     '}24.	Рапартаваў, рапартаваў,
        <br/>{'     '}ды не дарапартаваў,
        <br/>{'     '}стаў дарапартоўваць,
        <br/>{'     '}ды зарапартаваўся.
        <br/>{'     '}25.	Стругаў, стругаў, не дастругаў,
        <br/>{'     '}стаў дастругваць — перастругаў.
        <br/>{'     '}26.	Тры чарты карчавалі карчы,
        <br/>{'     '}карчавалі,
        <br/>{'     '}выкарчоўвалі,
        <br/>{'     '}панавыкарчоўваліся.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Скорагаворкі'}/>
    );
  }
}

export default TongueTwistersBel;
