import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class HyperactiveChild extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Все дети разные, но все они нуждаются в нашей любви, заботе, ласке. И все они достойны этого: и тихони, и забияки, и задиры, и шалуны.
        <br/>{'     '}Нередко ребёнок не может долго сидеть на одном месте, он суетлив, чрезмерно говорлив, капризен, раздражает своим поведением. И такому ребёнку навешивают ярлыки: “невоспитанный”, “избалованный”, “хулиган”. Но на самом деле это ни первое, ни второе, ни третье. Ребёнок с такой психоактивной конституцией скорее всего относится к категории гиперактивных детей. Первая часть этого сложного слова “гипер” (от греч huper — над, сверх) означает ‘превышающий какую-либо норму, сверх чего-то’.
        <br/>{'     '}
        <br/>{'     '}<b>Причины гиперактивности у детей</b>
        <br/>{'     '}Среди учёных нет единого мнения о причинах возникновения гиперактивности. Одни связывают гиперактивное поведение с наличием у детей так называемых минимальных мозговых дисфункций, т. е. врождённого неравномерного развития отдельных мозговых функций.
        <br/>{'     '}Другие объясняют явление гиперактивности последствиями ранних органических поражений головного мозга, вызванных патологией беременности, осложнениями при родах, употреблением алкоголя, курением родителей и т. п.
        <br/>{'     '}Третья категория учёных утверждает, что в настоящее время гиперактивность детей не всегда связана с патологией. Они объясняют некоторые особенности нервной системы таких детей следствием неудовлетворительного воспитания и жизненных условий, в которых находятся дети, и считают, что это только фон, облегчающий формирование гиперактивности как способа реагирования детей на неблагоприятные условия.
        <br/>{'     '}<b>Симптомы гиперактивности</b>
        <br/>{'     '}Наиболее ярко гиперактивность проявляется у детей в старшем дошкольном и младшем школьном возрасте. В этот период происходит переход к ведущей (учебной) деятельности, в связи с чем увеличиваются интеллектуальные нагрузки: от детей требуются умения концентрировать внимание на более длительном отрезке времени, доводить начатое дело до конца, добиваться определённого результата. Именно в условиях длительной и систематической деятельности гиперактивность заявляет о себе очень убедительно. Родители вдруг обнаруживают многочисленные негативные последствия неусидчивости, неорганизованности, чрезмерной подвижности своего ребёнка и, обеспокоенные этим, ищут контактов с психологом.
        <br/>{'     '}
        <br/>{'     '}<b>Психологи выделяют следующие признаки, которые выступают диагностическими симптомами гиперактивных детей:</b>
        <br/>{'     '}•	Моторное беспокойство. Сидя на стуле ребёнок вертится, ёрзает, не может спокойно сидеть на месте, когда этого от него требуют.
        <br/>{'     '}•	Легко отвлекается на посторонние стимулы.
        <br/>{'     '}•	С трудом дожидается своей очереди во время игр и в различных ситуациях в коллективе (на занятиях, во время экскурсий и праздников).
        <br/>{'     '}•	На вопросы часто отвечает не задумываясь, не дослушав до конца.
        <br/>{'     '}•	С трудом сохраняет внимание при выполнении заданий или во время игр.
        <br/>{'     '}•	Часто переходит от одного незавершённого действия к другому.
        <br/>{'     '}•	Не может играть тихо, спокойно.
        <br/>{'     '}•	Болтлив.
        <br/>{'     '}•	Нередко мешает другим, пристаёт к окружающим (например, вмешивается в игры других детей).
        <br/>{'     '}•	Создаёт впечатление, что не слушает обращённую к нему речь.
        <br/>{'     '}•	Часто теряет вещи.
        <br/>{'     '}•	Иногда совершает опасные действия, не задумываясь о последствиях (например, выбегает на проезжую часть, не оглядываясь по сторонам).
        <br/>{'     '}<b>Все эти признаки можно сгруппировать по следующим направлениям:</b>
        <br/>{'     '}•	Чрезмерная двигательная активность.
        <br/>{'     '}•	Импульсивность.
        <br/>{'     '}•	Дефицит активного внимания (отвлекаемость — невнимательность).
        <br/>{'     '}•	Нарушения в эмоциональной сфере.
        <br/>{'     '}Чрезвычайно важное значение для понимания природы гиперактивного поведения детей и для коррекции отдельных её проявлений имеют разнообразные симптомы и нарушения эмоциональной сферы.
        <br/>{'     '}Эти дети повышенно возбудимы, для них характерны смена настроений, чувство страха, проявление тревожности, негативизма.
        <br/>{'     '}
        <br/>{'     '}<b>Как помочь гиперативному ребёнку в коллективе</b>
        <br/>{'     '}Появление одного или нескольких гиперактивных детей в группе детского сада или классе с первых же минут осложняет жизнь всего коллектива. Поэтому эффективность работы воспитателя и учителя будет во многом зависеть от выбранной ими стратегии.
        <br/>{'     '}<b>Можно выделить несколько этапов этой работы:</b>
        <br/>{'     '}1. выявление гиперактивных детей в группе;
        <br/>{'     '}2. совместная встреча для переговоров воспитателя детского сада или учителя школы, родителей таких детей и обязательно психолога или  психотерапевта;
        <br/>{'     '}3. выработка единой стратегии воспитания ребёнка, коррекционной программы.
        <br/>{'     '}В методах работы с гиперактивными детьми и  воспитатели, и учителя, и родители должны быть едины; хорошо, когда коррекционная работа проводится совместно с психологом или психотерапевтом, который выполняет координирующую функцию, также проводит занятия с ребёнком, чаще групповые, в условиях медицинского учреждения.
        <br/>{'     '}Пытаясь помочь гиперактивному ребёнку, нельзя спешить и воздействовать сразу на все стороны его жизни.
        <br/>{'     '}Желательно обеспечить постепенную тренировку только одной какой-либо функции, например воспитания усидчивости, внимания или трудолюбия.
        <br/>{'     '}Всегда надо помнить, что процесс улучшения состояния ребёнка занимает длительное время, а результат виден не сразу.
        <br/>{'     '}
        <br/>{'     '}<b>Рекомендации родителям гиперактивный детей.</b>
        <br/>{'     '}Самое важное и порой самое трудное — изменение отношения родственников и прежде всего родителей к ребёнку, с тем чтобы лучше его понять и снять излишнее напряжение, формирующееся вокруг него.
        <br/>{'     '}Родители должны осознать, что улучшение состояния ребёнка зависит не только от специального лечения (если таковое рекомендуется), но в значительной мере от доброго, спокойного и последовательного отношения к нему.
        <br/>{'     '}
        <br/>{'     '}<b>При воспитании гиперактивного ребёнка родители (и другие близкие) должны избегать двух крайностей:</b>
        <br/>{'     '}•	проявления чрезмерной жалости и вседозволенности;
        <br/>{'     '}•	 завышенных требований, которые он не в состоянии выполнить, в сочетании с излишней пунктуальностью, жесткостью и санкциями (наказаниями).
        <br/>{'     '}<b>Систему взаимоотношений взрослых и гиперактивного ребёнка можно свести к нескольким направлениям и рекомендациям:</b>
        <br/>{'     '}- Старайтесь по возможности сдерживать свои бурные аффекты (кратковременные сильные нервные возбуждения), особенно если вы огорчены или не довольны поведением ребёнка.
        <br/>{'     '}- Эмоционально поддерживайте детей во всех попытках конструктивного, позитивного поведения, какими бы незначительными они ни были.
        <br/>{'     '}- Воспитывайте в себе интерес к тому, чтобы глубже познать и понять ребёнка.
        <br/>{'     '}- Избегайте категоричных слов и выражений, жёстких оценок, упрёков, угроз, которые могут создать напряжённую обстановку и вызвать конфликт в семье.
        <br/>{'     '}- Реже говорите “нет”, “нельзя”, “прекрати” — лучше попробуйте переключить внимание малыша.
        <br/>{'     '}- Следите за своей речью, говорите спокойным голосом. Гнев, возмущение плохо поддаются контролю.
        <br/>{'     '}- Выражая недовольство, не манипулируйте чувствами ребёнка и не унижайте его.
        <br/>{'     '}- Если есть возможность, постарайтесь выделить для ребёнка комнату или её часть для занятий, игр, уединения (т. е. его собственную территорию.) В оформлении желательно избегать ярких цветов, сложных композиций. На столе не должно быть отвлекающих предметов.
        <br/>{'     '}- Организация всей жизни должна действовать на ребёнка успокаивающе. Для этого вместе с ним составьте распорядок дня, следуя которому проявляйте одновременно гибкость и упорство.
        <br/>{'     '}- Определите для ребёнка круг обязанностей, а их исполнение держите под постоянным наблюдением, но не слишком жёстко.
        <br/>{'     '}- Чаще отмечайте и хвалите его усилия, даже если результаты далеки от совершенства.
        <br/>{'     '}- Больше играйте с ребёнком: игра близка и понятна ему.
        <br/>{'     '}- Используйте эмоциональное воздействие, содержащееся в интонации, мимике, жестах, форме реагирования на действия ребёнка, это доставит вам обоим огромное удовольствие.
        <br/>{'     '}<b>И самое главное для родителей — быть последовательными в воспитании и терпеливыми.</b>
        <br/>{'     '}Принимайте и любите своих детей такими, какие они есть, и ваши дети не замедлят порадовать вас!
        <br/>{'     '}
        <br/>{'     '}И. Н. НАСЕВИЧ, психолог// Рюкзачок для пап и мам. – 2009. - №1 . – с.6-8
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    return (
      <BaseTextComponent title={'Гиперактивный ребенок'} data={data} epigraph={epigraph}/>
    );
  }
}

export default HyperactiveChild;
