import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class DQuestions extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}<b>Гэтыя пытанні дапамагаюць навучыцца,  як дзяліцца думкамі; гутарыць, як дарослыя;  слухаць субяседніка, гаварыць з iм.</b>
        <br/>{'     '}Цi добра быць здаровым? Чаму?
        <br/>{'     '}Ці добра мець сяброў, якія старэйшыя за цябе? Чаму?
        <br/>{'     '}Ці добра пазычыць што-небудзь i не аддаць?
        <br/>{'     '}Ці добра быць эгаістычным, думаць толькі пра сябе?
        <br/>{'     '}Цi добра ведаць шмат казак, вершаў, прыказак? Чаму?
        <br/>{'     '}Цi трэба дапамагаць дарослым? Чаму?
        <br/>{'     '}Ці прыемна табе, калі ты каго-небудзь пакрыўдзіў?
        <br/>{'     '}Ці прыемна, як дождж капае на галаву?
        <br/>{'     '}Ці трэба сябраваць з кніжкамі? Што гэта значыць «сябраваць з кніжкай»?
        <br/>{'     '}Цi трэба паважаць працу дарослых? Чаму?
        <br/>{'     '}Ці трэба дапамагаць слабым? Чаму?
        <br/>{'     '}Цi трэба хлопчыкам заступацца за дзяўчынак?
        <br/>{'     '}Чаму трэба працаваць (дапамагаць бацькам)?
        <br/>{'     '}Калі гавораць: «Хлеб-соль»? Каму? Чаму? Замест «хлеб-соль» як яшчэ можна сказаць?
        <br/>{'     '}Як ты папросіш ластаўку хлеба?
        <br/>{'     '}Што ты скажаш, калі табе дапамогуць у чым-небудзь? Чаму трэба дзякаваць?
        <br/>{'     '}Як ты папросіш, каб табе дапамаглі?
        <br/>{'     '}Каго мы называем сябрам?
        <br/>{'     '}Калі твой сябар просіць табе зрабіць нешта дрэннае, ці паслухаеш ты яго?
        <br/>{'     '}Калі мы npociм прабачэння? Як мы гэта poбім? А чаму трэба прасіць   прабачэння?
        <br/>{'     '}Чаму нельга крыўдзіць дзяўчьнку? Бабульку? Маму? Таварыша? А каго можна  крыўдзіць? (Каго нельга крыўдзіць.)?
        <br/>{'     '}Чаму трэба быць здаровым? Што трэба рабіць, каб быць здаровым?
        <br/>{'     '}Чаму ставяць помнікі? Каму ставяць помнік? Якія помнікі ты ведаеш у сваім горадзе?
        <br/>{'     '}Чаму трэба мець сяброў?
        <br/>{'     '}Чаму нельга кідаць смецце на вуліцы, у лесе, у парку? А дзе трэба кідаць тое, што табе непатрэбна?
        <br/>{'     '}Чаму нельга хадзіць па газонах?
        <br/>{'     '}Чаму нельга ламаць дрэвы?
        <br/>{'     '}Чаму трэба старэйшым уступаць месца? Каму лягчэй стаяць: малому цi старому?
        <br/>{'     '}Якія бываюць хлопчыкі i дзяўчаты? Якія табе падабаюцца? Сціплыя? Смелыя? Добрыя? Скупыя? Далікатныя? Ветлівыя? Вясёлыя?
        <br/>{'     '}Якое слова табе больш падабаецца: «дай» ці «на»? Чаму?
        <br/>{'     '}Як ты паводзіш сябе, калі сварацца ці б'юцца твае сябры?
        <br/>{'     '}Што табе больш падабаецца: быць i гуляць разам са сваей мамай, татам? Быць i гуляць разам са cваiмі сябрамі, тaкімі ж хлопчыкамі i дзяўчьнкамі, як ты сам? Гуляць сам з сабою? Глядзець мульцікі па тэлевізару? Чаму?
        <br/>{'     '}Ці прыемна твайму тату, калі ты пакрыўдзіш маму, бабулю?
        <br/>{'     '}Калі ты ўбачыш, што большы хлопчык крыўдзіць (б'е, nixae, aдбipae цацку) меншую дзяучынку, што ты зробіш?
        <br/>{'     '}Каго мы павінны слухацца? Ці заўсёды дарослых трэба слухацца? А калі дарослы дрэнны чалавек? Калі ён вучыць рабіць нешта кепскае?
        <br/>{'     '}Чаму дзеці любяць цырк (тэатр)?
        <br/>{'     '}За што мы  любім тату i маму, бабулю i дзядулю?
        <br/>{'     '}Што нам дае сонца? Ці толькі цяпло?
        <br/>{'     '}Што лягчэй: зламаць ці зрабіць?
        <br/>{'     '}Каму трэба дапамагаць? Калі i чаму?
        <br/>{'     '}Чаму прыемна глядзець на чалавека, калі ён усміхаецца?
        <br/>{'     '}Твая мама шчаслівая, калі ты плачаш, ці тады, калі ты ўсмехаешся? Чаму?
        <br/>{'     '}Чаму трэба, каб у хаце было чыста i ўтульна? Чаму трэба, каб дзіцячыя цацкі ляжалі ў парадачку?
        <br/>{'     '}У дзціяці няма грошай купіць маме (тату, бабулі, дзядулю) падарунак. Які падарунак дзіця можа зрабіць  сам?
        <br/>{'     '}Як вы думаеце, які падарунак больш прыемна атрымаць: куплены ці зроблены рукам?
        <br/>{'     '}Дзе бяруць людзі грошы? Навошта патрэбна праца? Ці можа чалавек жыць без працы?
        <br/>{'     '}Як ты паступіш у наступных сітуацыях:
        <br/>{'     '}1. Ты хочаш пагуляць з мамай, але яна варыць есці. Што ты будзеш рабіць:
        <br/>{'     '}а) прымусіш яекінуць варыць i пайсці з табой зараз жа гуляць;
        <br/>{'     '}б)пачакаеш, пакуль яна зварыць ежу, а тады папросіш
        <br/>{'     '}яе пагуляць з табою?
        <br/>{'     '}2.	Незнаемая дзяўчынка нясе ў сумачцы бульбу. Раптам дзяўчынка упала, i бульба рассьшалася. Дзяўчынка запла¬кала. Што ты зробіш:
        <br/>{'     '}а)дапаможаш ей сабраць бульбу;
        <br/>{'     '}б)супакоіш яе, каб яна не плакала, i параіш сабраць бульбу;
        <br/>{'     '}в) пасмяешся з яе: «Эх ты, няўмека-недарэка!»?
        <br/>{'     '}Што ты больш любіш: лес з ягадамі, грыбамі,  дрэвамі ці бібліятэку, у якой багата самых розных кніг з казкамі, малюнкамі?

        <br/>{'     '}Крыніца: Марціновіч Л.С., Юрэвіч Т.У., Іўліева Л.У. Сцяжынка. – Мн.: Нар.асвета, 1994. – 319с.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Дыскусійныя пытанні'}/>
    );
  }
}

export default DQuestions;
