import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class ThematicIssues extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Дзе расце бульба?
        <br/>{'     '}Што робяць з бульбы?
        <br/>{'     '}Ці ведаеш ты беларускую песню «Бульба»?
        <br/>{'     '}У чым можна зварыць бульбу?
        <br/>{'     '}Што трэба мець, каб на агародзе накапаць бульбы? Рыдлёўку? Вядзёрка?
        <br/>{'     '}Што трэба мець, каб засмажыць бульбу?
        <br/>{'     '}Якой формы бульба?
        <br/>{'     '}Якога колеру бульба?
        <br/>{'     '}Якую страву з бульбы ты любіш?
        <br/>{'     '}Чым славіцца Беларусь: мандарынамі, кукурузай, бана¬намі ці бульбай?
        <br/>{'     '}Дзе расце жыта?
        <br/>{'     '}Хто сее жыта?
        <br/>{'     '}Чым жыта жнуць?
        <br/>{'     '}3 чаго пякуць хлеб?
        <br/>{'     '}Як называецца той, хто пячэ хлеб у пякарні?
        <br/>{'     '}Дзе можна узяць бохан хлеба?
        <br/>{'     '}Як ты nanpociш  у магазіне прадаць табе бохан хлеба?
        <br/>{'     '}Ці ведаеш ты, колькі каштуе бохан хлеба?
        <br/>{'     '}Колькі месяцаў у годзе?
        <br/>{'     '}Які першы месяц года?
        <br/>{'     '}У студзені цёпла ці сцюдзёна (холадна)?
        <br/>{'     '}Колькі пораў года?
        <br/>{'     '}Якую пару года ты больш любіш?
        <br/>{'     '}Летам холадна ці цёпла?
        <br/>{'     '}Калі ідуць дажджы?
        <br/>{'     '}Калі растае снег?
        <br/>{'     '}Калі ападае лісце з дрэў?
        <br/>{'     '}Калі паяўляюцца першыя кветкі? У якім месяцы?
        <br/>{'     '}Дзе чалавек можа паабедаць?
        <br/>{'     '}А калі няма часу прыгатаваць абед дома, дзе можна паабедаць?
        <br/>{'     '}Дзе чалавек можа паабедаць, калі ён знаходзіцца ў другім горадзе?
        <br/>{'     '}Хто працуе ў сталовых?
        <br/>{'     '}Хто працуе ў кафэ, рэстаранах?
        <br/>{'     '}Ці трэба плаціць за абед дома?
        <br/>{'     '}Ці трэба плаціць грошы за абед у сталовай?
        <br/>{'     '}Якую страву гатуюць на абед?
        <br/>{'     '}Што трэба казаць за абед?
        <br/>{'     '}Хто лечыць людзей?
        <br/>{'     '}Калі мы звяртаемся за дапамогай да доктара? Што робіць урач (доктар), калі чалавек захварэў? Калі мы мераем тэмпературу? Калі мы п'ём таблеткі i лекі?
        <br/>{'     '}Дзе лечаць хворых людзей? Дома? А яшчэ дзе? Што трэба рабіць, каб быць здаровым? Чаму трэба быць здаровым?
        <br/>{'     '}Як трэба апранацца ў халоднае надвор'е, каб не захварэць?
        <br/>{'     '}Ці ходзш ты ў садок, калі захварэеш?
        <br/>{'     '}Што трэба paбіць, каб паправіцца ад хваробы?
        <br/>{'     '}Што такое прырода? Зямля? Дрэвы? Кветка? Мора? Рэчка? Азёры? Горы?
        <br/>{'     '}Што ж мы маем на ўвазе, калі кажам: трэба берагчы прыроду?
        <br/>{'     '}Што расце на зямлі?
        <br/>{'     '}Ці любіш ты прыроду?
        <br/>{'     '}Ці патрэбна, каб прырода была здаровая? Прыгожая?
        <br/>{'     '}Навошта нам здаровая прырода? (Каб нам, людзям, добра было жыць.)
        <br/>{'     '}Што трэба paбіць, каб сябраваць з прыродай?
        <br/>{'     '}Як мы, маленыкія, можам сябраваць з прыродай? Што мы павінны рабіць для гэтага?
        <br/>{'     '}Ці хацела б ты ўмець вязаць?
        <br/>{'     '}Што б ты сабе звязала, каб умела вязаць?
        <br/>{'     '}Якога колеру ніткі ты б выбрала?
        <br/>{'     '}Хто б быў задаволены, каб ты сама сабе звязала прыгожы свігэр?
        <br/>{'     '}А каму ты хацела б перш за ўсё звязаць світэр? Маме, тату, бабулі, сястрычцы, 6paцікy цi сабе?
        <br/>{'     '}Калі ты ўстаеш у нядзельку?
        <br/>{'     '}Цябе будзяць  ці ты сам устаеш? Хто цябе будзіць?
        <br/>{'     '}Ці ахвотна ты устаеш, калі цябе будзяць?
        <br/>{'     '}Што ты любіш есці на сняданак у нядзельку?
        <br/>{'     '}Хто мые посуд пасля сняданка?
        <br/>{'     '}Ці дапамагаеш ты маме гатаваць сняданак, caбіраць на стол, мыць посуд?
        <br/>{'     '}Ці паліваеш вазоны? Ці выціраеш пыл? Што ты poбіш пасля сняданка ў нядзельку?
        <br/>{'     '}Ці гуляеш ты са cваімі цацкамі ў нядзельку?
        <br/>{'     '}Ці ходзш на шпацыр (на прагулку) у нядзельку? 3 кім ты ходізш?
        <br/>{'     '}Ці гуляеш з дзецьмі ў cваім двары?
        <br/>{'     '}Ці глядзіш мульцікі па тэлевізару?
        <br/>{'     '}Ці слухаеш вечаровую казку?
        <br/>{'     '}Ці ахвотна ідзеш спаць вечарам?
        <br/>{'     '}Ці чакаеш панядзелка, каб хутчэй пайсці ў садок?
        <br/>{'     '}Кім ты хочаш быць?
        <br/>{'     '}Ці ведаеш ты назвы прафесій?
        <br/>{'     '}Як называецца той, хто арэ трактарам поле?
        <br/>{'     '}Як называецца той, хто піша вершы?
        <br/>{'     '}Як называецца той, хто піша  прозу, казкі?
        <br/>{'     '}Як называецца той, хто малюе карціны?
        <br/>{'     '}Як называецца той, хто будуе дамы?
        <br/>{'     '}Як называецца той, хто пячэ хлеб?
        <br/>{'     '}Як называецца той, хто апрацоўвае зямлю?

        <br/>{'     '}Крыніца: Марціновіч Л.С., Юрэвіч Т.У., Іўліева Л.У. Сцяжынка. – Мн.: Нар.асвета, 1994. – 319с.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Тэматычныя пытанні'}/>
    );
  }
}

export default ThematicIssues;
