import React from 'react';

import BaseTextComponent from '../../shared/BaseTextComponent';

class WantAllKnow extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Як называецца наша рэспубліка?
        <br/>{'     '}Які горад сталіца Беларусі?
        <br/>{'     '}Якія дрэвы растуць у Беларусі?
        <br/>{'     '}Якія звяры самыя вялікія i дужыя?
        <br/>{'     '}Якія дрэвы даюць нам садавіну?
        <br/>{'     '}Якія беларускія прыказкі i прымаўкі ты ведаеш?
        <br/>{'     '}Якая гульні любяць хлопчыкі (дзяучынкі)?
        <br/>{'     '}Якія жывёлы жывуць у лесе?
        <br/>{'     '}Якія жывёлы даюць нам мяса (малако)?
        <br/>{'     '}Якія насякомыя збіраюць для нас мёд?
        <br/>{'     '}Якія птушкі даюць нам яйкі?
        <br/>{'     '}Якія жывёлы даюць нам воўну (шэрсць)?
        <br/>{'     '}Якія дрэвы растуць у лесе, а якія ў садзе?
        <br/>{'     '}Якіх птушак ты ведаеш?
        <br/>{'     '}Якой формы бываюць рыбы?
        <br/>{'     '}Якога колеру мышка?
        <br/>{'     '}Які месяц самы прыгожы? Чаму?
        <br/>{'     '}Які першы дзень тыдня?
        <br/>{'     '}Якога колеру суніца?
        <br/>{'     '}Як называюць таго, хто будуе дом?
        <br/>{'     '}Якія заводы ёсць у Мінску?
        <br/>{'     '}Якія гарады (рэкі, азёры) у Беларусі ты ведаеш?
        <br/>{'     '}Якога колеру вясёлка?
        <br/>{'     '}Якія жывёлы любяць есці траву?
        <br/>{'     '}Які звер — цар звяроў?
        <br/>{'     '}Якая мэбля стаіць у кухні?
        <br/>{'     '}Які сёння дзень?
        <br/>{'     '}Як называюць дзіця каровы?
        <br/>{'     '}Якога колеру лімон?
        <br/>{'     '}Які першы месяц года?
        <br/>{'     '}Якія птушкі зімуюць у нас?
        <br/>{'     '}Якія лепшыя месяцы ты ведаеш?
        <br/>{'     '}Якога колеру бурак?
        <br/>{'     '}Як называюць таго, хто косіць?
        <br/>{'     '}Як называюць таго, хто пячэ хлеб?
        <br/>{'     '}Якога колеру бываюць парсючкі?
        <br/>{'     '}Якога звярка можна навучыць гаварыць?
        <br/>{'     '}Якая жывёліна цягне плуг, воз, сані?
        <br/>{'     '}Якія жывёлы жывуць у садзе (агародзе)?
        <br/>{'     '}Як называецца жанчына, якая жне?
        <br/>{'     '}Які xiтры звер дапамагае паляўнічаму?
        <br/>{'     '}Як называецца той чалавек, які хлусіць?
        <br/>{'     '}Як вырастае бульба?
        <br/>{'     '}Які транспарт плавае па моры?
        <br/>{'     '}Якія гарады Беларусі самыя буйныя?
        <br/>{'     '}Дзе жывуць беларусы (украінцы, палякі, англічане)?
        <br/>{'     '}Дзе жывуць дзікія звяры (птушкі)?
        <br/>{'     '}Дзе растуць чарніцы (яблыні)?
        <br/>{'     '}Дзе мы купляем хлеб?
        <br/>{'     '}Дзе мы купляем таблеткі?
        <br/>{'     '}Дзе мы купляем білеты ў кіно, тэатр?
        <br/>{'     '}Дзе выступаў клоун?
        <br/>{'     '}Дзе жыве леў?
        <br/>{'     '}Дзе плаваюць караблі?
        <br/>{'     '}Дзе лятаюць самалёты?
        <br/>{'     '}Дзе расце капуста, морква, буракі?
        <br/>{'     '}Дзе растуць кветкі?
        <br/>{'     '}Дзе робяць машыны?
        <br/>{'     '}Дзе шыюць нам вопратку?
        <br/>{'     '}Дзе робяць цукеркі?
        <br/>{'     '}Дзе плаваюць рыбы?
        <br/>{'     '}Дзе можна ўзяць пачытаць кнігу?
        <br/>{'     '}Дзе растуць грыбы?
        <br/>{'     '}Дзе расце жыта?
        <br/>{'     '}Дзе жыве зубр?  У якой беларускай пушчы?
        <br/>{'     '}Дзе спяць птушкі?
        <br/>{'     '}Дзе мы купляем цацкі?
        <br/>{'     '}Дзе жыве белы мядзведзь?
        <br/>{'     '}Дзе паказваюць кіно?
        <br/>{'     '}Дзе жыве дэльфін?
        <br/>{'     '}Дзе растуць слівы? У парку ці ў садзе?
        <br/>{'     '}Дзе жыве слон? У моры? У лесе? Упустыні?
        <br/>{'     '}Дзе жыве вярблюд?
        <br/>{'     '}Дзе жыве кракадзіл?
        <br/>{'     '}Ці могуць ваўкі i авечкі сябраваць? Чаму не?
        <br/>{'     '}Ці могуць людзі жыць без паветра?
        <br/>{'     '}Ці могуць пальмы расці ў Беларусі?
        <br/>{'     '}Ці ўсе жывёлы ядуць адно i тое ж?
        <br/>{'     '}Ці ўсе жывёлы маюць хвост?
        <br/>{'     '}Ці ўсе людзі аднолькавыя?
        <br/>{'     '}Што забруджвае паветра?
        <br/>{'     '}Што ачышчае паветра?
        <br/>{'     '}Што трэба, каб расла расліна?
        <br/>{'     '}Што трэба, каб жыў чалавек?
        <br/>{'     '}Што робіць лекар (доктар)?
        <br/>{'     '}Што робіць настаўнік (дырыжор, кампазітар, архітэктар)?
        <br/>{'     '}Што робіць ганчар (пекар, цясляр, кравец, шавец, муляр, гарбар)?
        <br/>{'     '}Што робяць з воўны (з дрэва, з паперы, са скуры, са шкла)?
        <br/>{'     '}Што вышэй: дрэва ці куст?
        <br/>{'     '}Што цяжэй: камень ці пух?
        <br/>{'     '}Што нам дапамагае быць дужымі i здаровымі?
        <br/>{'     '}Што мы апранаем зімою (восенню, летам, вясною)?
        <br/>{'     '}Што трэба мець, каб спячы бліны?
        <br/>{'     '}Што нам дае сонейка?
        <br/>{'     '}Што больш: малаток ці цвік?
        <br/>{'     '}Што мы абуваем на ногі?
        <br/>{'     '}Што цвіце блакітнымі кветкамі: мак ці лён?
        <br/>{'     '}Што круглае: мяч ці кубік?
        <br/>{'     '}Што робяць на кроснах?
        <br/>{'     '}Што расце на дубе?
        <br/>{'     '}Што робяць на трактары?
        <br/>{'     '}Што робяць на дудцы? На скрыпцы? На гармоніку? На цымбалах?
        <br/>{'     '}Што растае: снег ці пясок?
        <br/>{'     '}Што трэба зрабіць, каб праветрыцъ пакой?
        <br/>{'     '}Што трэба мець, каб пабудаваць дом?
        <br/>{'     '}Што можна збіраць у лесе?
        <br/>{'     '}Што робіць каваль?
        <br/>{'     '}Чаму мы паліваем расліны?
        <br/>{'     '}Чаму мы cпім? Чаму мы ядзім? Чаму мы працуем? Чаму зоркі такія малюсенькія? Яны блізка ці далёка ад нас?
        <br/>{'     '}Чаму мама i тата ходзяць на працу?
        <br/>{'     '}Чаму мы павінны чысціць зубы?
        <br/>{'     '}Чаму мы павінны даглядаць за рыбкамі ў акварыуме?
        <br/>{'     '}У якой жывёліны пушысты хвост? У каго ёсць рожкі? У каго многа ножак?
        <br/>{'     '}У якой птушкі доўгая дзюба?
        <br/>{'     '}У якой птушкі доўгія i чырвоныя ногі?
        <br/>{'     '}У каго большы хвост: у зайчыка ці ў ліскі?
        <br/>{'     '}У каго ёсць вочкі: у мышкі ці ў кошкі?
        <br/>{'     '}Хто ловіць мышэй?
        <br/>{'     '}Хто умее лятаць? Птушка? А яшчэ хто?
        <br/>{'     '}Хто хутчэй бегае: заяц цi чарапаха?
        <br/>{'     '}Хто лётае: пчала ці вусень?
        <br/>{'     '}Хто жыве у вуллі: чмель ці пчала?
        <br/>{'     '}Kaлі цёпла: зімой цi летам?
        <br/>{'     '}Калі цяплей: вясной ці летам?
        <br/>{'     '}Калі   птушкі  прылятаюць з выраю: восенню цi вясной?
        <br/>{'     '}Калі часцей ідзе дождж? Восенню ці летам?
        <br/>{'     '}Калі мы кладзёмся спаць: вечарам ці раніцай?
        <br/>{'     '}Калі цвітуць сады? Вясною ці летам?
        <br/>{'     '}Калі мыем мы pyкi? Чым мыем мы рукі? А чым ix выціраем?
        <br/>{'     '}Калі мы запальваем (уключаем) святло? Навошта мы запальваем святло?
        <br/>{'     '}Калі мы абуваем гумавыя боты?
        <br/>{'     '}Kaлi дзеці купаюцца ў рэчцы?
        <br/>{'     '}Калі лепш ecцi марожанае: летам цi зімой?
        <br/>{'     '}Калі мы пpociм прабачэння? Калі кажам: «Прабачце», «Выбачайце», «Даруйце»?
        <br/>{'     '}Калі мы можам убачыць на небе зоркі i месяц?
        <br/>{'     '}Kaлi ападае лісце з дрэў?
        <br/>{'     '}Калі надвор'е пахмурнае? Калі свеціць сонца ці калі сонца схаваецца за хмары?
        <br/>{'     '}Калі бывае на дварэ горача?
        <br/>{'     '}Калі спіць мядзведзь?
        <br/>{'     '}Ці растуць пальмы ў Беларусі? А дзе яны растуць?
        <br/>{'     '}Ці ёсць у Беларусі буслы, сарокі, перапёлкі?
        <br/>{'     '}Цi можам мы бачыць паветра?
        <br/>{'     '}Цi ўсе жывёлы баяцца чалавека?
        <br/>{'     '}Ці ўсе жывёлы могуць жыць побач з чалавекам?
        <br/>{'     '}Цi можа размаўляць папугай?
        <br/>{'     '}Ці можа кветка pacцi без кораня?
        <br/>{'     '}Ці можа рыба жыць без вады?
        <br/>{'     '}Ці можа icцi снег летам?
        <br/>{'     '}Ці сябруюць кот з сабакам?
        <br/>{'     '}Ці спяваюць птушкі зімой?
        <br/>{'     '}Ці трэба жывёліне жыллё (сховішча)?
        <br/>{'     '}Ці жывуць у Беларусі вярблюды? А дзе яны жывуць?
        <br/>{'     '}Ці ёсць крылы ў рыбкі?
        <br/>{'     '}Ці ёсць вочкі ў страказы?
        <br/>{'     '}Ці спявае салавей?
        <br/>{'     '}Ці ўсе птушкі могуць лятаць? (Не)
        <br/>{'     '}Ці можа чалавек пражыць без агню? Без вады? Без паветра?
        <br/>{'     '}Ці спяць ваўкі?
        <br/>{'     '}Ці цвіце дрэва?
        <br/>{'     '}Ці можна ўбачыць сонца ноччу?
        <br/>{'     '}Ці можа сабака лятаць?

        <br/>{'     '}Крыніца: Марціновіч Л.С., Юрэвіч Т.У., Іўліева Л.У. Сцяжынка. – Мн.: Нар.асвета, 1994. – 319с.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'Хачу ўсё ведаць'}/>
    );
  }
}

export default WantAllKnow;
