import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class TonguesAndTongueTwisters extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}<b>Чистоговорки</b> – это стихотворные упражнения, направленные на развитие органов артикуляционного аппарата и помогающие отработке произношения какого – то звука при регулярном их повторении.
        <br/>{'     '}Произносить их целесообразно сначала медленно, чётко артикулируя каждый звук, словно говоришь глухому человеку, который умеет читать по губам. А затем темп следует увеличивать, но не снижая качества произношения. Можно проговаривать чистоговорки сначала шёпотом, стараясь при этом активно работать губами и языком, а затем – громко, с такой же активностью органов артикуляции.
        <br/>{'     '}Далее приводится примерный набор чистоговорок, которые можно использовать дома по развитию речи для развития правильного звукопроизношения.
        <br/>{'     '}
        <br/>{'     '}Та-та-та – у нас дома чистота
        <br/>{'     '}Си-си-си – в водоёме караси
        <br/>{'     '}Ри-ри-ри – на ветке снегири
        <br/>{'     '}Ул-ул-ул – у нас сломался стул
        <br/>{'     '}За-за-за – уходи домой коза
        <br/>{'     '}Ра-ра-ра – Кате спать пора
        <br/>{'     '}Ба-бо-бы – на дворе стоят столбы
        <br/>{'     '}Ша-ша-ша – мама моет малыша
        <br/>{'     '}Ся-ся-ся – вот поймать бы карася
        <br/>{'     '}Ать-ать-ать – мы идём гулять
        <br/>{'     '}Ом-ом-ом-ом-мы построим новый    дом.
        <br/>{'     '}Уп-уп-уп-уп — я готовлю папе суп.
        <br/>{'     '}Бы-бы-бы-бы в лесу растут грибы
        <br/>{'     '}
        <br/>{'     '}Можно и самому придумать шутливые фразы, типа:
        <br/>{'     '}
        <br/>{'     '}"да-да-да - в огороде лебеда",
        <br/>{'     '}"ду-ду-ду - растут яблоки в саду",
        <br/>{'     '}"ша-ша-ша - принесли домой ерша"
        <br/>{'     '}"ту-ту-ту - мы поедем в Воркуту"
        <br/>{'     '}"жа-жа-жа - есть иголки у ежа"
        <br/>{'     '}"чи-чи-чи - прилетели к нам грачи"
        <br/>{'     '}"жу-жу-жу - я на солнышке лежу" ... и так далее.
        <br/>{'     '}
        <br/>{'     '}Чистоговорки, имеющие вид обычного детского стихотворения, в котором часто повторяется отрабатываемый звук, несущие в себе обязательную смысловую нагрузку.
        <br/>{'     '}
        <br/>{'     '}Зачем у маленькой хозяйки-
        <br/>{'     '}Зелёный зонтик взяли зайки?
        <br/>{'     '}Затем, чтоб спрятаться от волка
        <br/>{'     '}Под этим зонтиком из шёлка
        <br/>{'     '}
        <br/>{'     '}Игрушку новую везёт.
        <br/>{'     '}Игрушка не простая –
        <br/>{'     '}Индюшка расписная
        <br/>{'     '}
        <br/>{'     '}В небе громко гром гремит –
        <br/>{'     '}Громко нам гроза грозит.
        <br/>{'     '}Не гремите, не грозите,
        <br/>{'     '}Дождём грядки напоите.
        <br/>{'     '}Опубликовано 04.08.2015 - Онипко Наталья Викторовна. https://nsportal.ru/detskiy-sad/materialy-dlya-roditeley/2015/08/04/rekomendatsii-dlya-roditeley-chistogovorki-dlya
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>СКОРОГОВОРКИ</b>
        <br/>{'     '}
        <br/>{'     '}<span style={{color: 'purple'}}>Скороговорка</span> — короткая синтаксически правильная фраза на любом языке с искусственно усложнённой артикуляцией. Скороговорки содержат близкие по звучанию, но различные фонемы (например, c и ш) и сложные для произношения сочетания фонем. Зачастую содержат аллитерации и рифмы. Используются для тренировки дикции и произношения.
        <br/>{'     '}Дети очень любят скороговорки, поэтому, развивая речь ребенка, их надо применять как можно чаще. Скороговорки можно произносить в разных темпах: медленном, умеренном и очень быстром. Чтобы речь развивалась, надо следить за четкостью произношения каждого звука. Больше внимания уделяйте тем скороговоркам, в которых есть звуки, вызывающие затруднения произношения у вашего ребенка.
        <br/>{'     '}
        <br/>{'     '}<span style={{color: 'red'}}>Есть несколько способов работы со скороговорками:</span>
        <br/>{'     '}
        <br/>{'     '}1. Пусть ребёнок возьмёт в руки мяч и, ритмично подбрасывая и ловя его руками, проговорит скороговорку. Подбрасывать и ловить мяч можно на каждое слово или на слог.
        <br/>{'     '}2. Пусть ребёнок проговорит скороговорку, перебрасывая мячик из одной руки в другую.
        <br/>{'     '}3. Проговорить скороговорку можно, прохлопывая ритм ладошками.
        <br/>{'     '}4. Предложите проговорить скороговорку 3 раза подряд и не сбиться.
        <br/>{'     '}
        <br/>{'     '}<span style={{color: 'blue'}}>Скороговорки бывают короткие и длинные, рифмованные и нерифмованные, сюжетные и бессюжетные, логичные и абсурдные, с повторами и без повторов, "построенные" на одном звуке и на сочетаниях звуков, доступные детскому восприятию и не рассчитанные на него. Не многие жанры литературы могут состязаться со скороговорками в подобном разнообразии.</span>
        <br/>{'     '}<span style={{color: 'purple'}}>Приведём примеры:</span>
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>Короткая:</i>
        <br/>{'     '}В один, Клим, клин колоти.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>Длинная:</i>
        <br/>{'     '}Пётр Петрович,
        <br/>{'     '}По прозванью Перов,
        <br/>{'     '}Поймал птицу пигалицу;
        <br/>{'     '}Понёс по рынку,
        <br/>{'     '}Просил полтинку,
        <br/>{'     '}Подали пятак,
        <br/>{'     '}Он и продал так.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>Рифмованная:</i>
        <br/>{'     '}Шли сорок мышей,
        <br/>{'     '}Несли сорок грошей;
        <br/>{'     '}Две мыши поплоше
        <br/>{'     '}Несли по два гроша.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>Нерифмованная:</i>
        <br/>{'     '}Сыворотка из-под простокваши.
        <br/>{'     '}Сюжетная:
        <br/>{'     '}Свинья тупорыла
        <br/>{'     '}Весь двор перерыла,
        <br/>{'     '}Вырыла полрыла,
        <br/>{'     '}До норы не дорыла.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>Бессюжетная:</i>
        <br/>{'     '}Из-под кислого молока,
        <br/>{'     '}Из-под простокваши.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>С повторами:</i>
        <br/>{'     '}Шли три попа,
        <br/>{'     '}Три Прокопья попа,
        <br/>{'     '}Три Прокопьевича,
        <br/>{'     '}Говорили про попа,
        <br/>{'     '}Про Прокопья попа,
        <br/>{'     '}Про Прокопьевича.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>Без повторов:</i>
        <br/>{'     '}По ремешку,
        <br/>{'     '}По брёвешку
        <br/>{'     '}Боком проведу кобылку.
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>На одном звуке:</i>
        <br/>{'     '}Брат Аркадий зарезал буру корову
        <br/>{'     '}На горах Араратских.
        <br/>{'     '}(здесь в каждом слове звук "Р")
        <br/>{'     '}
        <br/>{'     '}<i style={{color: 'red'}}>На сочетании звуков:</i>
        <br/>{'     '}Бык тупогуб,
        <br/>{'     '}У быка губа тупа.
        <br/>{'     '}(дифференциация звуков "Б" и "П") http://forum.ditenok.com/showthread.php?p=89928
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Чистоговорки.</b>
        <br/>{'     '}
        <br/>{'     '}Са-са-са: на столе оса (в клетке спит лиса).
        <br/>{'     '}Су-су-су: боимся мы осу (смотрим на лису).
        <br/>{'     '}Сы-сы-сы: жало у осы (хвост пушистый у лисы).
        <br/>{'     '}Се-се-се: кисель дадим осе (знаем сказку о лисе).
        <br/>{'     '}
        <br/>{'     '}Ли-ли-ли: в синем море корабли (сели на мели).
        <br/>{'     '}Ля-ля-ля: мачта корабля (в книге есть поля).
        <br/>{'     '}Ле-ле-ле: гнезда на скале (казак сидит в седле).
        <br/>{'     '}Лю-лю-лю: мамочку люблю (соломку постелю).
        <br/>{'     '}
        <br/>{'     '}Ла-ла-ла: отвесная скала (маму ждут дела).
        <br/>{'     '}Лу-лу-лу: обойдем скалу (мусор на полу).
        <br/>{'     '}Лы-лы-лы: (сели слева от скалы).
        <br/>{'     '}Ло-ло-ло: в лодке есть весло (всадник сел в седло).
        <br/>{'     '}
        <br/>{'     '}Ас-ас-ас: бегут детишки в класс (сладкий ананас).
        <br/>{'     '}Ос-ос-ос: в классе много ос (на столе кокос).
        <br/>{'     '}Ус-ус-ус: Саша любит мусс (малыш совсем не трус).
        <br/>{'     '}Ес-ес-ес: сани едут в лес (каков у штанги вес?).
        <br/>{'     '}Ыс-ыс-ыс: коты бегут от крыс (Соня, пей кумыс).
        <br/>{'     '}
        <br/>{'     '}Ал-ал-ал: гуляли возле скал (папа наш устал).
        <br/>{'     '}Ол-ол-ол: сели все за стол (в классе чистый пол).
        <br/>{'     '}Ул-ул-ул: сломался новый стул (в зале слышен гул).
        <br/>{'     '}Ыл-ыл-ыл: Саня уши мыл (чай уже остыл).
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Скороговорки.</b>
        <br/>{'     '}
        <br/>{'     '}<span style={{color: 'blue'}}>Прежде чем переходить к быстрому проговариванию скороговорок, ребенок должен её запомнить. Темп произнесения убыстряется постепенно.</span>
        <br/>{'     '}
        <br/>{'     '}У Сени и Сани сом с усами.
        <br/>{'     '}Сеня в сени сено вез.
        <br/>{'     '}У осы не усы, не усищи, а усики.
        <br/>{'     '}Коси, коса, пока роса. Роса долой и мы домой.
        <br/>{'     '}Везет Сеня с Саней, Соню на санях.
        <br/>{'     '}От топота копыт пыль по полю летит.
        <br/>{'     '}Восьмой кол вбили в частокол.
        <br/>{'     '}Топали да топали, дотопали до тополя.
        <br/>{'     '}Дятел дуб долбил, да не додолбил.
        <br/>{'     '}В один, Клим, клин колоти.
        <br/>{'     '}Маланья-болтунья молоко болтала, да не выболтала.
        <br/>{'     '}<b style={{color: 'blue'}}>Чистоговорки с трудными звуками.</b>
        <br/>{'     '}
        <br/>{'     '}<span style={{color: 'blue'}}>Дальше переходим к трудным звукам Ш, Ж, Щ, Ч, Р. Они гораздо быстрее войдут в речь ребенка, если вы совместными усилиями сочините что-то вроде:</span>
        <br/>{'     '}
        <br/>{'     '}Ря-ря-ря: алая заря (накормим снегиря).
        <br/>{'     '}Рю-рю-рю: рисую я зарю (игрушки подарю).
        <br/>{'     '}Ри-ри-ри: чисто говори (на ветках снегири).
        <br/>{'     '}Ра-ра-ра: в школу мне пора (дети нашего двора).
        <br/>{'     '}Ре-ре-ре: игры во дворе (читаем детворе).
        <br/>{'     '}Ро-ро-ро: легкое перо (на полу ведро).
        <br/>{'     '}Ры-ры-ры: стихи для детворы (фишки для игры).
        <br/>{'     '}Ру-ру-ру: развлекаем детвору (гуси ходят по двору).
        <br/>{'     '}Ар-ар-ар: из кастрюли валит пар (у больного жар).
        <br/>{'     '}Ор-ор-ор: разгорелся спор (выметаем сор).
        <br/>{'     '}Ир-ир-ир: роту строит командир (во дворе устроим пир).
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Затем подбираем скороговорки с этими же звуками:</b>
        <br/>{'     '}
        <br/>{'     '}Жутко жуку жить на суку.
        <br/>{'     '}Ежу на ужин жук нужен.
        <br/>{'     '}У ужа ужата, у ежа – ежата.
        <br/>{'     '}Поспеши, не мешкай, сбегай за орешком.
        <br/>{'     '}По двору, по подворью в добром здоровье.
        <br/>{'     '}У нас на подворье погода размокропогодилась.
        <br/>{'     '}Свинья тупорыла весь двор перерыла.
        <br/>{'     '}Летят пичужки через три пустые избушки.
        <br/>{'     '}У Маши и Глаши есть сыворотка из-под простокваши.
        <br/>{'     '}Черной ночью черный кот прыгнул в черный дымоход.
        <br/>{'     '}На кочке квочка, квочка на кочке.
        <br/>{'     '}Щеткой чищу я щенка, щекочу ему бока.
        <br/>{'     '}Шли сорок мышей, несли сорок грошей. Две мыши поплоше несли по два гроша.
        <br/>{'     '}Тридцать три молодца съели тридцать три пирога, да все с творогом.
        <br/>{'     '}Осип орет. Архип не отстает. Кто кого переорет? Осип охрип, Архип осип.
        <br/>{'     '}Сорок сорок воровали горох, сорок ворон отогнали сорок. Сорок орлов напугали ворон, сорок коров разогнали орлов.
        <br/>{'     '}
        <br/>{'     '}Опубликовано 06.05.2014 - Теренко Наталья Анатольевна. http://www.razvitierebenka.com
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Скороговорки для детей 5-6 лет</b>
        <br/>{'     '}
        <br/>{'     '}Хлеб ржаной, батоны, булки
        <br/>{'     '}Не добудешь на прогулке.
        <br/>{'     '}
        <br/>{'     '}Веселей, Савелий, сено пошевеливай.
        <br/>{'     '}Белые бараны били в барабаны.
        <br/>{'     '}Купила бабуся бусы Марусе.
        <br/>{'     '}Валин валенок провалился в прогалинок.
        <br/>{'     '}У четырех черепашек по четыре черепашонка.
        <br/>{'     '}
        <br/>{'     '}Забавной обезьяне бросили бананы,
        <br/>{'     '}Бросили бананы забавной обезьяне.
        <br/>{'     '}
        <br/>{'     '}У нас на дворе-подворье,
        <br/>{'     '}Погода размокропогодилась.
        <br/>{'     '}
        <br/>{'     '}Баран буян залез в бурьян.
        <br/>{'     '}
        <br/>{'     '}Проворонила ворона вороненка.
        <br/>{'     '}
        <br/>{'     '}На рынке Кирилл крынку и кружку купил.
        <br/>{'     '}
        <br/>{'     '}Поля пошла полоть петрушку в поле.
        <br/>{'     '}
        <br/>{'     '}У ежа и елки иголки колки.
        <br/>{'     '}
        <br/>{'     '}У гусыни усов ищи не ищи — не сыщешь.
        <br/>{'     '}
        <br/>{'     '}Дед Додон в дуду дудел,
        <br/>{'     '}Димку дед дудой задел.
        <br/>{'     '}
        <br/>{'     '}Оса боса и без пояса.
        <br/>{'     '}
        <br/>{'     '}С мышами во ржи подружились ежи.
        <br/>{'     '}Ушли в камыши – и во ржи не души.
        <br/>{'     '}
        <br/>{'     '}У Сени и Сани в сетях сом с усами.
        <br/>{'     '}
        <br/>{'     '}Дед Данила делил дыню –
        <br/>{'     '}Дольку Диме, дольку Дине.
        <br/>{'     '}
        <br/>{'     '}Влас у нас, Афанас у вас.
        <br/>{'     '}
        <br/>{'     '}На дуб не дуй губ,
        <br/>{'     '}Не дуй губ на дуб.
        <br/>{'     '}
        <br/>{'     '}Коваль Кондрат сталь ковал, ковал да перековывал.
        <br/>{'     '}
        <br/>{'     '}Неделю Емеле прясть короб кудели,
        <br/>{'     '}А Емелиной дочке – прясть одну ночку.
        <br/>{'     '}
        <br/>{'     '}Один Клим клин колотил, колотил и выколотил.
        <br/>{'     '}
        <br/>{'     '}Испугались медвежонка
        <br/>{'     '}Еж с ежихой и с ежонком,
        <br/>{'     '}Стриж с стрижихой и стрижонком.
        <br/>{'     '}
        <br/>{'     '}На возу лоза, у воза коза.
        <br/>{'     '}
        <br/>{'     '}Ткет ткач ткани на платье Тане.
        <br/>{'     '}
        <br/>{'     '}У Кондрата куртка коротковата.
        <br/>{'     '}
        <br/>{'     '}Источник. http://irinazaytseva.ru/skorogovorki.html
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Скороговорки для детей 7-8 лет</b>
        <br/>{'     '}
        <br/>{'     '}По дороге топал Топаль,
        <br/>{'     '}Топаль топал в Севастополь.
        <br/>{'     '}Ну а рядом топал Сева,
        <br/>{'     '}Топаль справа, Сева слева.
        <br/>{'     '}
        <br/>{'     '}Мила мыла мишку мылом,
        <br/>{'     '}Мила мыло уронила,
        <br/>{'     '}Уронила Мила мыло,
        <br/>{'     '}Мила мишку не домыла.
        <br/>{'     '}
        <br/>{'     '}Шла Саша по шоссе,
        <br/>{'     '}Несла сушку на шесте.
        <br/>{'     '}И сосала сушку.
        <br/>{'     '}
        <br/>{'     '}Ехал Грека через реку.
        <br/>{'     '}Видит Грека – в реке рак.
        <br/>{'     '}Сунул в реку руку Грека.
        <br/>{'     '}Рак за руку Грека — цап.
        <br/>{'     '}
        <br/>{'     '}Сиреневенький глазовыколупыватель с полувыломанными ножками.
        <br/>{'     '}
        <br/>{'     '}Ужа ужалила ужица,
        <br/>{'     '}Ужу с ужицей не ужиться,
        <br/>{'     '}Уж уж от ужаса стал уже,
        <br/>{'     '}Не ешь ужица ужа-мужа,
        <br/>{'     '}Без ужа-мужа будет хуже.
        <br/>{'     '}
        <br/>{'     '}На дворе трава,
        <br/>{'     '}На траве дрова.
        <br/>{'     '}Не руби дрова
        <br/>{'     '}На траве двора.
        <br/>{'     '}
        <br/>{'     '}Баркас приехал в порт Мадрас.
        <br/>{'     '}
        <br/>{'     '}Матрос принес на борт матрас.
        <br/>{'     '}
        <br/>{'     '}В порту Мадрас матрас матроса
        <br/>{'     '}
        <br/>{'     '}Порвали в драке альбатросы.
        <br/>{'     '}
        <br/>{'     '}Говорит попугай попугаю:
        <br/>{'     '}– Я тебя, попугай, попугаю!
        <br/>{'     '}Отвечает ему попугай:
        <br/>{'     '}– Попугай, попугай, попугай!
        <br/>{'     '}
        <br/>{'     '}Скороговорун скороговорил: все скороговорки не перескороговоришь, не перевыскороговоришь. Но заскороговорившись, все-таки выскороговорил: все скороговорки перескороговоришь, перевыскороговоришь.
        <br/>{'     '}
        <br/>{'     '}Триста тридцать три корабля
        <br/>{'     '}Лавировали, лавировали,
        <br/>{'     '}Лавировали, лавировали,
        <br/>{'     '}Лавировали, лавировали,
        <br/>{'     '}Да и не вылавировали,
        <br/>{'     '}Да и не вылавировали,
        <br/>{'     '}Да и не вылавировали.
        <br/>{'     '}
        <br/>{'     '}Четыре черных коня черту совсем не чета в четвертый четверг ноября.
        <br/>{'     '}
        <br/>{'     '}Жили-были три китайца – Як, Як-Цидрак, Як-Цидрак-Цидрон-Цидрони,
        <br/>{'     '}И еще три китаянки – Цыпа, Цыпа-Дрипа, Цыпа-Дрипа-Лампомпони.
        <br/>{'     '}Поженились Як на Цыпе, Як-Цидрак на Цыпе-Дрипе,
        <br/>{'     '}Як-Цидрак-Цидрон-Цидрони на Цыпе-Дрипе-Лампомпони.
        <br/>{'     '}Вот у них родились дети: у Яка с Цыпой — Шах,
        <br/>{'     '}У Як-Цидрака с Цыпой-Дрыпой — Шах-Шарах,
        <br/>{'     '}У Як-Цидрак-Цидрони с Цыпо-Дрыпой-Лампопони — Шах-Шарах-Шарони.
        <br/>{'     '}
        <br/>{'     '}Четыре черненьких
        <br/>{'     '}Чумазеньких чертенка
        <br/>{'     '}Чертили черными
        <br/>{'     '}Чернилами чертеж
        <br/>{'     '}Чрезвычайно четко.
        <br/>{'     '}
        <br/>{'     '}Ежели вы не жили возле ежевичника,
        <br/>{'     '}Но ежели вы жили возле земляничника,
        <br/>{'     '}То значит, земляничное варенье вам привычное
        <br/>{'     '}И вовсе не привычное варенье ежевичное.
        <br/>{'     '}Ежели вы жили возле ежевичника,
        <br/>{'     '}То значит, ежевичное варенье вам привычное,
        <br/>{'     '}И вовсе не привычное варенье земляничное.
        <br/>{'     '}Но ежели вы жили возле ежевичника,
        <br/>{'     '}И ежели вы жили возле земляничника,
        <br/>{'     '}И ежели вы времени на лес не пожалели,
        <br/>{'     '}То значит, преотличное варенье ежевичное,
        <br/>{'     '}Варенье земляничное вы ежедневно ели.
        <br/>{'     '}
        <br/>{'     '}Кто хочет разговаривать,
        <br/>{'     '}Тот должен выговаривать
        <br/>{'     '}Все правильно и внятно,
        <br/>{'     '}Чтоб было всем понятно.
        <br/>{'     '}Мы будем разговаривать
        <br/>{'     '}И будем выговаривать
        <br/>{'     '}Так правильно и внятно,
        <br/>{'     '}Чтоб было всем понятно.
        <br/>{'     '}
        <br/>{'     '}Карл у Клары украл кораллы,
        <br/>{'     '}А Клара у Карла украла кларнет.
        <br/>{'     '}Если бы Карл не крал у Клары кораллы,
        <br/>{'     '}То Клара не крала б у Карла кларнет.
        <br/>{'     '}
        <br/>{'     '}Нет абрикоса, кокоса, редиса,
        <br/>{'     '}
        <br/>{'     '}Граф Тото играет в лото,
        <br/>{'     '}А графиня Тото знает про то,
        <br/>{'     '}Что Граф Тото играет в лото,
        <br/>{'     '}Если бы граф Тото знал про то,
        <br/>{'     '}Что графиня Тото знает про то,
        <br/>{'     '}Что граф Тото играет в лото,
        <br/>{'     '}То б граф Тото никогда бы в жизни
        <br/>{'     '}Не играл бы в лото.
        <br/>{'     '}
        <br/>{'     '}Король на корону копейку копил,
        <br/>{'     '}Да вместо короны корову купил,
        <br/>{'     '}А этот король на корову копил.
        <br/>{'     '}
        <br/>{'     '}Шли Струмай, Строкциг, Марнос,
        <br/>{'     '}
        <br/>{'     '}Прокцогцзинь и Пригноцкроз.
        <br/>{'     '}
        <br/>{'     '}Рядом с ними были сыны Струмайка Процгович, Странцигка Инкогнитович,
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Скороговорки для детей с шипящими звуками</b>
        <br/>{'     '}
        <br/>{'     '}Маша шила для мартышки
        <br/>{'     '}Шубу, шапку и штанишки.
        <br/>{'     '}
        <br/>{'     '}Шел Егор через двор,
        <br/>{'     '}Нес топор чинить забор.
        <br/>{'     '}
        <br/>{'     '}Шелкопряд, шелкопряд
        <br/>{'     '}Шёлк прядёт за рядом ряд.
        <br/>{'     '}Плотно шёлком обмотался,
        <br/>{'     '}Шелкопряд внутри остался.
        <br/>{'     '}
        <br/>{'     '}Вот шипит большущий уж:
        <br/>{'     '}– Очень душно. Мне бы в душ.
        <br/>{'     '}Полежать под душем нужно,
        <br/>{'     '}Чтобы не было так душно.
        <br/>{'     '}
        <br/>{'     '}Саша кушал кашу.
        <br/>{'     '}Кашу кушал Саша.
        <br/>{'     '}Саша, кушай не спеша,
        <br/>{'     '}Наша каша хороша.
        <br/>{'     '}
        <br/>{'     '}Кукушка кукушонку купила капюшон.
        <br/>{'     '}Надел кукушонок капюшон.
        <br/>{'     '}Как в капюшоне он смешон!
        <br/>{'     '}
        <br/>{'     '}На опушке в избушке
        <br/>{'     '}Живут старушки-болтушки.
        <br/>{'     '}У каждой старушки лукошко,
        <br/>{'     '}В каждом лукошке кошка,
        <br/>{'     '}Кошки в лукошках шьют старушкам сапожки.
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Скороговорки с буквой «с» для детей</b>
        <br/>{'     '}
        <br/>{'     '}Саша шустро сушит сушки,
        <br/>{'     '}Саша высушил штук шесть,
        <br/>{'     '}И смешно спешат старушки
        <br/>{'     '}Сушек Сашиных поесть.
        <br/>{'     '}
        <br/>{'     '}Сеня вез воз сена.
        <br/>{'     '}
        <br/>{'     '}Села Алеся, с печи ноги свеся,
        <br/>{'     '}Не смейся, Алеся, а на печи грейся.
        <br/>{'     '}
        <br/>{'     '}У Степана есть сметана,
        <br/>{'     '}Простокваша да творог,
        <br/>{'     '}Семь копеек — туесок.
        <br/>{'     '}
        <br/>{'     '}Съешь меня — вопрошает вишня, страшась быть выброшенной лишняя.
        <br/>{'     '}
        <br/>{'     '}Съел Слава сало, да сала было мало.
        <br/>{'     '}
        <br/>{'     '}Сев в такси спросила такса:
        <br/>{'     '}«За проезд какая такса?»
        <br/>{'     '}А таксист ответил так:
        <br/>{'     '}Суровый суворовец Суворов сурово сверлил сверлом сырую стену суворовского училища.
        <br/>{'     '}
        <br/>{'     '}Солнце светит очень ярко,
        <br/>{'     '}Бегемоту стало жарко.
        <br/>{'     '}
        <br/>{'     '}Слоны умны, слоны смирны,
        <br/>{'     '}Слоны спокойны и сильны.
        <br/>{'     '}
        <br/>{'     '}Слишком много ножек у сороконожек.
        <br/>{'     '}
        <br/>{'     '}Солнце садится, струится водица,
        <br/>{'     '}Птица-синица в водицу глядится.
        <br/>{'     '}Чистой водицы синица напьется —
        <br/>{'     '}Славно сегодня звенится-поется!
        <br/>{'     '}
        <br/>{'     '}<b style={{color: 'blue'}}>Смешные скороговорки для детей</b>
        <br/>{'     '}
        <br/>{'     '}Снова Грека через реку перебраться захотел,
        <br/>{'     '}Краб, притихший, словно рыба, под корягою сидел.
        <br/>{'     '}Глупый Грека руку в реку сунул, не подумавши.
        <br/>{'     '}Цапнул краб за руку Греку, насмеялся от души.
        <br/>{'     '}
        <br/>{'     '}Карасенку раз карась
        <br/>{'     '}Подарил раскраску.
        <br/>{'     '}И сказал Карась:
        <br/>{'     '}«Раскрась, Карасенок, сказку!»
        <br/>{'     '}На раскраске Карасенка –
        <br/>{'     '}Три веселых поросенка:
        <br/>{'     '}Карасенок поросят перекрасил в карасят!
        <br/>{'     '}
        <br/>{'     '}Брат сестре твердит три дня:
        <br/>{'     '}Скоро праздник у меня,
        <br/>{'     '}Третий день рожденья,
        <br/>{'     '}Будем есть варенье.
        <br/>{'     '}
        <br/>{'     '}Красный краб кричит «Ура!»
        <br/>{'     '}Резать торт пришла пора.
        <br/>{'     '}
        <br/>{'     '}Грянул гром – гроза в разгаре.
        <br/>{'     '}
        <br/>{'     '}Четыре черепашки учились пить из чашки.
        <br/>{'     '} Чашку чая заварили, на четыре поделили.
        <br/>{'     '}
        <br/>{'     '}Когда спешу, я ем лапшу.
        <br/>{'     '}Ну вот, опять всех насмешу.
        <br/>{'     '}
        <br/>{'     '}Принц принцессу пригласил прогуляться по проспекту.
        <br/>{'     '}
        <br/>{'     '}Куры, гуси да индюшки наклевалися петрушки,
        <br/>{'     '}Закусили лебедой, побежали за водой.
        <br/>{'     '}
        <br/>{'     '}У Пашки в кармашке букашки и бумажки.
        <br/>{'     '}
        <br/>{'     '}За поселком у проселка в поле пела перепелка
        <br/>{'     '}Перепел прилетел, перепелку перепел.
        <br/>{'     '}
        <br/>{'     '}Яша с Пашей ели кашу,
        <br/>{'     '}Саша с Машей простоквашу,
        <br/>{'     '}А Мишутка съел селедку под шубкой.
        <br/>{'     '}
        <br/>{'     '}Мышка залезла под крышку,
        <br/>{'     '}Чтобы под крышкой сгрызть крошку,
        <br/>{'     '}Мышке, наверное, крышка –
        <br/>{'     '}Мышка забыла про кошку!
        <br/>{'     '}
        <br/>{'     '}Тощий немощный Кощей
        <br/>{'     '}Тащит ящик овощей.
        <br/>{'     '}
        <br/>{'     '}Хитрую сороку поймать морока,
        <br/>{'     '}А сорок сорок – сорок морок.
        <br/>{'     '}
        <br/>{'     '}Вез корабль карамель,
        <br/>{'     '}Налетел корабль на мель,
        <br/>{'     '}И матросы три недели
        <br/>{'     '}Карамель на мели ели.
        <br/>{'     '}
        <br/>{'     '}Источник. http://irinazaytseva.ru/skorogovorki.html
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent title={'Чистоговорки и скороговорки'} data={data}/>
    );
  }
}

export default TonguesAndTongueTwisters;
