import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class TongueTwisters extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Большую часть нашего времени (около 16 часов в сутки) мы общаемся. Очевидно, что именно от коммуникативных навыков зависит успех человека буквально в любой сфере деятельности, поскольку речевые характеристики являются важной частью его образа. Недостатки речи могут оказать негативное влияние на будущее ребенка. К таким недостаткам относят:
        <br/>{'     '}•	монотонную или слишком экспрессивную интонацию
        <br/>{'     '}•	несоблюдение пауз
        <br/>{'     '}•	плохую дикцию
        <br/>{'     '}•	слишком быстрый или медленный темп речи
        <br/>{'     '}•	тихий или слишком громкий голос.
        <br/>{'     '}Большинство недостатков вполне исправимы. И помогут в этом простые и несправедливо забытые скороговорки
        <br/>{'     '}Игра — самый естественный вид деятельности ребенка. Именно поэтому игровые формы — оптимальный путь привлечения ребенка к обучению. Увлекаясь игрой со словесным материалом, в том числе скороговорками, дети сами того не замечая, сформируют ряд очень важных навыков, которые со временем
        <br/>{'     '}•	лягут в основу четкой размеренной речи
        <br/>{'     '}•	помогут быстро освоить чтение/
        <br/>{'     '}Каждый ребенок индивидуален. Общее и речевое развитие детей одного возраста может иметь некоторые различия. В таблице внизу приводится ориентировочный порядок усвоения детьми звуков русского языка
        <br/><img src={'home_tutor_ton_1.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}<b style={{color: 'red'}}>Важно: если в 6 лет ребенок имеет речевые проблемы, например, не произносит некоторые звуки, родителям необходимо обратиться к логопеду</b>
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}>Скороговорки для развития речи и дикции у детей</p>
        <br/><br/><img src={'home_tutor_ton_2.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}Сложные скороговорки для детей — самая занимательная игра. Скороговорки — это не только замечательное фольклорное наследие, но и любимый инструмент большинства логопедов
        <br/>{'     '}Скороговорки:
        <br/>{'     '}•	эффективно тренируют артикуляцию звуков
        <br/>{'     '}•	способствую приобретению навыков правильной речи
        <br/>{'     '}•	исправляют дефекты речи
        <br/>{'     '}•	избавляют от косноязычия
        <br/>{'     '}•	развивают фонематический слух, ведь чтобы воспроизвести фразу ребенок должен ее правильно услышать.
        <br/>{'     '}Чем раньше  начать рассказывать малышу скороговорки и чистоговорки, тем быстрее он научится слушать и слышать различные звуковые сочетания, а со временем попытается повторить их самостоятельно
        <br/>{'     '}Прежде чем начать «скороговорить» для благодарной публики, примите во внимание несколько полезных советов:
        <br/>{'     '}1.	 Для начала проговорите скороговорку медленно, попробуйте ее «на вкус», чтобы правильно запомнить все звуковые комбинации. Задача на этом этапе: научится четко произносить каждый звук каждого слова. Если вы учите скороговорку вместе с ребенком, придерживайтесь того же правила: медленно и четко проговаривайте каждое слово. Важно:
        <br/>{'     '}•	Не ждите, что малыш повторит все и сразу
        <br/>{'     '}•	Не злитесь, если результат будет отличаться от ожидаемого
        <br/>{'     '}•	Время занятия для ребенка: 5-10 минут (в зависимости от возраста ребенка)
        <br/>{'     '}•	Количество занятий: не ограничено
        <br/>{'     '}2.	 Скороговорки можно не только говорить. Их можно шептать и даже петь. Можно проговаривать с разными интонациями и в разных «стилях». Главное при этом — четкое произношение всех звуков и звукосочетаний. Внимательно следите за этим
        <br/>{'     '}3.	 Когда вы полностью уверены в четкости произношения всех слов, можете попробовать проговорить витиеватое предложение максимально быстро. Порадуйте себя и ребенка!
        <br/><br/><img src={'home_tutor_ton_3.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}Чем сложнее скороговорка, тем интереснее ее выучить
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на букву «ш» для детей</b></p>
        <br/>{'     '}Правильная артикуляция звука [ш] должна выглядеть следующим образом:
        <br/>{'     '}[Ш] – это согласный, глухой, твёрдый звук. При произнесении этого звука происходит следующее: губы выдвигаются вперед, а кончик языка поднят к небу (ближе к передним верхним зубам), но не касается их, образуя щель. Боковые края языка прижимаются к верхним корнным зубам, не пропуская по бокам струю выдыхаемого воздуха, который и образует звук [Ш].
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Чистоговорки со звуком [ш]</b></p>
        <br/><br/><img src={'home_tutor_ton_4.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_5.jpg'} style={{width: '100%'}}/>
        <span>
          <div style={{display: 'inline-block', width: '50%'}}>
            {'     '}•	Ша-ша-ша — мама моет малыша
            <br/>{'     '}•	Ша-ша-ша — мама кормит малыша
            <br/>{'     '}•	Ша-ша-ша — мама любит малыша
            <br/>{'     '}•	Ша-ша-ша — мы качаем малыша
            <br/>{'     '}•	Шу-шу-шу — я письмо пишу
            <br/>{'     '}•	Шу-шу-шу — шарф повяжем малышу
            <br/>{'     '}•	Шу-шу-шу — шапку свяжем малышу
          </div>
          <div style={{display: 'inline-block', width: '50%'}}>
            {'     '}•	Шо-шо-шо — на прогулке хорошо
            <br/>{'     '}•	Шо-шо-шо — в нашем доме хорошо
            <br/>{'     '}•	Шо-шо-шо — летом в парке хорошо
            <br/>{'     '}•	Аш-аш-аш — у (имя ребенка) карандаш
            <br/>{'     '}•	Аш-аш-аш — мы доделали шалаш
            <br/>{'     '}•	Ши-ши-ши — что-то шепчут камыши
          </div>
        </span>
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Веселые скороговорки-стишки</b></p>
        <br/><br/><img src={'home_tutor_ton_6.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Детские стихи с [ш]</b></p>
            <br/>{'     '}Мышонку шепчет мышь:
            <br/>{'     '}«Ты все шуршишь, не спишь».
            <br/>{'     '}Мышонок шепчет мыши:
            <br/>{'     '}«Шуршать я буду тише».
            <br/>{'     '}Маша кашу не доела,
            <br/>{'     '}Маше каша надоела!
            <br/>{'     '}— Маша, кашу доедай!
            <br/>{'     '}Маме не надоедай!
            <br/>{'     '}— Кошка в штанишках?
            <br/>{'     '}— В штанишках не кошках.
            <br/>{'     '}— Мошка в штанишках?
            <br/>{'     '}— В штанишках не мошка.
            <br/>{'     '}— Мышка в штанишках?
            <br/>{'     '}— В штанишках не мышка.
            <br/>{'     '}— Мишка в штанишках?
            <br/>{'     '}— В штанишках Мишка!
            <br/>{'     '}Яша кушал кашу,
            <br/>{'     '}Антошка — картошку,
            <br/>{'     '}Гошка — окрошку,
            <br/>{'     '}Лешка — лепешку,
            <br/>{'     '}Валюшка — ватрушку,
            <br/>{'     '}Иришка — пышку,
            <br/>{'     '}Танюшка — плюшку,
            <br/>{'     '}А Мишель ел вермишель!
            <br/>{'     '}У Мишутки в лукошке
            <br/>{'     '}Мыши, лягушки, кошки,
            <br/>{'     '}Шарики, шайбы, катушки,
            <br/>{'     '}Клавиши, шторы, подушки,
            <br/>{'     '}Кувшины, горшки, матрешки,
            <br/>{'     '}Швабры, шкафы, поварешки,
            <br/>{'     '}Машины, шурупы, ракушки…
            <br/>{'     '}Игрушки, игрушки, игрушки
            <br/>{'     '}Шапка — на Колюше,
            <br/>{'     '}Шляпа — на Андрюше,
            <br/>{'     '}Ушанка — на Грише,
            <br/>{'     '}Галоши — на Мише,
            <br/>{'     '}Башмаки — на Витюше,
            <br/>{'     '}Капюшон — на Валюше,
            <br/>{'     '}Шинель — на Игоряше,
            <br/>{'     '}Рубашка — на Любаше,
            <br/>{'     '}Шлем — на Кирюше,
            <br/>{'     '}Шарф — на Катюше,
            <br/>{'     '}Кашне — на Алеше,
            <br/>{'     '}Штаны — на Платоше,
            <br/>{'     '}Шуба — на Илюше,
            <br/>{'     '}Шорты — на Ванюше.
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на букву «ш» для детей</b></p>
        <br/><br/><img src={'home_tutor_ton_7.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}•	Кошка на окошке шьёт рубашку для Ермошки
        <br/>{'     '}•	Леша и Глаша едят пшеничную кашу
        <br/>{'     '} •	Тимошка Трошке крошит в окрошку крошки
        <br/>{'     '}•	Шли шестнадцать мышей, несли шестнадцать грошей, две мыши поплоше несли по два гроша
        <br/>{'     '}•	Яшма в замше замшела
        <br/>{'     '}•	Шапкой Миша шишку сшиб
        <br/>{'     '}•	В шалаше шесть шалунов
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на букву «щ» для детей</b></p>
        <br/>{'     '}Прежде всего, ознакомьтесь с правильной артикуляцией звука [щ]:
        <br/>{'     '}Звук [Щ] очень похож на [Ш], только в мягкой исполнении. Широкий язычок так же поднят вверх и по форме напоминает «чашечку», её боковые края крепко прижаты к верхним коренным зубам. Между кончиком языка и твердым нёбом возле верзхних резцов остаётся узкая щель, к которую просачивается тёплым воздух. Губы вытянуты вперёд трубочкой. В чём же тогда отличие? На звуке [Щ] мышцы языка и губ более напряжены, особенно боковые края языка: они с силой упираются в верхние коренные зубы.
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Чистоговорки со звуком [щ]</b></p>
        <br/>{'     '}•	Аща-аща-аща — впереди густая чаща
        <br/>{'     '}•	Ащ-ащ-ащ — мы купили плащ
        <br/>{'     '}•	Ащу-ащу-ащу — не ходите дальше в чащу
        <br/>{'     '}•	Ещ-ещ-ещ — в сетях бьется лещ
        <br/>{'     '}•	Ещ-ещ-ещ — на собаке клещ
        <br/>{'     '}•	Оща-оща-оща — шумит дубовая роща
        <br/>{'     '}•	Ощ-ощ-ощ — в огороде хвощ
        <br/>{'     '}•	Ощу-ощу-ощу — берегите рощу
        <br/>{'     '}•	Ущ-ущ-ущ — за забором плющ
        <br/>{'     '}•	Ща-ща-ща — мы несем домой леща
        <br/>{'     '}•	Ща-ща-ща — пояс от плаща
        <br/>{'     '}•	Ще-ще-ще — (имя ребенка) в плаще
        <br/>{'     '}•	Щё-щё-щё — повторим ещё
        <br/>{'     '}•	Щи-щи-щи — (имя ребенка) любит щи
        <br/>{'     '}•	Щу-щу-щу — (имя ребенка) я ищу
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Занимательные стишки</b></p>
        <br/><br/><img src={'home_tutor_ton_8.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Стихи-скороговорки на букву «Щ» для детей</b></p>
        <br/>{'     '}Хлещет, хлещет дождь,
        <br/>{'     '}Скрылся волк под хвощ.
        <br/>{'     '}Хвост под хвощом,
        <br/>{'     '}А сам под дождем
        <br/>{'     '}Щеголь щетку уважает,
        <br/>{'     '}Щеткой щеголь пыль счищает.
        <br/>{'     '}Если вещь не вычищать,
        <br/>{'     '}Нечем будет щеголять!
        <br/>{'     '}Плавниками трепеща,
        <br/>{'     '}И зубаста и тоща,
        <br/>{'     '}Пищи на обед ища,
        <br/>{'     '}Ходит щука круг леща.
        <br/>{'     '}Вот так штука!
        <br/>{'     '}Тщетно тщится щука
        <br/>{'     '}Ущемить леща.
        <br/>{'     '}Вот так штука!
        <br/>{'     '}Банщик, литейщик, купальщик,
        <br/>{'     '}Гонщик, дробильщик, ныряльщик,
        <br/>{'     '}Мойщик, лудильщик, трамвайщик,
        <br/>{'     '}Щеголь, денщик, барабанщик,
        <br/>{'     '}Пильщик, ямщик, фехтовальщик
        <br/>{'     '}Тащили дощатый ящик.
        <br/>{'     '}В ящике — щебенка, щетки,
        <br/>{'     '}Клещи, счеты и трещотки
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на букву «Щ» для детей</b></p>
        <br/><br/><img src={'home_tutor_ton_9.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}•	Щуку я тащу, тащу, щуку я не отпущу
        <br/>{'     '}•	Не тот, товарищи, товарищу товарищ, кто при товарищах товарищу товарищ, а тот, товарищи, товарищу товарищ, кто без товарищей товарищу товарищ
        <br/>{'     '}•	Волки рыщут, пищу ищут
        <br/>{'     '}•	Чешуя у щучки, щетинка у чушки
        <br/>{'     '}•	Тщетно тщится щука ущемить леща
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на букву «л» для детей</b></p>
        <br/>{'     '}Звук [л] наравне со звуком [р] — самые коварные и труднопроизносимые. Именно поэтому допустимая возрастная норма для самостоятельного освоения этих звуков — 5 лет
        <br/>{'     '}Правильная артикуляция [л] выглядит следующим образом:
        <br/>{'     '}Звуки [Л], [Л’] можно вызвать по подражанию. Взрослый вместе с ребёнком садится к зеркалу и показывает правильную артикуляция звука [Л]: широкий кончик языка поднят и прижат к нёбу у самого основания верхних резцов; в средней части языка опущен вниз, а корень языка приподнят к мягкому нёбу; боковые края языка опущены с обеих сторон, выдыхаемый воздух проходит по ним вбок, в щёки (если дотронуться ладонями до щёк, можно ощутить их вибрацию).
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Чистоговорки на букву «л» для детей</b></p>
        <br/><br/><img src={'home_tutor_ton_10.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_11.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}•	Ул-ул-ул — наш малыш уснул
        <br/>{'     '}•	Ол-ол-ол — (имя ребенка) сел/села за стол
        <br/>{'     '}•	Ло-ло-ло — нам вместе весело
        <br/>{'     '}•	Ыл-ыл-ыл — я машину мыл
        <br/>{'     '}•	Ла-ла-ла — отвесная скала
        <br/>{'     '}•	Лу-лу-лу — обойдем скалу
        <br/>{'     '}•	Ле-ле-ле — гнезда на скале
        <br/>{'     '}•	Лю-лю-лю — (имя ребенка) я люблю
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Стихи-скороговорки на букву «л» для детей</b></p>
        <br/><br/><img src={'home_tutor_ton_12.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_13.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}Лунный свет голубой
        <br/>{'     '}Спать ослу не давал,
        <br/>{'     '}Сел осел на валун
        <br/>{'     '}И зевал, и зевал…
        <br/>{'     '}И случайно осел
        <br/>{'     '}Проглотил вдруг луну,
        <br/>{'     '}Улыбнулся, вздохнул —
        <br/>{'     '}И спокойно уснул<br/>{'     '}Лисицы лают, глухомань.
        <br/>{'     '}Лежит в листве под липой лань.
        <br/>{'     '}Линь в глубине холодных вод
        <br/>{'     '}Лениво, но легко плывет.
        <br/>{'     '}Луна лучиться, как латунь,
        <br/>{'     '}Лягушкой лакомится лунь.
        <br/>{'     '}Летит веселая пчела,
        <br/>{'     '}Легла на лес ночная мгла
        <br/>{'     '}Топали до тополя.
        <br/>{'     '}Дотопали до тополя.
        <br/>{'     '}До тополя дотопали,
        <br/>{'     '}Да ноги-то оттопали
        <br/>{'     '}Куклу Милу Люда мыла,
        <br/>{'     '}С куклы грязи не отмыла.
        <br/>{'     '}Но от мыла кукла Мила
        <br/>{'     '}Полиняла, как могла.
        <br/>{'     '}От обиды куклу Люда
        <br/>{'     '}Обменяла на осла.
        <br/>{'     '}Мила маме, как могла,
        <br/>{'     '}Хоть мала, но помогла.
        <br/>{'     '}Долго дела не искала:
        <br/>{'     '}Полотенце полоскала,
        <br/>{'     '}Вилки вымыла и ложки,
        <br/>{'     '}Молоком поила кошку,
        <br/>{'     '}Пол метелкой подмела
        <br/>{'     '}От угла и до угла…
        <br/>{'     '}Отдохнуть она хотела —
        <br/>{'     '}Не могла сидеть без дела:
        <br/>{'     '}Лоскуты нашла на полке,
        <br/>{'     '}И булавки, и иголки,
        <br/>{'     '}И для куклы Мила стала
        <br/>{'     '}Платье шить и одеяло.
        <br/>{'     '}Хлопотунью эту Милу
        <br/>{'     '}Мама еле уложила
        <br/>{'     '}Зря ласка лаской названа:
        <br/>{'     '}Совсем не ласкова она.
        <br/>{'     '}У ласки злые глазки.
        <br/>{'     '}Не жди от ласки ласки!
        <br/>{'     '}<br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на звук [л] для детей</b></p>
        <br/><br/><img src={'home_tutor_ton_14.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}•	Клава клала лук на полку
        <br/>{'     '}•	Вкусная халва — мастеру хвала
        <br/>{'     '}•	Около кола колокола
        <br/>{'     '}•	Лайка — на лавке. У лайки лапки. На лапках — лапти
        <br/>{'     '}•	Поле не полото, поле не полито. Надо полю-то попить, надо поле-то полить
        <br/>{'     '}•	Летели лебеди с лебедятами
        <br/>{'     '}•	Сел сокол на гол ствол
        <br/><br/><img src={'home_tutor_ton_15.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}
        <br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки на букву «р» для детей</b></p>
        <br/>{'     '}Особенности артикуляции звука [р]
        <br/>{'     '}Кончик языка касается бугорков за верхними зубами. Боковые края языка прижаты к верхним коренным зубам. Форма языка напоминает ложечку. Под напором выдыхаемого воздуха кончик языка дрожит. Голосовые связки работают, горло дрожит (есть голос).
        <br/>{'     '}Особенности артикуляции [р']
        <br/>{'     '}Губы немного растянуты. Передняя часть языка касается бугорков за верхними зубами или верхних зубов. Боковые края языка прижаты к верхним коренным зубам. Спинка языка приподнята. Язык напряжён. Под напором выдыхаемого воздуха кончик языка дрожит. Голосовые связки работают, горло дрожит (есть голос).
        <br/>{'     '}
        <br/><p style={{textAlign: 'center', margin: '0px'}}><b>Чистоговорки со звуком [р]</b></p>
        <br/><br/><img src={'home_tutor_ton_16.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_17.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}•	Ре-ре-ре — все деревья в серебре
        <br/>{'     '}•	Ре-ре-ре — хитрый лис сидит в норе
        <br/>{'     '}•	Ря-ря-ря — взошла алая зоря
        <br/>{'     '}•	Рю-рю-рю — я обед тебе сварю
        <br/>{'     '}•	Арь-арь-арь — скушай, деточка, сухарь
        <br/>{'     '}•	Ра-ра-ра — (имя ребенка) спать пора
        <br/>{'     '}•	Ро-ро-ро — на полу стоит ведро
        <br/>{'     '}•	Ры-ры-ры — кружат-кружат комары
        <br/>{'     '}•	Ор-ор-ор — подмели мы двор
        <br/>{'     '}
        <br/><p style={{textAlign: 'center', margin: '0px'}}><b>Стихи-скороговорки на букву «р» для детей</b></p>
        <br/>{'     '}Приготовила Раиса
        <br/>{'     '}Для Бориса суп из риса
        <br/>{'     '}Подарил Борис Раисе
        <br/>{'     '}Тридцать три и три ириса
        <br/>{'     '}Страусы строят гнезда в сторонке.
        <br/>{'     '}Странными смотрятся эти воронки.
        <br/>{'     '}Ямы в песке роют быстро и просто
        <br/>{'     '}Стройные птицы высокого роста
        <br/>{'     '}На корме, кроме Ромки,
        <br/>{'     '}Егор и Артемка.
        <br/>{'     '}На корме, кроме Марка,
        <br/>{'     '}Рита и Тамарка.
        <br/>{'     '}— Кар! — кричит ворона — Кража!
        <br/>{'     '}Караул! Грабеж! Пропажа!
        <br/>{'     '}Вор прокрался утром рано!
        <br/>{'     '}Брошь украл он из кармана!
        <br/>{'     '}Карандаш! Картонку! Пробку!
        <br/>{'     '}И красивую коробку.
        <br/>{'     '}— Стой, ворона, не кричи!
        <br/>{'     '}Не кричи ты, помолчи.
        <br/>{'     '}Жить не можешь без обмана:
        <br/>{'     '}У тебя ведь нет кармана!
        <br/>{'     '}— Как?! — подпрыгнула ворона
        <br/>{'     '}И моргнула удивленно.
        <br/>{'     '}— Что ж вы раньше не сказали?
        <br/>{'     '}Караул! Карман украли!
        <br/>{'     '}
        <br/>{'     '}У костра под горкой
        <br/>{'     '}Верочка с Егоркой.
        <br/>{'     '}Верочка с Егоркой
        <br/>{'     '}Твердят скороговорки.
        <br/>{'     '}Разговор у них проворный,
        <br/>{'     '}Быстрый и скороговорный:
        <br/>{'     '}«Марширует офицер,
        <br/>{'     '}Рапортует инженер,
        <br/>{'     '}Разгорается костер», —
        <br/>{'     '}Рады Вера и Егор
        <br/>{'     '}Ружье, заряженное пробкой,
        <br/>{'     '}Ёрш подарил рыбешке робкой.
        <br/>{'     '}С тех пор драчливый черный рак
        <br/>{'     '}Не затевает с нею драк
        <br/>{'     '}
        <br/><p style={{textAlign: 'center', margin: '0px'}}><b>Скороговорки со звуком [р]</b></p>
        <br/>{'     '}•	Артем трет на терке морковь
        <br/>{'     '}•	Брадобрей бритвой бреет бороды
        <br/>{'     '}•	Все бобры добры к своим бобрятам
        <br/>{'     '}•	Кобры — в террариуме, а карпы — в аквариуме
        <br/>{'     '}•	Рыбы в пруду — пруд пруди
        <br/>{'     '}•	Тридцать три трубача трубят тревогу
        <br/>{'     '}•	Трое трубачей трубили в трубы
        <br/>{'     '}•	Редиску в окрошку режет Серёжка
        <br/>{'     '}•	Марина грибы мариновала, Марина малину перебирала
        <br/>{'     '}•	Три дроворуба на трех дворах дрова рубят
        <br/>{'     '}•	Вчерашний град повредил виноград
        <br/>{'     '}•	Тридцать три корабля лавировали, лавировали, да не вылавировали
        <br/>{'     '}•	Квартира картографа в картах, а портретиста в портретах
        <br/>{'     '}•	Наш чеботарь
        <br/>{'       '}Всем чеботарям чеботарь,
        <br/>{'       '}Никому нашего чеботаря
        <br/>{'       '}Не перечеботарить
        <br/>{'     '}•	Петр Петрович,
        <br/>{'       '}По прозванью Перепелович,
        <br/>{'       '}Приручил перепелку.
        <br/>{'       '}Перепелка принесла
        <br/>{'       '}Петру Петровичу
        <br/>{'       '}Перепеловичу перепелят
        <br/>{'     '}•	Собирала Маргаритка маргаритки на горе,
        <br/>{'       '}Растеряла Маргаритка маргаритки на траве
        <br/>{'     '}•	Откуда на просеке просо?
        <br/>{'       '}Просыпали просо здесь просто.
        <br/>{'       '}Про просо просянки прознали.
        <br/>{'       '}Без спроса все просо склевали.
        <br/><br/><img src={'home_tutor_ton_18.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_19.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_20.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_21.jpg'} style={{width: '100%'}}/>
        <br/><br/><img src={'home_tutor_ton_22.jpg'} style={{width: '100%'}}/>
        <br/>{'     '}Источник. http://heaclub.ru/skorogovorki-dlya-detej-dlya-razvitiya-rechi-i-dikcii-po-godam-skorogovorki-dlya-detej-na-bukvy-r-l-sh-shh
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent title={'Скороговорки'} data={data}/>
    );
  }
}

export default TongueTwisters;
