import React from 'react';

import BaseTextComponent from '../shared/BaseTextComponent';

class QuestionsForChildSix extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}1.Как тебя зовут?(имя, фамилия)
        <br/>{'     '}2.Сколько тебе лет? Сколько было в прошлом году?( будет через год?)
        <br/>{'     '}3. Где ты живешь?(полный адрес)
        <br/>{'     '}4. Как зовут папу, маму?(имя, отчество)
        <br/>{'     '}5.Какое сейчас время года? Какое время года было перед весной, какое будет после?
        <br/>{'     '}6.Уметь считать до 10 и обратно.
        <br/>{'     '}7.Назвать геометрические фигуры(круг, треугольник, квадрат, прямоугольник, овал, ромб, трапеция)
        <br/>{'     '}8.Назвать основные и оттеночные цвета.
        <br/>{'     '}9.Уметь назвать предметы после их перечисления одним обобщающим словом( одежда, обувь, овощи…).
        <br/>{'     '}10.Ориентироваться в пространстве (лево, право).
        <br/>{'     '}11.Показывать левой рукой правое ухо, правой рукой левый глаз.
        <br/>{'     '}12.Назвать приемы пищи( утром мы завтракаем, а вечером….)
        <br/>{'     '}13.Ориентироваться в частях суток (что наступает после ночи и т.д.), днях недели(какой день недели был перед субботой, наступит после воскресенья и т.д.)
        <br/>{'     '}14.Уметь найти четвертый лишний. Объяснить почему.
        <br/>{'     '}15. Понимать значение предлогов. Где лежит предмет(на, за, в, под, около), откуда достали предмет(из-под, из-за).
        <br/>{'     '}16. Уметь повторить скороговорку без ошибок.
        <br/>{'     '}17.Уметь повторить слово со сложнослоговой структурой(термометр, балерина, аквариум, велосипедист, мотоциклист, бульдозерист, регулировщик  и т. д.)
        <br/>{'     '}18.Объяснить значение слов( что такое холодильник, пылесос, мармелад, аквариум…).
        <br/>{'     '}19.Уметь назвать и показать часть предмета( донышко, носик, крышка, ручка у чайника и т.д.).
        <br/>{'     '}20. Сказать ласково: Лена- Леночка, гриб- грибочек, стул- стульчик…  .
        <br/>{'     '}21.Уметь подобрать антонимы и составить пары: широкий- узкий, глубоко- мелко, старый- молодой, твердый- мягкий и т.д.
        <br/>{'     '}22.Уметь образовать прилагательные (из дерева- деревянный, из кожи – кожаный, из стекла-…, из шелка-…., из пластмассы-… и т.д.).
        <br/>{'     '}23.Что делают представители разных профессий( строят, учат, лечат и т.д.).
        <br/>{'     '}24.Назвать съедобные и ядовитые грибы.
        <br/>{'     '}25. Назвать верхнюю, нижнюю одежду, женскую, мужскую, детскую, летнюю, зимнюю, демисезонную. Части одежды( полочки, спинка, рукава, манжеты, воротник – рубашка).
        <br/>{'     '}26. Назвать домашнюю, спортивную, зимнюю обувь. Что такое ласты?
        <br/>{'     '}27.Назвать кухонную, столовую, чайную посуду. Что такое фарфор?
        <br/>{'     '}28.Как назвать магазины, в которых продают овощи, продукты, обувь?
        <br/>{'     '}29.Назвать молочные, мясные, кондитерские продукты. Что такое меню?
        <br/>{'     '}30.Образовать название профессии от музыкального инструмента( гитара- гитарист, пианино-пианист, труба- трубач и т.д.)
        <br/>{'     '}31.Чем отличается трубач от трубочиста?
        <br/>{'     '}32.Назвать несколько игрушек, школьных принадлежностей. Что такое глобус?
        <br/>{'     '}33.Назвать зимние забавы детей и зимние виды спорта.
        <br/>{'     '}34.Что такое вьюга, метель, гололед?
        <br/>{'     '}35.Какой веселый праздник отмечают зимой? Что такое хоровод, гирлянда?
        <br/>{'     '}36. Уметь назвать основные части тела человека.
        <br/>{'     '}37. Что с чем соединяет шея, сколько у человека ушей, носов, щек, губ…?
        <br/>{'     '}38. Уметь ориентироваться в комнате: где потолок, с какой стороны окна, что такое линолеум? Отличать тюль и шторы.
        <br/>{'     '}39. Уметь назвать одним словом все предметы мебели.В каком магазине она продается?
        <br/>{'     '}40.Назвать дом в 5 этажей- пятиэтажный, в 9-…, в 3-…, в 2-…, в 1-… .
        <br/>{'     '}41. Знать назначение чердака, кладовки, сарая, бани, колодца.
        <br/>{'     '}42. Назвать, в какой стране мы живем, столицу Родины, большие города Беларуси. Кто у нас в стране президент?
        <br/>{'     '}43.Уметь назвать транспорт( водный, воздушный, наземный, специальный).
        <br/>{'     '}44. Уметь образовать военные профессии. Кто охраняет границу? Кто на боевом корабле? Кто на ракетной установке?
        <br/>{'     '}45. Уметь назвать первый и последний звук в словах типа: Оля, зима, конь.
        <br/>{'     '}46. Уметь назвать все звуки по порядку в словах типа: рыба, школа, шкаф.
        <br/>{'     '}47.Уметь выразительно рассказывать стихотворение.
        <br/>{'     '}48. Кто как голос подает? (лошадь- ржет, собака, корова, утка, гусь, курица, индюк, петух, кукушка, ворона, воробей, сорока).
        <br/>{'     '}49.Уметь образовывать названия детенышей животного от названий животного(птицы): утка- утенок, овца- ягненок, лошадь – жеребенок… .
        <br/>{'     '}50.Чем отличается птица от животного?
        <br/>{'     '}51. Чем отличается кукла от девочки? Чем отличается самолет от птицы?
        <br/>{'     '}52.Уметь правильно изменять окончания при пересчете до 5( ухо, ведро, пчела, воробей, окно).
        <br/>{'     '}53. Назвать чего нет( стул- стула, ведро, ухо, окно…).
        <br/>{'     '}54.Назвать инструменты. Для чего нужны: коса, молоток, рубанок, пила?
        <br/>{'     '}55.Назвать 5-6 видов спорта. Что такое стадион?
        <br/>{'     '}56.Уметь образовывать названия спортсмена по виду спорта( бокс- боксер)
        <br/>{'     '}57.Сравнить дерево и куст. Что такое чаща леса, опушка, березовая роща, дубрава, ельник. Что такое сучок, пень.
        <br/>{'     '}58. На каком дереве растут желуди, котики, шишки?
        <br/>{'     '}59.Назвать 4-5 названий ягод
        <br/>{'     '}60. Как называются жилища животных, кто где зимует?
        <br/>{'     '}61.Назвать зимующих и перелетных птиц. Почему птицы улетают на юг?
        <br/>{'     '}62.Назвать домашних птиц. Какую пользу они приносят?
        <br/>{'     '}63.Как называются птенцы домашних (диких) птиц?
        <br/>{'     '}64.Назвать домашних животных. Кто какую пользу приносит?
        <br/>{'     '}65.Назвать диких животных: 1) наших лесов; 2) южных стран; 3) севера.
        <br/>{'     '}66.Кто такие хищники, травоядные.
        <br/>{'     '}67.Сосчитать, сколько животных за забором, если видны только лапы.
        <br/>{'     '}68. Пингвин – животное или птица? Почему?
        <br/>{'     '}69. Каких птиц можно назвать водоплавающими?
        <br/>{'     '}70. Какие птицы не умеют летать? Почему?
        <br/>{'     '}71.Отвечать на вопросы по установлению родственных отношений. (Кто ты маме, папе, дедушке, брату. Кто мама папе, мама бабушке? Кто такая мамина мама?)
        <br/>{'     '}72.Назвать 4-5 электроприборов.
        <br/>{'     '}73. Уметь образовывать существительные с суффиксами: жук- жучок- жучище и т.д.
        <br/>{'     '}74.Назвать приметы весны. Что такое ледоход, капель, проталина?
        <br/>{'     '}75. Какие птицы прилетают первые, какие первые цветы появляются в лесу?
        <br/>{'     '}76.Назвать 5-6 названий цветов. Что есть у цветка? (стебель, корень…)
        <br/>{'     '}77. Уметь назвать 5-6 рыб, насекомых.
        <br/>{'     '}78. Назвать, чем отличается кормушка от скворечника, гнездо от улья.
        <br/>{'     '}79. Назвать предметы, про которые можно сказать: мой, моя, мое.
        <br/>{'     '}80. Уметь составить цепочку из слов, где последний звук в слове будет первым в следующем слове( рак- кот- туча- апельсин…)
        <br/>{'     '}81. Уметь составить рассказ по сюжетному ряду из 3-6 картинок.
        <br/>{'     '}82. Уметь делить слова на слоги.
        <br/>{'     '}83. Назвать и сосчитать гласные звуки в словах( пух, нога…)
        <br/>{'     '}84. Какие праздники отмечают 8Марта, 1 января?
        <br/>{'     '}85. Объяснить значение выражений: золотые руки, каменное сердце…
        <br/>{'     '}86. Составить предложение и сосчитать в нем количество слов.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent data={data} title={'На какие вопросы должен уметь отвечать ребенок 6 лет'}/>
    );
  }
}

export default QuestionsForChildSix;
