import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class Habits extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Привычка — это приобретённая манера. Она имеет пассивный характер и возникает в результате повторения действий, которые постепенно становятся бессознательными и механическими. Чтобы возникла привычка, важна заинтересованность личности: мы никогда не привыкаем полностью к неприятной нам вещи, но зато охотно привыкаем к вещи приятной.
        <br/>{'     '}Мы часто смешиваем привычку с устоями социальной жизни (традициями, обычаями) и противопоставляем её человеческой природе. Но закон нормальной социальной жизни состоит в формировании привычек, которые гармонируют с человеческой природой.
        <br/>{'     '}Привычки формируются в повседневной жизни и разрушаются с большим трудом. Постоянное повторение некоторых действий становится для человека потребностью, и он уже не представляет себя без этой привычки.
        <br/>{'     '}А что думают по этому поводу дети? Ведь именно их привычки так беспокоят родителей и педагогов. Четвероклассники, например, считают, что привычка — это:
        <br/>{'     '}✓ дела, которые как будто привязаны к тебе;
        <br/>{'     '}✓	когда человек к чему-то привыкает и не может отвыкнуть;
        <br/>{'     '}✓	слова и действия, которые мы очень часто повторяем и которые стали уже близки нам;
        <br/>{'     '}✓	то, от чего человек не может оторваться;
        <br/>{'     '}✓	то, что человек любит делать;
        <br/>{'     '}✓	дело, которое просто не можешь не сделать.
        <br/>{'     '}
        <br/>{'     '}<b>Как действуют привычки?</b>
        <br/>{'     '}Привычка упрощает наши движения, делает их более точными и уменьшает вызываемую ими усталость. Человек с рождения стремится производить максимальное количество действий, для которых у него не хватает готовых приспособлений. Если бы наши действия от многократного повторения не входили в привычку, никакой прогресс в развитии не был бы возможен. Человек мог бы целыми днями одеваться и раздеваться, сосредотачивать на гигиене всё внимание и энергию. Застегнуть пуговицу или вымыть руки ему в каждом отдельном случае было бы так же трудно, как ребёнку бывает трудно сделать это в первый раз. Вспомните, с каким трудом ребёнок учится, к примеру, завязывать шнурки. И как легко и быстро затем он учит этому младших ребятишек.
        <br/>{'     '}Учась плавать, кататься на коньках, играть на музыкальном инструменте, мы производим массу ненужных движений или фальшивых звуков. Но как только овладеем тем или иным искусством, движения сами следуют одно за другим и мы достигаем цели, прилагая меньше усилий. Так, пианист окидывает взглядом нотную запись — и сейчас же благодаря его умению начинает литься мелодия.
        <br/>{'     '}Многим, наверное, знакомы курьёзные ситуации, когда, сняв с руки часы раньше обычного, вечером мы вновь собираемся их снимать. Или, подойдя к дверям дома своих знакомых, машинально берём в руки ключ от собственной квартиры.
        <br/>{'     '}Если человек не выполнил привычного действия (например, не вымыл руки перед едой, не убрал рабочее место), он ощущает некоторое беспокойство, психологический дискомфорт. Ему кажется, что чего-то не хватает, что он что-то забыл, что-то не доделал и т. д.
        <br/>{'     '}Американский психолог Уильям Джемс отмечает, что у большинства людей к 30 годам характер становится устойчивым. В период между 20 и 30 годами идёт активное формирование интеллектуальных и профессиональных привычек, а в возрасте до 20 лет устанавливаются интонация голоса и произношение, жестикуляция, телодвижения. Люди, изучившие иностранный язык после 20 лет, почти всегда говорят с акцентом. Мы должны стараться сделать так, чтобы у детей формировалось как можно больше полезных привычек и не укоренялись вредные.
        <br/>{'     '}
        <br/>{'     '}«Человек привычки» — «человек воли» — «человек НРАВСТВЕННЫЙ»
        <br/>{'     '}Личность ребёнка — это сумма его привычек. Интересно мнение психолога В. М. Орлова о том, что при правильном воспитании в каждой личности уживаются “человек привычки”, “человек воли” и “человек нравственный “.
        <br/>{'     '}У “человека привычки” воля молчит, спит, поведение его очень напоминает поведение “механического человека”. Окружающие предметы подталкивают к определённым действиям, человек не принимает каких-то решений, не управляет собой. Вот как это может происходить. Зашёл человек на кухню, увидел на тарелке пирожок и съел его, хотя и не был голоден. Собираясь рисовать, он заметил, что карандаши плохо заточены, переключил своё внимание с рисунка на затачивание карандашей и увлёкся этим. Раздался телефонный звонок, и человек долго беседовал с приятелем. Вечером, наведя будильник на семь часов, человек решил, что утром, на свежую голову, начнёт писать сочинение (к которому намеревался приступить в течение всей недели). И все мы уже поняли, что этот человек имеет много различных привычек, кроме привычки вовремя начинать работать.
        <br/>{'     '}“Человек привычки” живёт в каждом и, с одной стороны, облегчает нашу жизнь, а с другой — затрудняет её.
        <br/>{'     '}Мы обычно не даём проявляться своим привычкам, если они противоречат требованиям жизни. Например, ученику хочется посмотреть телевизор, но он идёт писать сочинение. Это воля преодолевает привычки своего хозяина ради достижения важных целей. Способность заставить себя делать то, что нужно, является проявлением “человека воли”. Но воля сама по себе не представляет ценности. Воля становится нравственной или безнравственной благодаря благородным или низким целям, которые побуждают её к действию. Значит, в каждом из нас находится не только “человек привычки” и “человек воли”, но ещё и “человек нравственный”.
        <br/>{'     '}
        <br/>{'     '}Какие бывают привычки?
        <br/>{'     '}При формировании привычек очень важное значение имеет положительный эмоциональный фон, с которым совершаются каждый раз действия.
        <br/>{'     '}У человека имеется способность привыкать к каким-либо действиям или чувствам. Например, кто-то привыкает рано ложиться спать, а кто-то поздно. Можно привыкнуть к определённому месту, одежде, играм.
        <br/>{'     '}Привычки бывают полезными и вредными, положительными и отрицательными, нейтральными, неприятными, пагубными, надоедливыми, просто раздражающими. Привычки, способствующие сохранению здоровья, считаются полезными. Например, чистить зубы, питаться в одно и то же время, ежедневно проветривать комнату. Привычки, наносящие вред здоровью, называются вредными: есть много сладостей, долго сидеть у телевизора, читать лёжа, разговаривать во время еды. Вредными эти привычки называются ещё и потому, что от них бывает очень трудно отказаться, так как они постепенно становятся необходимыми человеку. Последствия, которые наступают в результате их ограничения, настолько болезненны, что человек не может справиться с ними сам.
        <br/>{'     '}Допустим, ваш ребёнок привык поздно вставать по выходным, а вы начинаете будить его рано. Как он реагирует на это? Он ворчит, не хочет просыпаться, обижается, а когда встаёт, ещё долгое время ходит вялым. Однако, несмотря на это, он сможет справиться с подобным состоянием сам, без посторонней помощи. От таких привычек, как курение, употребление алкоголя и наркотиков, избавиться самому трудно. Поэтому необходимо воспитывать у ребёнка хорошие привычки и не поощрять то, что может привести к появлению плохих.
        <br/>{'     '}Устойчивость к вредным привычкам.
        <br/>{'     '}Вредные привычки есть у каждого из нас. Что же делает человека зависимым от них?
        <br/>{'     '}1.	Сиюминутное удовольствие для большинства людей гораздо важнее отдалённых последствий.
        <br/>{'     '}2.	Человек лишь иногда получает удовлетворение от своих действий. Поэтому он продолжает совершать их, надеясь всякий раз достичь удовольствия. Примером может служить человек, привыкший хрустеть суставами пальцев. Иногда это причиняет ему боль. В другой раз он испытывает удовольствие. Проблема в том, что всякий раз, когда человек делает это и получает удовольствие, он тем самым закрепляет свою привычку и избавиться от неё становится труднее.
        <br/>{'     '}3.	Человеку всегда свойственно из двух бед выбирать меньшую. Тот, кто привык опаздывать, ненавидит спешку, заставляющую его нервничать, напрягаться. Он скорее готов испытать на себе гнев человека, на встречу с которым он опоздал, чем перенести неудобства спешки.
        <br/>{'     '}
        <br/>{'     '}<b>Как контролировать привычки?</b>
        <br/>{'     '}Большинство людей называют вредную привычку слабостью. У них не хватает силы воли, чтобы справиться с ней. Такой подход к проблеме таит в себе опасность. Человек может использовать это для оправдания своей неспособности контролировать привычки.
        <br/>{'     '}<br/>{'     '}Самообладание — это вовсе не сила воли или ещё какая-то внутренняя сила. Человек не наследует самообладание при рождении. Это не черта характера, свойственная или не свойственная человеку. Самообладание — это своего рода искусство, которому следует учиться на протяжении всей жизни.
        <br/>{'     '}Рассмотрим четыре приёма, направленные на развитие самообладания, которые вы можете предложить своему ребёнку:
        <br/>{'     '}1.	Самоисследование. Чтобы ваш ребёнок научился понимать себя, он должен уметь наблюдать за собой. Предложите ему завести дневник и записывать в него всё, что имеет отношение к привычке, от которой он хотел бы избавиться. Пусть он подробно перечисляет обстоятельства, при которых совершает то или иное действие. Это поможет выделить сигналы, т. е. какие-то события, мысли, чувства, вызывающие привычку или, по крайней мере, как-то влияющие на неё.
        <br/>{'     '}2.	Самоуправление. Этот приём ориентирован на сигнал, о котором говорилось выше. Примером может служить человек, испытавший облегчение после того, как он преодолел страх. Ведь страх, волнение, беспокойство — самый распространённый сигнал для многих привычек и пристрастий. Вы можете предложить ребёнку ежедневно просматривать свои записи, чтобы избегать соответствующих сигналов или вовремя их прерывать.
        <br/>{'     '}3. Замена одного другим. Расскажите ребёнку, что ему гораздо легче будет преодолеть недоброе желание, если он попытается тут же найти удовлетворение в чём-то другом. Нужно переключиться на любое действие, несущее в себе положительный результат. Это один из основных принципов в стремлении избавиться от вредных привычек и приобрести полезные. Установите для ребёнка систему поощрений и наказаний. Когда он преодолеет желание поддаться плохой привычке, похвалите его. В этом случае он оказывается в выигрыше вдвойне. Во-первых, замечает положительные изменения в своём поведении, а во-вторых, получает награду, которую вы ему установили.
        <br/>{'     '}4. Предотвращение рецидива. Можно иногда услышать: “Избавиться от привычки легко. Начать снова ещё легче”. Чтобы этого не случилось, нужно научиться предвидеть и распознать искушение. Можно предварительно разработать для ребёнка план по избежанию искушения. Но самый лучший способ помочь ему не возвращаться к старым привычкам — выработать полезные, приносящие удовлетворение.
        <br/>{'     '}Ещё несколько слов о саморегуляции. Всем знаком кукольный театр. Для того чтобы куклы-марионетки двигались, человек дёргает за нити, привязанные к их рукам и ногам. Таким образом управляя марионеткой, можно передвигать её по сцене. Иногда про какого-нибудь человека в переносном смысле говорят, что он марионетка. Это значит, что он  безоговорочно подчиняется чьим-то приказам.
        <br/>{'     '}Вместе с ребёнком порассуждайте, какие люди похожи на марионеток, кто управляет поведением каждого человека. Вы придёте к выводу, что нет человека абсолютно свободного от условий, в которых он находится. Но сообразно с обстоятельствами человек сам управляет своим поведением, реализует его, т. е. действует произвольно.
        <br/>{'     '}Прочтите ребёнку вопросы, на которые он должен ответить “да” или “нет”. Если вы не уверены в объективности его ответа, дайте сами тот, который ближе к истине.
        <br/>{'     '}1.	Быстро ли тебя можно переубедить в чём-либо?
        <br/>{'     '}2.	Когда ты выполняешь задание на уроке, интересуешься ли, чем занимается твой сосед по парте?
        <br/>{'     '}3.	Трудно ли тебе переключиться с одного урока на другой?
        <br/>{'     '}4.	Склонен ли ты доводить до конца начатое дело, если предстоит другое, более интересное?
        <br/>{'     '}5.	Трудно ли тебе отказаться от неприятной привычки?
        <br/>{'     '}6.	Легко ли ты переходишь от одного дела к другому?
        <br/>{'     '}✓ Результат 3—5 баллов  значит, что в случае необходимости ребёнок сумеет отстоять свою точку зрения, но может признать и свою неправоту. Он способен противостоять вредным привычкам, заняв себя чем-то более полезным.
        <br/>{'     '}<b>Формирование полезных привычек</b>
        <br/>{'     '}Рассмотрим несколько заданий, направленных на самопознание и формирование полезных привычек.
        <br/>{'     '}
        <br/>{'     '}АНГЕЛ-ХРАНИТЕЛЬ ИЛИ ЧЁРТИК
        <br/>{'     '}В спокойной обстановке попросите ребёнка закрыть глаза, сосредоточиться и поговорите с ним. “Вспомни ситуацию, когда ты последний раз злился, не выполнил то, что было запланировано. В каждом из нас сидит “чёртик”, который уговаривает нас сделать что-то плохое. Подумай, а что сказал бы на это ангел-хранитель, который защищает тебя от неприятностей и зла?”
        <br/>{'     '}
        <br/>{'     '}ЧТО ГОВОРИТ ТЕБЕ КУКЛА “К тебе пришла мудрая дама. Возьми её так, чтобы она смотрела на тебя. Что она тебе говорит?” Ребёнок должен ответить прямой речью. Обычно дети вкладывают в уста “дамы” то, что заботит их больше всего. Игра предназначена для того, чтобы извлечь из подсознания ребёнка актуальную для него проблему, связанную обычно с осознанием определённого недостатка.
        <br/>{'     '}
        <br/>{'     '}Я РЕЖИССЁР СОБСТВЕННОЙ ЖИЗНИ
        <br/>{'     '}Предложите ребёнку составить сценарий жизни своей семьи, своей будущей жизни, включая полезные привычки. Обсудите.
        <br/>{'     '}
        <br/>{'     '}ЗЕРКАЛО ЛЮБВИ
        <br/>{'     '}Участники садятся лицом друг к другу и берутся за руки. Один — основной участник, другой — “зеркало”. Основной участник в течение примерно 3 минут говорит, точнее, завершает фразу: “Мне нравится во мне то, что я...”, а “зеркало” каждый раз отвечает: “Я люблю тебя за это”. Затем основной участник завершает фразу: “Мне не нравится во мне то, что я...” И зеркало отвечает: “Я всё равно тебя люблю”.
        <br/>{'     '}<b>Полезные привычки школьника</b>
        <br/>{'     '}Очень важно, чтобы во время учебной деятельности ребёнок приобретал полезные привычки, которые будут сопровождать его при взрослении и переходе из класса в класс и помогать ему. Что можно отнести к таким привычкам?
        <br/>{'     '}♦	Аккуратное выполнение домашнего задания;
        <br/>{'     '}♦	любовь к чтению;
        <br/>{'     '}♦	бережное отношение к школьным принадлежностям;
        <br/>{'     '}♦	привычку класть вещи на свои места;
        <br/>{'     '}♦	соблюдение режима дня;
        <br/>{'     '}♦	соблюдение здорового образа жизни.
        <br/>{'     '}Приучать ребёнка к полезным привычкам нужно постепенно. Обсудите с вашим взрослеющим малышом план самовоспитания.
        <br/>{'     '}План составлен на основе выполнения ребёнком самообязательств. Порядок их таков:
        <br/>{'     '}1.	Составить режим дня и строго выполнять его.
        <br/>{'     '}2.	Никогда не приходить на занятия, не подготовившись к ним.
        <br/>{'     '}3.	Приучить себя доводить начатое дело до конца.
        <br/>{'     '}4.   Каждое дело выполнять качественно, относиться добросовестно к выполнению любого поручения.
        <br/>{'     '}5. Научиться самообладанию, установить самоконтроль за своими мыслями, действиями и поступками.
        <br/>{'     '}
        <br/>{'     '}<b>Привычка уважительного отношении к окружающим</b>
        <br/>{'     '}Среди положительных нравственных привычек можно назвать привычку приветствовать друг друга, благодарить за помощь, разговаривать вежливо, не обижать малышей, уважать старших.
        <br/>{'     '}День за днём формируем у ребёнка уважение к окружающим, и в первую очередь собственным примером. Прочтите несколько строк из книги С. Соловейчика “Педагогика для всех”:
        <br/>{'     '}“Неторопливо стараемся мы пробудить в ребёнке доброе чувство человека...
        <br/>{'     '}—	Не затрудняй! — учим мы его, стараясь не доставлять ему лишних хлопот.
        <br/>{'     '}—	Чужая вещь — не трогай! — и мы тоже без спроса ничего не трогаем на столе у сына-школьника.
        <br/>{'     '}—	Чужое время — не занимай! — и мы стараемся поменьше обременять сына всевозможными “сделай”, “сходи” и всегда договариваемся о помощи заранее, как поступили бы, если бы обращались к чужому.
        <br/>{'     '}—	Чужое чувство — не задевай! — и мы боимся хоть взглядом обидеть ребёнка.
        <br/>{'     '}—	В чужой мир не вторгайся! — и мы никогда не пристаём с назойливыми вопросами.
        <br/>{'     '}—	Чужой покой — не нарушай!
        <br/>{'     '}—	Чужое желание — уважай!
        <br/>{'     '}—	Чужая мысль — не торопись оспорить!
        <br/>{'     '}10—15 лет такого воспитания, и, может быть, чувство человека хоть в слабой форме укоренится в душе сына или дочери”
        <br/>{'     '}
        <br/>{'     '}В продолжение темы хочется вспомнить одно старинное предание.
        <br/>{'     '}В некотором государстве жил-был добрый король. Однажды в холодный зимний вечер, когда метель застила глаза и ветер наметал сугробы, он встретил на дороге замерзающего нищего. У короля сжалось сердце, и, не задумываясь, он снял свою тёплую мантию и завернул в неё несчастного. “Идём, — сказал он ему, поднимая на ноги, — в моей стране найдётся и для тебя любящее сердце...” Так появилась совесть в человеческой душе — неожиданно, но захватывающе и властно. Её проявление можно сравнить с подземным толчком, в котором выступает сокровенная сила. Доверительные беседы, чтение литературы, просмотр спектаклей с нравственной тематикой помогают совести овладеть душой ребёнка. И привычка нравственного поведения становится нормой его жизни.
        <br/>{'     '}
        <br/>{'     '}<b>«Сорняки и розы»</b>
        <br/>{'     '}Все полезные и вредные привычки человек взращивает в себе сам. Вредные привычки, как сорная трава, очень легко пускают корни и прочно приживаются. А полезные требуют постоянного ухода — дело это нелёгкое, изо дня в день нужно трудиться, чтобы получить результат. Но зато полезные привычки делают из своего хозяина настоящего человека.
        <br/>{'     '}Прочитайте отрывок из сказки А. де Сент-Экзюпери “Маленький принц”:
        <br/>{'     '}“Каждый день я узнавал что-нибудь новое о его планете, о том, как он её покинул и как странствовал. Он рассказывал об этом понемножку, когда приходилось к слову.
        <br/>{'     '}Так, на третий день я узнал о трагедии с баобабами. Это тоже вышло из-за барашка. Казалось, Маленьким принцем вдруг овладели тяжкие сомнения, и он спросил:
        <br/>{'     '}—	Скажи, ведь правда, барашки едят кусты?
        <br/>{'     '}-         Да, правда.
        <br/>{'     '} —	Вот хорошо!
        <br/>{'     '}Услыхав про слонов, Маленький принц засмеялся:
        <br/>{'     '}—	Их пришлось бы поставить друг на друга... А потом сказал рассудительно:
        <br/>{'     '}—	Баобабы сперва, пока не вырастут, бывают совсем маленькие.
        <br/>{'     '}—	Это верно, но зачем твоему барашку есть маленькие баобабы?
        <br/>{'     '}—А как же! — воскликнул он, словно речь шла о самых простых, азбучных истинах. И пришлось мне поломать голову, пока я додумался, в чём тут дело.
        <br/>{'     '}На планете Маленького принца, как и на любой другой планете, растут травы полезные и вредные. А значит, есть там хорошие семена хороших, полезных трав и вредные семена дурной, сорной травы. Но ведь семена невидимы. Они спят глубоко  под землёй, пока одно из них не вздумает проснуться. Тогда оно пускает росток; он расправляется и тянется к солнцу, сперва такой милый, безобидный.
        <br/>{'     '}Если это будущий редис или розовый куст, пусть  растёт на здоровье. Но если это какая-нибудь дурная трава, надо вырвать её с корнем, как только её узнаешь. И вот на планете Маленького принца есть ужасные, зловредные семена... это семена баобабов. Если от них не избавиться, они завладеют всей  планетой, пронижут её насквозь своими корнями.
        <br/>{'     '}И если планета очень маленькая, а баобабов много, они разорвут ее на клочки.
        <br/>{'     '}— Есть такое твердое правило, — сказал мне  Маленький принц. — Встал поутру, умылся, привёл себя в порядок — и сразу же приведи в порядок свою планету. Непременно надо каждый день выпалывать баобабы, как только их уже можно отличить от розовых кустов, это скучная работа, но совсем не трудная”.
        <br/>{'     '}Обсудите этот отрывок с ребёнком.
        <br/>{'     '}✓	Какую замечательную привычку Маленький принц взрастил в себе?
        <br/>{'     '}✓	Можно ли баобабы сравнить с плохими привычками, которые человек побеждает каждый день в себе?
        <br/>{'     '}
        <br/>{'     '}Подготовила Ирина БУТОРИНА// Рюкзачок для пап и мам. – 2008. - №11. – с. 2-8.
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    return (
      <BaseTextComponent title={'Какие бывают привычки'} data={data} epigraph={epigraph}/>
    );
  }
}

export default Habits;
