import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class Hardening extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Чтобы приобщить ребенка к закаливанию, са¬мим родителям необходимо быть примером. Народ¬ная мудрость гласит: один добрый пример лучше ста слов. Кроме того, младшему школьнику следует не только объяснить, с какой целью и как выполняются закаливающие процедуры, но и создать ситуацию успеха в их выполнении: выразить уверенность, что у ребенка все получится, похвалить.
        <br/>{'     '}Прежде чем начинать закаливающие процедуры:
        <br/>{'     '}•	проконсультируйтесь с врачом-педиатром о воз¬можности закаливания ребенка;
        <br/>{'     '}•	развейте у ребенка мотивацию, вызовите у не¬го желание закаляться;
        <br/>{'     '}•	будьте сами обязательными в выполнении за¬каливающих процедур (закаляйтесь вместе с ребен¬ком, особенно первое время);
        <br/>{'     '}•	учитывайте особенности быта, благопри¬ятствующие процессу закаливания или затрудня¬ющие его;
        <br/>{'     '}•	выбирайте методику закаливания, приняв во внимание наличие физических и психических нагру¬зок младшего школьника.
        <br/>{'     '}Все существующие методики закаливания делят¬ся (по И. Брязгунову) на традиционные и нетради¬ционные. К традиционным относятся процедуры в пределах положительных температур. Нетрадици¬онное закаливание связано с наиболее сильным воз¬действием на организм. Это закаливание воздухом на морозе, обтирание снегом, хождение босиком по снегу, купание в открытых водоемах в холодное вре¬мя года.
        <br/>{'     '}Основные процедуры в традиционной системе закаливания — солнечные и воздушные ванны, вод¬ные процедуры.
        <br/>{'     '}Как правило, за лето младшие школьники зна¬чительно подрастают. Загорелые, они я выглядят гораздо здоровее и крепче, чем  накануне каникул. Однако следует помнить, что для здоровья полезно, если общая дли¬тельность непрерывной солнечной ванны не превы¬шает 1 часа. Не следует заставлять детей загорать ле¬жа, “как мама”, — пусть они бегают, играют. Обяза¬тельно укрывайте голову ребенка легким светлым головным убором.
        <br/>{'     '}Самая приятная и любимая младшими школь¬никами закаливающая процедура — купание или пла¬вание. Это очень эффективное оздоравливающее средство, так как на организм одновременно воздействуют три закаливающих фактора: солнце, воздух  и вода. И если загорать лучше в дообеденное время, то купаться предпочтительней после полудня. Для  первого купания будет достаточно 4—5 мин, потом — до 20 мин.
        <br/>{'     '}Закаливание в летний период носит название “стихийная закаленность” и без последующего под крепления закаливающими процедурами эффект от  нее исчезает через 1—1,5 месяца.
        <br/>{'     '}Человеческая стопа — это своеобразный щит от I болезней. Босохождение как средство закаливания I еще в Древней Греции являлось своего рода куль¬том. Греческие дети получали право на ношение обуви только с 18 лет. Сегодня учеными установлено, что ходьба босиком надежно защищает ребен¬ка от плоскостопия, тренирует мышцы стоп. Начи¬нать закаливание ходьбой босиком лучше всего с  хождения в теплой комнате по ковру или половику, затем по полу. Особенно полезно ходить без обуви по мокрой траве, так как травы постоянно выделяют соки, многие из которых обладают целебными свойствами.
        <br/>{'     '}Закаливание организма водой начинают обычно с обтирания. Смочив по¬лотенце или рукавичку водой, обтирают шею, ру¬ки, грудь, спину, ноги. Затем тело растирают су¬хим полотенцем до легкого покраснения кожи. Когда организм ребенка привыкнет к обтира¬нию, можно перейти к обливанию и душу. Перво¬начальная температура воды при этом должна быть близка к температуре тела, приятна для ре¬бенка, чтобы он не испытывал негативных ощу¬щений. Впоследствии каждые 2—3 дня температу¬ру можно снижать на 1 °С, доведя ее до комнатной, а то и ниже.
        <br/>{'     '}Однако закаливание принесет пользу лишь в том случае, если будет проводиться последователь¬но, систематично, с учетом физического и психи¬ческого состояния ребенка.
        <p style={{textAlign: 'center'}}>
          <b>Двигательная активность</b>
        </p>
        <br/>{'     '}Физкультура — это та сфера, которая раскрепоща¬ет родителей и детей, уменьшает дефицит их обще¬ния, создает иммунитет против вредных привычек. Совместный физкультурный досуг в значительной ме¬ре снимает проблему распределения домашних дел. Семья как бы превращается в бригаду, принцип ко¬торой “вместе работать — вместе отдыхать”.
        <br/>{'     '}Любой ребенок биологически стремится к движе¬нию, это естественное его состояние. Однако сегод¬ня без дополнительных занятий физическими упраж¬нениями (не учитывая уроки физкультуры в школе) современные школьники не могут быть здоровыми и выдержать все увеличивающиеся психические и эмоциональные нагрузки. Им просто необходима по¬мощь взрослых, которые могут уменьшить двига¬тельный голод, постоянно занимаясь до¬ма с детьми, тем более что игры, физические упражнения, спорт — едва ли не самое инте¬ресное в жизни ребенка. Посредством игры ребенок может научиться следовать правилам, управлять сво¬им вниманием, памятью, контролировать действия, координационные способности.
        <br/>{'     '}Если ребенок обычно пассивен, не проявляет интереса к игре — это сигнал некого отклонения в его развитии. Обязательно научите своих детей играть в прятки, салки, жмурки, “классики”, “кон¬верт”, обучите их игре со скакалкой, мячом, проде¬монстрируйте игры с элементами силовых упражне¬ний, “бой петухов” и др.
        <br/>{'     '}Лучше всего для физических занятий детей от 3 до 6 лет подходит домашний спортивный комплекс семьи Никитиных или аналогичные ему конструк¬ции, которые позволяют выполнять различные ви¬ды упражнений для развития разных групп мышц, имеют эстетичный вид, компактны, надежно крепят¬ся. Эти комплексы могут быть использованы и 2— 3-летним малышом, и его папой или мамой.
        <br/>{'     '}Большинство спортивных комплексов занимают в квартире 3,5—4,0 кв. метра площади и содержат до 12 различных снарядов, многие из них могут быть представлены в сокращенных вариантах. Все зави¬сит от свободного места и финансовых возможнос¬тей семьи. Спортивные снаряды комплексов пригод¬ны для выполне¬ния различных упражнений. Так, для упражнений в висе имеются пе¬рекладины, коль¬ца и трапеции, снарядом для пры¬жков служит пры¬жковая лиана и компактный батут.
        <br/>{'     '}Есть в комплексе и качели. Наклонная треуголь¬ная лестница, с небольшим углом подъема, которая связывает все снаряды комплекса, служит развитию равновесия. Для скатывания предусмотрена на¬клонная горка. В комплексе имеется большой выбор снарядов для лазанья: обычный канат, наклонный канат, наклонная лестница, вертикальные качели. В совместных занятиях родителей и детей заклю¬чен большой воспитательный смысл. Даже самый маленький ребенок стремится посоревноваться с па¬пой, мамой, братом или сестрой. Главное — не застав¬лять детей подолгу заниматься на снарядах: до по¬явления чувства усталости и не более!
        <br/>{'     '}Для создания домашнего стадиона подойдет угол комнаты, часть балкона — лишь бы место бы¬ло светлое, чистое, проветриваемое, незагроможденное. В доме желательно иметь удобную обувь и одеж¬ду, соответствующий инвентарь: скакалку, мяч, об¬руч, гимнастическую полку длинной 70—80 см, ган¬тели разного веса от 0,5 до 2 кг, коврик для отдель¬ных упражнений.
        <br/>{'     '}Не забывайте и об утренней гимнастике. Прово¬дить ее желательно на свежем воздухе, если это не¬возможно, например, в городе, то занятия необхо¬димо проводить в хорошо проветренном помещении при температуре воздуха +16—17 °С. Для начала за¬нятий утренней гимнастикой не требуется никакой подготовки: поднимитесь сами, разбудите малыша (если не он разбудил вас), откройте форточку или окно, включите музыку и, пожалуйста, набирайтесь бодрости, сил и здоровья.
        <br/>{'     '}При выполнении упражнений нужно научить ребенка правильному дыханию — малыш должен ды¬шать глубоко, ровно и спокой¬но, делая полный выдох; сле¬дует указывать, когда делать вдох, а когда выдох. Также необходимо следить, чтобы ребенок не делал лишних дви¬жений в суставах, например, не сгибал колени при выпол¬нении движений туловища.
        <br/>{'     '}Занимаясь утренней гим¬настикой, можно использо¬вать готовые комплексы упражнений, а можно придумать свои. Упражнения следует подбирать, учитывая индивидуальные физические особенности ребенка, с таким расчетом, чтобы в них принимали участие основные мышеч¬ные группы и системы детского организма.
        <br/>{'     '}Примерная схема комплекса утренней гимнасти¬ки может быть такова:
        <br/>{'     '}а)	потягивание;
        <br/>{'     '}б)	ходьба (на месте или в движении);
        <br/>{'     '}в)	упражнения для мышц шеи, рук и плечево¬го пояса;
        <br/>{'     '}г)	упражнения для мышц туловища и живота;
        <br/>{'     '}д)	упражнения для мышц ног (приседания и прыжки);
        <br/>{'     '}е)	упражнения общего воздействия с участием мышц ног и рук (махи, вы¬пады вперед (в стороны);
        <br/>{'     '}ж)	упражнения сило¬вого характера;
        <br/>{'     '}з)	упражнения на расслабление;
        <br/>{'     '}и)	дыхательные упражнения.
        <br/>{'     '}При подборе упражнений особое внимание не¬обходимо уделять их доступности для ребенка и раз¬нообразию. Раз в месяц в зависимости от заинтере¬сованности ребенка комплексы упражнений реко¬мендуется менять, причем делать это через три не¬дели занятий по данному комплексу, начиная заме¬нять отдельные его упражнения.
        <br/>{'     '}Не следует перегружать комплекс большим ко¬личеством упражнений и включать в него упражне¬ния с дополнительной нагрузкой, а вот упражнения для осанки, гимнастическая палка, скакалка, мяч и другие спортивные снаряды будут кстати. До и по¬сле зарядки 2—3 раза в неделю проверяйте пульс ре¬бенка. Если после занятий он не превышает 100—110 ударов в минуту, то все в порядке.
        <br/>{'     '}Утренняя гимнастика не только способствует про¬буждению организма, но и оказывает определенный тренирующий эффект. После зарядки можно пред¬ложить ребенку легкий бег, а затем рекомендуются водные процедуры.
        <br/>{'     '}Хорошо развивает длинные мышцы тела, то есть естественный мышечный корсет, который укрепля¬ет позвоночник и не дает ему искривляться, езда на велосипеде. Дети обожают кататься на велосипеде, а
        <br/>{'     '}вот многие родители опасаются, что это мо¬жет принести вред здоровью их детей.
        <br/>{'     '}Однако для физио¬логического развития как девочек, так и мальчиков езда на ве¬лосипеде совершен¬но безопасна. Сущест¬вует мнение, что она может негативно отразиться на будущем материнстве. Но это не так. Тысячи ве¬лосипедисток становятся матерями.
        <br/>{'     '}Что касается позвоночника, то и тут опасения на¬прасны. Позвоночник искривляется от малоподвиж¬ного образа жизни, от слабости мышц спины и по¬ясницы. Велосипед здесь ни при чем. Напротив, ког¬да ребенок едет на велосипеде, опираясь на руль ру-ками, часть веса тела и головы падает на руки. На позвоночник нагрузка меньше. Мышцы работа¬ют, напряжены. Ребенок то садится, то слезает с ве¬лосипеда. Преодолевая горку, встает с седла велоси-педа, “танцует” на педалях. Здесь все — динамика, по¬переменное напряжение мышц спины и пояса, хо¬рошее их кровоснабжение.
        <br/>{'     '}Другое дело, что только кататься на велосипеде ре¬бенку недостаточно. Надо делать гимнастику, плавать, ходить на лыжах, бегать, играть в спортивные игры.
        <br/>{'     '}Существует много методик и специальной лите¬ратуры, посвященных развитию физических ка¬честв ребенка. И каждый взрослый может выбрать то, что ему и его ребенку по вкусу, по средствам.
        <br/>{'     '}По материалам журнала «Пачатковая школа»//Рюкзачок для пап и мам. - 2008. -    №7. – с. 3-4; с. 5-7.
      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    return (
      <BaseTextComponent title={'Закаливание'} data={data} epigraph={epigraph}/>
    );
  }
}

export default Hardening;
