import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class Hardening extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Чтобы приобщить ребенка к закаливанию, самим родителям необходимо быть примером. Народная мудрость гласит: один добрый пример лучше ста слов. Кроме того, младшему школьнику следует не только объяснить, с какой целью и как выполняются закаливающие процедуры, но и создать ситуацию успеха в их выполнении: выразить уверенность, что у ребенка все получится, похвалить.
        <br/>{'     '}Прежде чем начинать закаливающие процедуры:
        <br/>{'     '}•	проконсультируйтесь с врачом-педиатром о возможности закаливания ребенка;
        <br/>{'     '}•	развейте у ребенка мотивацию, вызовите у него желание закаляться;
        <br/>{'     '}•	будьте сами обязательными в выполнении закаливающих процедур (закаляйтесь вместе с ребенком, особенно первое время);
        <br/>{'     '}•	учитывайте особенности быта, благоприятствующие процессу закаливания или затрудняющие его;
        <br/>{'     '}•	выбирайте методику закаливания, приняв во внимание наличие физических и психических нагрузок младшего школьника.
        <br/>{'     '}Все существующие методики закаливания делятся (по И. Брязгунову) на традиционные и нетрадиционные. К традиционным относятся процедуры в пределах положительных температур. Нетрадиционное закаливание связано с наиболее сильным воздействием на организм. Это закаливание воздухом на морозе, обтирание снегом, хождение босиком по снегу, купание в открытых водоемах в холодное время года.
        <br/>{'     '}Основные процедуры в традиционной системе закаливания — солнечные и воздушные ванны, водные процедуры.
        <br/>{'     '}Как правило, за лето младшие школьники значительно подрастают. Загорелые, они я выглядят гораздо здоровее и крепче, чем  накануне каникул. Однако следует помнить, что для здоровья полезно, если общая длительность непрерывной солнечной ванны не превышает 1 часа. Не следует заставлять детей загорать лежа, "как мама", — пусть они бегают, играют. Обязательно укрывайте голову ребенка легким светлым головным убором.
        <br/>{'     '}Самая приятная и любимая младшими школьниками закаливающая процедура — купание или плавание. Это очень эффективное оздоравливающее средство, так как на организм одновременно воздействуют три закаливающих фактора: солнце, воздух  и вода. И если загорать лучше в дообеденное время, то купаться предпочтительней после полудня. Для  первого купания будет достаточно 4—5 мин, потом — до 20 мин.
        <br/>{'     '}Закаливание в летний период носит название "стихийная закаленность" и без последующего под крепления закаливающими процедурами эффект от  нее исчезает через 1—1,5 месяца.
        <br/>{'     '}Человеческая стопа — это своеобразный щит от I болезней. Босохождение как средство закаливания I еще в Древней Греции являлось своего рода культом. Греческие дети получали право на ношение обуви только с 18 лет. Сегодня учеными установлено, что ходьба босиком надежно защищает ребенка от плоскостопия, тренирует мышцы стоп. Начинать закаливание ходьбой босиком лучше всего с  хождения в теплой комнате по ковру или половику, затем по полу. Особенно полезно ходить без обуви по мокрой траве, так как травы постоянно выделяют соки, многие из которых обладают целебными свойствами.
        <br/>{'     '}Закаливание организма водой начинают обычно с обтирания. Смочив полотенце или рукавичку водой, обтирают шею, руки, грудь, спину, ноги. Затем тело растирают сухим полотенцем до легкого покраснения кожи. Когда организм ребенка привыкнет к обтиранию, можно перейти к обливанию и душу. Первоначальная температура воды при этом должна быть близка к температуре тела, приятна для ребенка, чтобы он не испытывал негативных ощущений. Впоследствии каждые 2—3 дня температуру можно снижать на 1 °С, доведя ее до комнатной, а то и ниже.
        <br/>{'     '}Однако закаливание принесет пользу лишь в том случае, если будет проводиться последовательно, систематично, с учетом физического и психического состояния ребенка.
        <br/>{'     '}<b>Двигательная активность</b>
        <br/>{'     '}Физкультура — это та сфера, которая раскрепощает родителей и детей, уменьшает дефицит их общения, создает иммунитет против вредных привычек. Совместный физкультурный досуг в значительной мере снимает проблему распределения домашних дел. Семья как бы превращается в бригаду, принцип которой "вместе работать — вместе отдыхать".
        <br/>{'     '}Любой ребенок биологически стремится к движению, это естественное его состояние. Однако сегодня без дополнительных занятий физическими упражнениями (не учитывая уроки физкультуры в школе) современные школьники не могут быть здоровыми и выдержать все увеличивающиеся психические и эмоциональные нагрузки. Им просто необходима помощь взрослых, которые могут уменьшить двигательный голод, постоянно занимаясь дома с детьми, тем более что игры, физические упражнения, спорт — едва ли не самое интересное в жизни ребенка. Посредством игры ребенок может научиться следовать правилам, управлять своим вниманием, памятью, контролировать действия, координационные способности.
        <br/>{'     '}Если ребенок обычно пассивен, не проявляет интереса к игре — это сигнал некого отклонения в его развитии. Обязательно научите своих детей играть в прятки, салки, жмурки, "классики", "конверт", обучите их игре со скакалкой, мячом, продемонстрируйте игры с элементами силовых упражнений, "бой петухов" и др.
        <br/>{'     '}Лучше всего для физических занятий детей от 3 до 6 лет подходит домашний спортивный комплекс семьи Никитиных или аналогичные ему конструкции, которые позволяют выполнять различные виды упражнений для развития разных групп мышц, имеют эстетичный вид, компактны, надежно крепятся. Эти комплексы могут быть использованы и 2— 3-летним малышом, и его папой или мамой.
        <br/>{'     '}Большинство спортивных комплексов занимают в квартире 3,5—4,0 кв. метра площади и содержат до 12 различных снарядов, многие из них могут быть представлены в сокращенных вариантах. Все зависит от свободного места и финансовых возможностей семьи. Спортивные снаряды комплексов пригодны для выполнения различных упражнений. Так, для упражнений в висе имеются перекладины, кольца и трапеции, снарядом для прыжков служит прыжковая лиана и компактный батут.
        <br/>{'     '}Есть в комплексе и качели. Наклонная треугольная лестница, с небольшим углом подъема, которая связывает все снаряды комплекса, служит развитию равновесия. Для скатывания предусмотрена наклонная горка. В комплексе имеется большой выбор снарядов для лазанья: обычный канат, наклонный канат, наклонная лестница, вертикальные качели. В совместных занятиях родителей и детей заключен большой воспитательный смысл. Даже самый маленький ребенок стремится посоревноваться с папой, мамой, братом или сестрой. Главное — не заставлять детей подолгу заниматься на снарядах: до появления чувства усталости и не более!
        <br/>{'     '}Для создания домашнего стадиона подойдет угол комнаты, часть балкона — лишь бы место было светлое, чистое, проветриваемое, незагроможденное. В доме желательно иметь удобную обувь и одежду, соответствующий инвентарь: скакалку, мяч, обруч, гимнастическую полку длинной 70—80 см, гантели разного веса от 0,5 до 2 кг, коврик для отдельных упражнений.
        <br/>{'     '}Не забывайте и об утренней гимнастике. Проводить ее желательно на свежем воздухе, если это невозможно, например, в городе, то занятия необходимо проводить в хорошо проветренном помещении при температуре воздуха +16—17 °С. Для начала занятий утренней гимнастикой не требуется никакой подготовки: поднимитесь сами, разбудите малыша (если не он разбудил вас), откройте форточку или окно, включите музыку и, пожалуйста, набирайтесь бодрости, сил и здоровья.
        <br/>{'     '}При выполнении упражнений нужно научить ребенка правильному дыханию — малыш должен дышать глубоко, ровно и спокойно, делая полный выдох; следует указывать, когда делать вдох, а когда выдох. Также необходимо следить, чтобы ребенок не делал лишних движений в суставах, например, не сгибал колени при выполнении движений туловища.
        <br/>{'     '}Занимаясь утренней гимнастикой, можно использовать готовые комплексы упражнений, а можно придумать свои. Упражнения следует подбирать, учитывая индивидуальные физические особенности ребенка, с таким расчетом, чтобы в них принимали участие основные мышечные группы и системы детского организма.
        <br/>{'     '}Примерная схема комплекса утренней гимнастики может быть такова:
        <br/>{'     '}а)	потягивание;
        <br/>{'     '}б)	ходьба (на месте или в движении);
        <br/>{'     '}в)	упражнения для мышц шеи, рук и плечевого пояса;
        <br/>{'     '}г)	упражнения для мышц туловища и живота;
        <br/>{'     '}д)	упражнения для мышц ног (приседания и прыжки);
        <br/>{'     '}е)	упражнения общего воздействия с участием мышц ног и рук (махи, выпады вперед (в стороны);
        <br/>{'     '}ж)	упражнения силового характера;
        <br/>{'     '}з)	упражнения на расслабление;
        <br/>{'     '}и)	дыхательные упражнения.
        <br/>{'     '}При подборе упражнений особое внимание необходимо уделять их доступности для ребенка и разнообразию. Раз в месяц в зависимости от заинтересованности ребенка комплексы упражнений рекомендуется менять, причем делать это через три недели занятий по данному комплексу, начиная заменять отдельные его упражнения.
        <br/>{'     '}Не следует перегружать комплекс большим количеством упражнений и включать в него упражнения с дополнительной нагрузкой, а вот упражнения для осанки, гимнастическая палка, скакалка, мяч и другие спортивные снаряды будут кстати. До и после зарядки 2—3 раза в неделю проверяйте пульс ребенка. Если после занятий он не превышает 100—110 ударов в минуту, то все в порядке.
        <br/>{'     '}Утренняя гимнастика не только способствует пробуждению организма, но и оказывает определенный тренирующий эффект. После зарядки можно предложить ребенку легкий бег, а затем рекомендуются водные процедуры.
        <br/>{'     '}Хорошо развивает длинные мышцы тела, то есть естественный мышечный корсет, который укрепляет позвоночник и не дает ему искривляться, езда на велосипеде. Дети обожают кататься на велосипеде, а
        <br/>{'     '}вот многие родители опасаются, что это может принести вред здоровью их детей.
        <br/>{'     '}Однако для физиологического развития как девочек, так и мальчиков езда на велосипеде совершенно безопасна. Существует мнение, что она может негативно отразиться на будущем материнстве. Но это не так. Тысячи велосипедисток становятся матерями.
        <br/>{'     '}Что касается позвоночника, то и тут опасения напрасны. Позвоночник искривляется от малоподвижного образа жизни, от слабости мышц спины и поясницы. Велосипед здесь ни при чем. Напротив, когда ребенок едет на велосипеде, опираясь на руль ру-ками, часть веса тела и головы падает на руки. На позвоночник нагрузка меньше. Мышцы работают, напряжены. Ребенок то садится, то слезает с велосипеда. Преодолевая горку, встает с седла велоси-педа, “танцует” на педалях. Здесь все — динамика, попеременное напряжение мышц спины и пояса, хорошее их кровоснабжение.
        <br/>{'     '}Другое дело, что только кататься на велосипеде ребенку недостаточно. Надо делать гимнастику, плавать, ходить на лыжах, бегать, играть в спортивные игры.
        <br/>{'     '}Существует много методик и специальной литературы, посвященных развитию физических качеств ребенка. И каждый взрослый может выбрать то, что ему и его ребенку по вкусу, по средствам.
        <br/>
        <br/>{'     '}По материалам журнала «Пачатковая школа»//Рюкзачок для пап и мам. - 2008. - №7. – с. 3-4; с. 5-7.

      </p>
    );
  }

  getEpigraph(){
    return null;
  }

  render() {
    const data = this.getData();
    const epigraph = this.getEpigraph();
    return (
      <BaseTextComponent title={'Закаливание'} data={data} epigraph={epigraph}/>
    );
  }
}

export default Hardening;
