import React from 'react';

import BaseTextComponent from '../../../shared/BaseTextComponent';

class Hygiene extends React.Component {

  getData(){
    return (
      <p style={{textAlign: 'left', whiteSpace: 'pre-wrap'}}>
        {'     '}Большинству детей младшего школьного возраста не свойственно стремление к выполнению правил личной гигиены, так как их волевая сфера только формируется, а значение чистоты тела для здоровья недостаточно осознанно. Поэтому родители должны хорошо продумать приемы гигиенического воспитания.
        <br/>{'     '}В каждой семье существуют свои традиции, нормы и правила гигиены. И все же младший школьник должен обязательно выполнять, возможно вначале с помощью родителей, следующие правила:
        <br/>{'     '}• обязательно мыть руки перед едой и после посещения туалета, вытирать их, чтобы на коже не образовывались трещинки;
        <br/>{'     '}• каждый день мыть ноги и обязательно перед сном;
        <br/>{'     '}• чистить зубы не реже двух раз в день: утром и вечером. Если есть необходимость, то и в течение дня;
        <br/>{'     '}• ежедневно принимать душ, обмывать наружные половые органы;
        <br/>{'     '}• срезать ногти на руках и ногах по мере необходимости (на пальцах рук — дугообразно, на ногах — прямо, не срезая углов);
        <br/>{'     '}• своевременно менять постельное белье.
        <br/>{'     '}Особенно важно заботиться о здоровье кожи. Здоровая кожа обладает бактерицидной активностью — способностью убивать микробы, защищая организм. К тому же к коже подходит огромное количество нервных окончаний и рецепторов, которые позволяют ощущать холод, тепло, боль. Поэтому так важно не только научить своего ребенка правильно ухаживать за кожей, но и объяснить ему, когда и почему это необходимо делать. Наиболее эффективной оказывается эстетическая мотивация (грязные руки, неаккуратно подстриженные ногти некрасивы, на них неприятно смотреть).
        <br/>{'     '}Не надо стесняться разговаривать с ребенком на тему поддержания чистоты наружных половых органов. Следует объяснить, что наружные половые органы — такая же часть человеческого тела, как лицо или руки, а поэтому и уход за ними должен быть таким же тщательным: их необходимо мыть теплой водой с мылом утром и вечером.
        <br/>{'     '}Прическа — часть имиджа не только школьника, но и любого человека. Короткие прически у мальчиков и аккуратно уложенные волосы девочек дисциплинируют детей, позволяют им выглядеть красиво, не мешают в процессе разнообразных видов деятельности в школе и дома. Волосы ребенку рекомендуется мыть по мере загрязнения. Не забывайте, что у младшего школьника должна быть индивидуальная расческа с неострыми зубьями, чтобы случайно не повредить кожу головы. Делая прическу дочери, избегайте сильного стягивания волос резинками, заколками, т. к. это приводит к их выпадению.
        <br/>{'     '}Одним из гигиенических требований, для выполнения которого младшим школьникам необходим пример взрослых, является уход за зубами. Установлено, что у детей, чистящих зубы регулярно (два раза в день) и правильно, кариес и пародонтоз встречаются в два раза реже, чем у тех, кто не ухаживает за полостью рта и делает это нерегулярно и небрежно. Хорошо напомнить сыну или дочери о том, как преображает человека с обычной внешностью ослепительно белый ряд красивых здоровых зубов. Расскажите, что перед тем, как начать чистить зубы, нуж-но тщательно прополоскать рот водой комнатной температуры, затем на смоченную водой зубную щетку нанести немного детской(!) зубной пасты. Чистить передние и боковые поверхности зубов следует так: верхней челюсти — сверху вниз, нижней — снизу вверх. При чистке жевательной поверхности зубов щеткой выполняются круговые движения. В конце следует тщательно полоскать рот водой.
        <br/>{'     '}Правильно подобрать пасту поможет детский стоматолог. Выбирая зубную щетку, обращайте внимание на размер ее головки и качество щетины. Предпочтительнее приобрести зубную щетку средней жесткости с искусственной щетиной, более прочной и гигиеничной. Ручка зубной щетки должна соответствовать размеру ладони ребенка, чтобы было удобно держать ее в кулаке, длина головки должна быть не более 2,5 см. Менять щетку необходимо по мере износа, но не реже одного раза в три месяца.
        <br/>{'     '}Важное значение для здоровья детей, их гармоничного физического развития и повышения работоспособности имеет одежда.
        <br/>{'     '}Гигиенические требования к одежде ребенка обусловлены не только погодными условиями и характером деятельности, но и возрастными анатомо-физиологическими особенностями детей, прежде всего несовершенством регуляции теплообмена. Одежда должна соответствовать возрасту и размерам тела, быть легкой, удобной и красивой, воздухопроницаемой и гигроскопичной.
        <br/>{'     '}Подбирать обувь лучше всего по размеру (не на вырост!), отдавая предпочтение натуральной коже. Для профилактики плоскостопия ребенку лучше покупать обувь на небольшом по высоте (1,5—2 см) и достаточно широком каблуке или со стелькой-супинатором.
        <br/>
        <br/>
        <br/>{'     '}По материалам журнала «Пачатковая школа»//Рюкзачок для пап и мам. - 2008. -    №7. – с. 2-3.
      </p>
    );
  }

  render() {
    const data = this.getData();
    return (
      <BaseTextComponent title={'Гигиена'} data={data} />
    );
  }
}

export default Hygiene;
